notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-02 Mon 15:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ Notes</title>
<meta name="author" content="nukoseer" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">C++ Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5fcae37">Fundemental Differences Between C and C++</a>
<ul>
<li><a href="#orga1fc8f7">Syntax Differences</a>
<ul>
<li><a href="#orgd93e3a7">Implicit int</a></li>
<li><a href="#org6e5e270">Missing return statement in functions with non-void return type</a></li>
<li><a href="#orgab5f342">Implicit/default function declaration</a></li>
<li><a href="#orgfffa6a3">Declaration of functions without parameter</a></li>
<li><a href="#org4d122e5">Nameless parameters in function definitions</a></li>
<li><a href="#orge2159ad">Scope of for-statement</a></li>
</ul>
</li>
<li><a href="#org4a78720">Differences About Types and Type Conversions</a>
<ul>
<li><a href="#orgbc048ca">Logic data type (boolean)</a></li>
<li><a href="#org04097b5">User defined types</a></li>
<li><a href="#org6fe92b9">Empty structs</a></li>
<li><a href="#org7639379">Implicit conversion from arithmetic types to pointer types</a></li>
<li><a href="#org0f97733">Implicit conversion between different pointer types.</a></li>
<li><a href="#orgfd6042e">Implicit conversion from <code>void*</code> to <code>T*</code></a></li>
<li><a href="#org54c861a">Underlying enumeration type</a></li>
<li><a href="#orge741635">Implicit conversion from arithmetic types to enumeration types</a></li>
<li><a href="#org8030c64">Implicit conversion between different enumeration types</a></li>
<li><a href="#orga8b6161">Implicit conversion from enumeration types to arithmetic types.</a></li>
<li><a href="#orgfddcc77">Character literals</a></li>
<li><a href="#orgf00794e">String literals</a></li>
</ul>
</li>
<li><a href="#orgc6d437c">Differences About const Keyword</a>
<ul>
<li><a href="#org0ab305e">Initialization of const objects</a></li>
<li><a href="#orga1c3e64">Const expressions</a></li>
<li><a href="#org8d15c74">Global const objects and linkage</a></li>
<li><a href="#org863a45d">Implicit conversion from <code>const T*</code> to <code>T*</code></a></li>
</ul>
</li>
<li><a href="#org0446ecb">Differences About Value Categories</a>
<ul>
<li><a href="#org16f7f9c">Primary value categories</a></li>
<li><a href="#org0c51469">Prefix increment/decrement operator</a></li>
<li><a href="#org2aaf86b">Assignment operator</a></li>
<li><a href="#orgcc332de">Comma operator</a></li>
<li><a href="#orgbed6536">Ternary operator</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb415b13">C++ Topics</a>
<ul>
<li><a href="#orgebe69b7">Initialization</a>
<ul>
<li><a href="#org6801840">Default initialization</a></li>
<li><a href="#orgba11023">Zero initialization</a></li>
<li><a href="#orgc26323e">Copy initialization</a></li>
<li><a href="#orgd71aeec">Direct initialization</a></li>
<li><a href="#org344d22d">Direct-list / brace initialization (uniform initialization)</a></li>
<li><a href="#org3b49a89">Value initialization</a></li>
</ul>
</li>
<li><a href="#org4431e97">nullptr</a></li>
<li><a href="#org0c131c1">Reference Semantics</a>
<ul>
<li><a href="#org8d6ed5c">L-value references</a></li>
<li><a href="#org39e4188">L-value references and const semantics</a></li>
<li><a href="#org4075d4b">Differences between pointers and L-value references</a></li>
<li><a href="#org264e0d2">R-value references</a></li>
</ul>
</li>
<li><a href="#org1bbac5f">Type Deduction</a>
<ul>
<li><a href="#orgb94ae63">auto type deduction</a></li>
<li><a href="#orgf912347">decltype type deduction</a></li>
</ul>
</li>
<li><a href="#orgde594a7">Default Function Arguments</a></li>
<li><a href="#orgd123df8">Scoped enum / Enum class</a>
<ul>
<li><a href="#org9c0ccbc">Disadvantages of the traditional enum type</a></li>
<li><a href="#org85c7450">Advantages of the scoped enum type</a></li>
</ul>
</li>
<li><a href="#org68dbf70">Type Cast Operators</a>
<ul>
<li><a href="#org69878d0">Why C-style type cast is not enough?</a></li>
</ul>
</li>
<li><a href="#orgf8b7760">Function Overloading</a>
<ul>
<li><a href="#org41a5942">Function overload resolution</a></li>
</ul>
</li>
<li><a href="#org6b1ea2d">Name Mangling</a></li>
<li><a href="#orgfa343fc">One Definition Rule (ODR)</a></li>
<li><a href="#orgb1677a5">Inline functions</a></li>
<li><a href="#org3588f28">Inline variables</a></li>
<li><a href="#org2faa43b">constexpr</a>
<ul>
<li><a href="#org77ce377">constexpr variables</a></li>
<li><a href="#org60f4ea5">constexpr functions</a></li>
</ul>
</li>
<li><a href="#org561f0c2">Classes</a>
<ul>
<li><a href="#orgf5b92e0">Class definition</a></li>
<li><a href="#org1a46a1e">Access control</a></li>
<li><a href="#org7ebbd02">Non-static data members</a></li>
<li><a href="#org98a13af">Non-static member functions</a></li>
<li><a href="#org5140c92">Class scope</a></li>
<li><a href="#org4feddca">this keyword</a></li>
<li><a href="#orgb0a6a7f">Const member functions</a></li>
<li><a href="#orgcca7afb">mutable keyword</a></li>
<li><a href="#org876ba8b">Constructor and destructor of classes</a></li>
<li><a href="#orga3e8862">Special member functions</a></li>
<li><a href="#org156f984">Move Semantics</a></li>
<li><a href="#org48dd706">Default member initializer / In-class initializer</a></li>
<li><a href="#org43710c7">Delegating Constructor</a></li>
<li><a href="#orgde3dbb3">Temporary Objects</a></li>
<li><a href="#org8a6c8eb">Reference qualifiers</a></li>
<li><a href="#org7de554d">Conversion constructor</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5fcae37" class="outline-2">
<h2 id="org5fcae37">Fundemental Differences Between C and C++</h2>
<div class="outline-text-2" id="text-org5fcae37">
<p>
Main purpose of this section is to point out the differences between C and C++. It isn't about how code should or should not be written in C or C++. It is only about validity of the code.
</p>
</div>
<div id="outline-container-orga1fc8f7" class="outline-3">
<h3 id="orga1fc8f7">Syntax Differences</h3>
<div class="outline-text-3" id="text-orga1fc8f7">
</div>
<div id="outline-container-orgd93e3a7" class="outline-4">
<h4 id="orgd93e3a7">Implicit int</h4>
<div class="outline-text-4" id="text-orgd93e3a7">
<p>
If a function does not have a return type:
</p>
<ul class="org-ul">
<li>In C, it is allowed and compilers assume it returns <code>int</code>. It is also allowed in function declarations.</li>
<li>In C++, it is syntax error.</li>
</ul>
<p>
This code is valid in C and invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">return</span> x + <span style="color: #00bcff;">1</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e5e270" class="outline-4">
<h4 id="org6e5e270">Missing return statement in functions with non-void return type</h4>
<div class="outline-text-4" id="text-org6e5e270">
<p>
If a function has return type but does not return anything:
</p>
<ul class="org-ul">
<li>In C, it is allowed. Compilers can show a warning but they don't have to.</li>
<li>In C++, it is syntax error.</li>
</ul>
<p>
This code is valid in C and invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab5f342" class="outline-4">
<h4 id="orgab5f342">Implicit/default function declaration</h4>
<div class="outline-text-4" id="text-orgab5f342">
<p>
If name lookup fails for a function:
</p>
<ul class="org-ul">
<li>In C, compilers will assume it is an external function with the default declaration: <code>int func();</code></li>
<li>In C++, it is syntax error.</li>
</ul>
<p>
This code will compile in C and compiler will assume <code>bar()</code> function has <code>int bar();</code> declaration:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #feacd0;">bar</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfffa6a3" class="outline-4">
<h4 id="orgfffa6a3">Declaration of functions without parameter</h4>
<div class="outline-text-4" id="text-orgfffa6a3">
<p>
There are different rules for C and C++.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
    <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">bar</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">void</span><span style="color: #ffffff;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>In C, these 2 function declarations have different meaning.
<ul class="org-ul">
<li><code>int foo();</code> means, we don't have any information about parameters so we can pass what ever we want.</li>
<li><code>int bar(void);</code> means, function does not take any parameters.</li>
</ul></li>
<li>In C++, both of the declarations have the same meaning. Functions do not take any parameters.</li>
</ul>
<p>
According to the declarations above, this code is valid in C. Invalid in C++, because <code>int foo();</code> does not take any parameters.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">2</span><span style="color: #ffffff;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org4d122e5" class="outline-4">
<h4 id="org4d122e5">Nameless parameters in function definitions</h4>
<div class="outline-text-4" id="text-org4d122e5">
<p>
This is about function definitions not declarations.
</p>
<ul class="org-ul">
<li>In C, it is not allowed. (Since C20, it is also allowed in C.)</li>
<li>In C++, it is allowed.</li>
</ul>
<p>
This code is invalid for C (before C20) and valid for C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{}</span>
</pre>
</div>
</div>
</div>
