notes.html
<div id="outline-container-orge2159ad" class="outline-4">
<h4 id="orge2159ad">Scope of for-statement</h4>
<div class="outline-text-4" id="text-orge2159ad">
<ul class="org-ul">
<li>In C, inside of the for loop has a different block scope than for-statement itself.</li>
<li>In C++, inside of the for loop and for-statement itself are in same block scope.</li>
</ul>
<p>
Because of this difference, name shadowing inside a for loop is valid in C, but invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #feacd0;">for </span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">i</span> = <span style="color: #00bcff;">0</span>; i &lt; <span style="color: #00bcff;">10</span>; ++i<span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">i</span> = <span style="color: #00bcff;">99</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
<p>
We can say above code looks like this for C compiler:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #feacd0;">for </span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">i</span> = <span style="color: #00bcff;">0</span>; i &lt; <span style="color: #00bcff;">10</span>; ++i<span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">i</span> = <span style="color: #00bcff;">99</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>
<p>
<i>Note: For C and C++, name shadowing is only valid between different scopes.</i>
</p>
</div>
</div>
</div>
<div id="outline-container-org4a78720" class="outline-3">
<h3 id="org4a78720">Differences About Types and Type Conversions</h3>
<div class="outline-text-3" id="text-org4a78720">
</div>
<div id="outline-container-orgbc048ca" class="outline-4">
<h4 id="orgbc048ca">Logic data type (boolean)</h4>
<div class="outline-text-4" id="text-orgbc048ca">
<p>
In C:
</p>
<ul class="org-ul">
<li><code>int</code> is used instead of logic data type.</li>
<li><code>_Bool</code> type is added in C99, but it is not widely used.</li>
<li>C doesn't have <code>false</code>, <code>true</code> constants. <code>stdbool.h</code> defines macros for them.</li>
</ul>

<p>
In C++:
</p>
<ul class="org-ul">
<li><code>bool</code> type, <code>false</code> and <code>true</code> constants are build-in to the language. No need to include anything.</li>
<li>Implicit type conversion from arithmetic types and pointer types to <code>bool</code> is allowed.</li>
<li>Implicit type conversion from <code>bool</code> to arithmetic types is allowed.</li>
</ul>
<p>
These are valid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Implicit conversion from arithmetic types to bool</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">45</span>;
   <span style="color: #6ae4b9;">bool</span> <span style="color: #ffffff;">b1</span> = x;

   <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">33.11</span>;
   <span style="color: #6ae4b9;">bool</span> <span style="color: #ffffff;">b2</span> = y;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Implicit conversion from pointer types to bool</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span> = <span style="color: #00bcff;">100</span>;
   <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span> = &amp;z;
   <span style="color: #6ae4b9;">bool</span> <span style="color: #ffffff;">b3</span> = p;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Implicit conversion from bool to arithmetic types</span>
   <span style="color: #6ae4b9;">bool</span> <span style="color: #ffffff;">b4</span> = <span style="color: #00bcff;">true</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">t</span> = b4;
</pre>
</div>

<p>
But, this is invalid:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">No implicit conversion from bool to pointer types</span>
   <span style="color: #6ae4b9;">bool</span> <span style="color: #ffffff;">b5</span> = <span style="color: #00bcff;">false</span>;
   <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">ptr</span> = b5;
</pre>
</div>
</div>
</div>
<div id="outline-container-org04097b5" class="outline-4">
<h4 id="org04097b5">User defined types</h4>
<div class="outline-text-4" id="text-org04097b5">
<ul class="org-ul">
<li>In C, <code>struct</code>, <code>enum</code> and <code>union</code> tags don't represent type itself. A keyword (<code>struct</code>, <code>enum</code> or <code>union</code>) must be used before a tag name to represent a type. A <code>typedef</code> declaration can be used too.</li>
<li>In C++, tag names directly represent type names.</li>
</ul>
<p>
Here are some examples:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">Data</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>, <span style="color: #ffffff;">b</span>, <span style="color: #ffffff;">c</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid in C. Valid in C++. There is no need to use struct keyword or typedef declaration in C++.</span>
   <span style="color: #6ae4b9;">Data</span> <span style="color: #ffffff;">data0</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid in C and C++.</span>
   <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">Data</span> <span style="color: #ffffff;">data1</span>;

   <span style="color: #b6a0ff;">typedef</span> <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">Example</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>, <span style="color: #ffffff;">b</span>, <span style="color: #ffffff;">c</span>;
   <span style="color: #ffffff;">}</span> <span style="color: #6ae4b9;">Example</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid in C and C++.</span>
   <span style="color: #6ae4b9;">Example</span> <span style="color: #ffffff;">example0</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org6fe92b9" class="outline-4">
<h4 id="org6fe92b9">Empty structs</h4>
<div class="outline-text-4" id="text-org6fe92b9">
<ul class="org-ul">
<li>In C, empty structs are invalid.</li>
<li>In C++, empty structs are valid.</li>
</ul>
<p>
An example:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">Data</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7639379" class="outline-4">
<h4 id="org7639379">Implicit conversion from arithmetic types to pointer types</h4>
<div class="outline-text-4" id="text-org7639379">
<ul class="org-ul">
<li>In C, implicit conversion from arithmetic types to pointer types is allowed. Compilers might show a warning.</li>
<li>In C++, there is no implicit conversion from arithmetic types to pointer types.</li>
</ul>
<p>
This is valid in C and invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">20</span>;
   <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span> = x;
</pre>
</div>
</div>
</div>
<div id="outline-container-org0f97733" class="outline-4">
<h4 id="org0f97733">Implicit conversion between different pointer types.</h4>
<div class="outline-text-4" id="text-org0f97733">
<ul class="org-ul">
<li>In C, implicit conversion between different pointer is allowed. Compilers might show a warning.</li>
<li>In C++, there is no implicit conversion between different pointer types.</li>
</ul>
<p>
This is valid in C and invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">d</span> = <span style="color: #00bcff;">33.11</span>;
   <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">ptr</span> = &amp;d;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfd6042e" class="outline-4">
<h4 id="orgfd6042e">Implicit conversion from <code>void*</code> to <code>T*</code></h4>
<div class="outline-text-4" id="text-orgfd6042e">
<ul class="org-ul">
<li>In C, implicit conversion from <code>void*</code> to <code>T*</code> is allowed.</li>
<li>In C++, implicit conversion from <code>void*</code> to <code>T*</code> is not allowed.</li>
</ul>
<p>
This code is valid in C but invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span> = <span style="color: #feacd0;">malloc</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">1000</span> * <span style="color: #feacd0;">sizeof</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">))</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org54c861a" class="outline-4">
<h4 id="org54c861a">Underlying enumeration type</h4>
<div class="outline-text-4" id="text-org54c861a">
<ul class="org-ul">
<li>In C, underlying enumeration type has to be <code>int</code>.</li>
<li>In C++, it does not have to be <code>int</code> and can be specified with special syntax.</li>
</ul>
</div>
</div>
