notes.org
*** Implicit conversion between different enumeration types
 - In C, it is allowed.
 - In C++, it is not.
 This code is valid in C but invalid in C++:
 #+BEGIN_SRC C++
   enum Color { Red, Green, Blue };
   enum Count { Zero, One, Two };
   enum Color color = Red;
   enum Count count = Zero;
   color = count;
 #+END_SRC

*** Implicit conversion from enumeration types to arithmetic types.
 - In C, it is allowed.
 - In C++, it is also allowed. Scoped enums can be used to prevent this.
 This code is valid in C and C++:
 #+BEGIN_SRC C++
   enum Color { Red, Green, Blue };
   enum Color color = Red;
   int x = color;
 #+END_SRC

*** Character literals
 - In C, character literals are ~int~.
 - In C++, character literals are ~char~.
 This code prints 4 in C and 1 in C++:
 #+BEGIN_SRC C++
   printf("%zu\n", sizeof('A'));
 #+END_SRC

*** String literals
 - In C, the type of string literals is ~char[n]~. When string literals are used in an expression they are converted to address of the first element (array decay - array to pointer conversion). The type after array decay is ~char*~.
 - In C++, the type of string literals is ~const char[n]~. Array decay also applies to C++ but the type after array decay is ~const char*~.
 This string literal is ~char[8]~ in C and ~const char[8]~ in C++:
 #+BEGIN_SRC C++
   "example"
 #+END_SRC
 This is valid in C but invalid in C++:
 #+BEGIN_SRC C++
   // In C++, it is decayed to const char* and there is no implicit conversion from const T* to T*.
   char* s = "example";
 #+END_SRC
 
** Differences About const Keyword
*** Initialization of const objects
 - In C, ~const~ objects don't have to be initialized.
 - In C++, ~const~ objects have to be initialized.
 This is code is valid in C and invalid in C++:
 #+BEGIN_SRC C++
  const int x;
 #+END_SRC
 Might be a bit tricky to understand at first but this is also valid in C++:
 #+BEGIN_SRC C++
   // This is a pointer to const int. Object/variable itself is not const here it just points to const int
   const int* ptr;
 #+END_SRC
 But this is invalid:
 #+BEGIN_SRC C++
   // This is a const pointer to int. Object/variable itself is const
   int* const ptr;
 #+END_SRC

*** Const expressions
 - In C, expressions generated by const variables are not counted as const expressions.
 - In C++, they count as const expressions.
 This is invalid in C (assuming no VLA) but valid in C++:
 #+BEGIN_SRC C++
   const int x = 10;
   int arr[x] = { 0 };
 #+END_SRC

*** Global const objects and linkage
 - In C, global const objects are in external linkage.
 - In C++, global const objects are in internal linkage like ~static~ objects.
 ~x~ is in external linkage in C and internal linkage in C++:
 #+BEGIN_SRC C++
   // In global scope
   const int x = 10;
 #+END_SRC

*** Implicit conversion from ~const T*~ to ~T*~
 - In C, implicit conversion from ~const T*~ to ~T*~ is allowed. Compilers might show a warning.
 - In C++, there is no implicit conversion from ~const T*~ to ~T*~.
 This is valid in C and invalid in C++:
 #+BEGIN_SRC C++
   const int x = 10;
   int* p = &x;
 #+END_SRC

** Differences About Value Categories
*** Primary value categories
 - In C, there are 2 primary value categories.
   + L-value
   + R-value
 - In C++, there are 3 primary value categories.
   + L-value
   + PR-value (pure R-value)
   + X-value (expired value)
 The combination of the ~PR-value~ and ~X-value~ categories is called the ~R-value~ category. (~PR-value~ \cup ~X-value~ = ~R-value~). When we say an expression is ~R-value~ it means it may be an ~PR-value~ or ~X-value~ in C++.
 
 The combination of the ~L-value~ and ~X-value~ categories is called the ~GL-value~ category. (~L-value~ \cup ~X-value~ = ~GL-value~). When we say an expression is ~GL-value~ it means it may be an ~L-value~ or ~X-value~ in C++.
 
 The ~GL-value~ and ~R-value~ categories are not ~primary value categories~. They are called ~combined value categories~.
 
