notes.html
<div id="outline-container-orge741635" class="outline-4">
<h4 id="orge741635">Implicit conversion from arithmetic types to enumeration types</h4>
<div class="outline-text-4" id="text-orge741635">
<ul class="org-ul">
<li>In C, it is allowed.</li>
<li>In C++, it is not.</li>
</ul>
<p>
This code is valid in C but invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Red</span>, <span style="color: #ffffff;">Green</span>, <span style="color: #ffffff;">Blue</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">color</span>;
   color = <span style="color: #00bcff;">3</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org8030c64" class="outline-4">
<h4 id="org8030c64">Implicit conversion between different enumeration types</h4>
<div class="outline-text-4" id="text-org8030c64">
<ul class="org-ul">
<li>In C, it is allowed.</li>
<li>In C++, it is not.</li>
</ul>
<p>
This code is valid in C but invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Red</span>, <span style="color: #ffffff;">Green</span>, <span style="color: #ffffff;">Blue</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Count</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Zero</span>, <span style="color: #ffffff;">One</span>, <span style="color: #ffffff;">Two</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">color</span> = Red;
   <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Count</span> <span style="color: #ffffff;">count</span> = Zero;
   color = count;
</pre>
</div>
</div>
</div>
<div id="outline-container-orga8b6161" class="outline-4">
<h4 id="orga8b6161">Implicit conversion from enumeration types to arithmetic types.</h4>
<div class="outline-text-4" id="text-orga8b6161">
<ul class="org-ul">
<li>In C, it is allowed.</li>
<li>In C++, it is also allowed. Scoped enums can be used to prevent this.</li>
</ul>
<p>
This code is valid in C and C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Red</span>, <span style="color: #ffffff;">Green</span>, <span style="color: #ffffff;">Blue</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">color</span> = Red;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = color;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfddcc77" class="outline-4">
<h4 id="orgfddcc77">Character literals</h4>
<div class="outline-text-4" id="text-orgfddcc77">
<ul class="org-ul">
<li>In C, character literals are <code>int</code>.</li>
<li>In C++, character literals are <code>char</code>.</li>
</ul>
<p>
This code prints 4 in C and 1 in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #feacd0;">printf</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"%zu\n"</span>, <span style="color: #feacd0;">sizeof</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">'A'</span><span style="color: #ffffff;">))</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf00794e" class="outline-4">
<h4 id="orgf00794e">String literals</h4>
<div class="outline-text-4" id="text-orgf00794e">
<ul class="org-ul">
<li>In C, the type of string literals is <code>char[n]</code>. When string literals are used in an expression they are converted to address of the first element (array decay - array to pointer conversion). The type after array decay is <code>char*</code>.</li>
<li>In C++, the type of string literals is <code>const char[n]</code>. Array decay also applies to C++ but the type after array decay is <code>const char*</code>.</li>
</ul>
<p>
This string literal is <code>char[8]</code> in C and <code>const char[8]</code> in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #79a8ff;">"example"</span>
</pre>
</div>
<p>
This is valid in C but invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">In C++, it is decayed to const char* and there is no implicit conversion from const T* to T*.</span>
   <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">s</span> = <span style="color: #79a8ff;">"example"</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc6d437c" class="outline-3">
<h3 id="orgc6d437c">Differences About const Keyword</h3>
<div class="outline-text-3" id="text-orgc6d437c">
</div>
<div id="outline-container-org0ab305e" class="outline-4">
<h4 id="org0ab305e">Initialization of const objects</h4>
<div class="outline-text-4" id="text-org0ab305e">
<ul class="org-ul">
<li>In C, <code>const</code> objects don't have to be initialized.</li>
<li>In C++, <code>const</code> objects have to be initialized.</li>
</ul>
<p>
This is code is valid in C and invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
</pre>
</div>
<p>
Might be a bit tricky to understand at first but this is also valid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is a pointer to const int. Object/variable itself is not const here it just points to const int</span>
   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">ptr</span>;
</pre>
</div>
<p>
But this is invalid:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is a const pointer to int. Object/variable itself is const</span>
   <span style="color: #6ae4b9;">int</span>* <span style="color: #b6a0ff;">const</span> <span style="color: #ffffff;">ptr</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orga1c3e64" class="outline-4">
<h4 id="orga1c3e64">Const expressions</h4>
<div class="outline-text-4" id="text-orga1c3e64">
<ul class="org-ul">
<li>In C, expressions generated by const variables are not counted as const expressions.</li>
<li>In C++, they count as const expressions.</li>
</ul>
<p>
This is invalid in C (assuming no VLA) but valid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">arr</span><span style="color: #ffffff;">[</span>x<span style="color: #ffffff;">]</span> = <span style="color: #ffffff;">{</span> <span style="color: #00bcff;">0</span> <span style="color: #ffffff;">}</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org8d15c74" class="outline-4">
<h4 id="org8d15c74">Global const objects and linkage</h4>
<div class="outline-text-4" id="text-org8d15c74">
<ul class="org-ul">
<li>In C, global const objects are in external linkage.</li>
<li>In C++, global const objects are in internal linkage like <code>static</code> objects.</li>
</ul>
<p>
<code>x</code> is in external linkage in C and internal linkage in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">In global scope</span>
   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org863a45d" class="outline-4">
<h4 id="org863a45d">Implicit conversion from <code>const T*</code> to <code>T*</code></h4>
<div class="outline-text-4" id="text-org863a45d">
<ul class="org-ul">
<li>In C, implicit conversion from <code>const T*</code> to <code>T*</code> is allowed. Compilers might show a warning.</li>
<li>In C++, there is no implicit conversion from <code>const T*</code> to <code>T*</code>.</li>
</ul>
<p>
This is valid in C and invalid in C++:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span> = &amp;x;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0446ecb" class="outline-3">
<h3 id="org0446ecb">Differences About Value Categories</h3>
<div class="outline-text-3" id="text-org0446ecb">
</div>
<div id="outline-container-org16f7f9c" class="outline-4">
<h4 id="org16f7f9c">Primary value categories</h4>
<div class="outline-text-4" id="text-org16f7f9c">
<ul class="org-ul">
<li>In C, there are 2 primary value categories.
<ul class="org-ul">
<li>L-value</li>
<li>R-value</li>
</ul></li>
<li>In C++, there are 3 primary value categories.
<ul class="org-ul">
<li>L-value</li>
<li>PR-value (pure R-value)</li>
<li>X-value (expired value)</li>
</ul></li>
</ul>
<p>
The combination of the <code>PR-value</code> and <code>X-value</code> categories is called the <code>R-value</code> category. (<code>PR-value</code> &cup; <code>X-value</code> = <code>R-value</code>). When we say an expression is <code>R-value</code> it means it may be an <code>PR-value</code> or <code>X-value</code> in C++.
</p>

<p>
The combination of the <code>L-value</code> and <code>X-value</code> categories is called the <code>GL-value</code> category. (<code>L-value</code> &cup; <code>X-value</code> = <code>GL-value</code>). When we say an expression is <code>GL-value</code> it means it may be an <code>L-value</code> or <code>X-value</code> in C++.
</p>

<p>
The <code>GL-value</code> and <code>R-value</code> categories are not <code>primary value categories</code>. They are called <code>combined value categories</code>.
</p>
</div>
</div>
