notes.org
*** Prefix increment/decrement operator
 - In C, expressions generated by prefix increment/decrement operator are R-value expressions.
 - In C++, they are L-value expressions.
 This code is valid in C++ and invalid in C:
 #+BEGIN_SRC C++
   int x = 10;
   // These are invalid in C, because R-value expressions cannot be an operand of the address(&) operator.
   &++x;
   &--x;
 #+END_SRC

*** Assignment operator
 - In C, expressions generated by assignment operator are R-value expressions.
 - In C++, they are L-value expressions.
 This code is valid in C++ and invalid in C:
 #+BEGIN_SRC C++
   int x = 10;
   &(x = 5);
 #+END_SRC

*** Comma operator
 - In C, expressions generated by comma operator are R-value expressions.
 - In C++, they can be L-value or R-value expressions.
 This code is valid in C++ and invalid in C:
 #+BEGIN_SRC C++
   int x = 10;
   int y = 20;
   (x, y) = 30; // y = 30;
 #+END_SRC

*** Ternary operator
 - In C, expressions generated by ternary operator are R-value expressions.
 - In C++, they can be L-value or R-value expressions.
 This code is valid in C++ and invalid in C:
 #+BEGIN_SRC C++
   int x = 10;
   int y = 20;
   int z = 30;
   (x == 10 ? y : z) = 40; // y = 40;
 #+END_SRC

* C++ Topics

** Initialization
 There are very different ways to initialize objects in C++.
*** Default initialization
 Default initialized objects are created with a garbage value.
 #+BEGIN_SRC C++
   int x; // Default initialization.
 #+END_SRC

*** Zero initialization
 Compilers zero initialize objects in the global scope. ~zero initialization~ is not a way to initialize objects it is more like a compiler process.
 #+BEGIN_SRC C++
   // Global scope
   int x;  // x = 0;
   bool b; // b = false;
   int* p; // p = nullptr;
 #+END_SRC

*** Copy initialization
 If objects are initialized like in the C language, it is called ~copy initialization~.
 #+BEGIN_SRC C++
   int x = 10; // Copy initialization.
 #+END_SRC

*** Direct initialization
 If objects are initialized by using paranthesis, it is called ~direct initialization~.
 #+BEGIN_SRC C++
   int x(98); // Direct initialization.
 #+END_SRC

*** Direct-list / brace initialization (uniform initialization)
 If objects are initialized by using braces, it is called ~direct-list initialization~. ~direct-list/brace initialization~ is added to the language to have a uniform way to initialize objects. This is why it is also called ~uniform initialization~. It can be used to initialize any object.
 #+BEGIN_SRC C++
  int x{ 10 }; // Direct-list initialization.
 #+END_SRC

 Unlike other initialization methods, if an implicit narrowing conversion occurs during ~direct-list initialization~, it is a syntax error.
 #+BEGIN_SRC C++
   double dval = 5.6;

   // Implicit narrowing conversion does not cause any error but compilers might show a warning.
   int i1 = dval;
   int i2(dval);

   // Invalid. Implicit narrowing conversion causes a syntax error. Explicit cast is needed.
   int i3{dval};
 #+END_SRC

 In C++, there are such declarations that can be interpreted as both ~object instantiation~ and ~function declaration~ at the same time. In such cases, ~function declaration~ has the priority. This is called ~most vexing parse~ and sometimes it leads to problems.
 Example:
 #+BEGIN_SRC C++
   struct A
   {
   };

   struct B
   {
       B(A);
   };

   // Here, we wanted to create a bx object from class B type by calling its constructor with a temporary object with class A type.
   // C++ understands this as a function declaration. It is a function named bx and it has a return type of class B,
   // and takes a function pointer as a parameter. Sigh..
   B bx(A());

   // This can be prevented by using direct-list initialization.
   B by{A()};
   B bz(A{});
 #+END_SRC

