notes.html
<div id="outline-container-org0c51469" class="outline-4">
<h4 id="org0c51469">Prefix increment/decrement operator</h4>
<div class="outline-text-4" id="text-org0c51469">
<ul class="org-ul">
<li>In C, expressions generated by prefix increment/decrement operator are R-value expressions.</li>
<li>In C++, they are L-value expressions.</li>
</ul>
<p>
This code is valid in C++ and invalid in C:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These are invalid in C, because R-value expressions cannot be an operand of the address(&amp;) operator.</span>
   &amp;++x;
   &amp;--x;
</pre>
</div>
</div>
</div>
<div id="outline-container-org2aaf86b" class="outline-4">
<h4 id="org2aaf86b">Assignment operator</h4>
<div class="outline-text-4" id="text-org2aaf86b">
<ul class="org-ul">
<li>In C, expressions generated by assignment operator are R-value expressions.</li>
<li>In C++, they are L-value expressions.</li>
</ul>
<p>
This code is valid in C++ and invalid in C:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   &amp;<span style="color: #ffffff;">(</span>x = <span style="color: #00bcff;">5</span><span style="color: #ffffff;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc332de" class="outline-4">
<h4 id="orgcc332de">Comma operator</h4>
<div class="outline-text-4" id="text-orgcc332de">
<ul class="org-ul">
<li>In C, expressions generated by comma operator are R-value expressions.</li>
<li>In C++, they can be L-value or R-value expressions.</li>
</ul>
<p>
This code is valid in C++ and invalid in C:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">20</span>;
   <span style="color: #ffffff;">(</span>x, y<span style="color: #ffffff;">)</span> = <span style="color: #00bcff;">30</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">y = 30;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbed6536" class="outline-4">
<h4 id="orgbed6536">Ternary operator</h4>
<div class="outline-text-4" id="text-orgbed6536">
<ul class="org-ul">
<li>In C, expressions generated by ternary operator are R-value expressions.</li>
<li>In C++, they can be L-value or R-value expressions.</li>
</ul>
<p>
This code is valid in C++ and invalid in C:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">20</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span> = <span style="color: #00bcff;">30</span>;
   <span style="color: #ffffff;">(</span>x == <span style="color: #00bcff;">10</span> ? y : z<span style="color: #ffffff;">)</span> = <span style="color: #00bcff;">40</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">y = 40;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb415b13" class="outline-2">
<h2 id="orgb415b13">C++ Topics</h2>
<div class="outline-text-2" id="text-orgb415b13">
</div>
<div id="outline-container-orgebe69b7" class="outline-3">
<h3 id="orgebe69b7">Initialization</h3>
<div class="outline-text-3" id="text-orgebe69b7">
<p>
There are very different ways to initialize objects in C++.
</p>
</div>
<div id="outline-container-org6801840" class="outline-4">
<h4 id="org6801840">Default initialization</h4>
<div class="outline-text-4" id="text-org6801840">
<p>
Default initialized objects are created with a garbage value.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Default initialization.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgba11023" class="outline-4">
<h4 id="orgba11023">Zero initialization</h4>
<div class="outline-text-4" id="text-orgba11023">
<p>
Compilers zero initialize objects in the global scope. <code>zero initialization</code> is not a way to initialize objects it is more like a compiler process.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Global scope</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">x = 0;</span>
   <span style="color: #6ae4b9;">bool</span> <span style="color: #ffffff;">b</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">b = false;</span>
   <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">p = nullptr;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc26323e" class="outline-4">
<h4 id="orgc26323e">Copy initialization</h4>
<div class="outline-text-4" id="text-orgc26323e">
<p>
If objects are initialized like in the C language, it is called <code>copy initialization</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Copy initialization.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd71aeec" class="outline-4">
<h4 id="orgd71aeec">Direct initialization</h4>
<div class="outline-text-4" id="text-orgd71aeec">
<p>
If objects are initialized by using paranthesis, it is called <code>direct initialization</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">x</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">98</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Direct initialization.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org344d22d" class="outline-4">
<h4 id="org344d22d">Direct-list / brace initialization (uniform initialization)</h4>
<div class="outline-text-4" id="text-org344d22d">
<p>
If objects are initialized by using braces, it is called <code>direct-list initialization</code>. <code>direct-list/brace initialization</code> is added to the language to have a uniform way to initialize objects. This is why it is also called <code>uniform initialization</code>. It can be used to initialize any object.
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">10</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Direct-list initialization.</span>
</pre>
</div>

<p>
Unlike other initialization methods, if an implicit narrowing conversion occurs during <code>direct-list initialization</code>, it is a syntax error.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">dval</span> = <span style="color: #00bcff;">5.6</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Implicit narrowing conversion does not cause any error but compilers might show a warning.</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">i1</span> = dval;
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">i2</span><span style="color: #ffffff;">(</span>dval<span style="color: #ffffff;">)</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid. Implicit narrowing conversion causes a syntax error. Explicit cast is needed.</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">i3</span><span style="color: #ffffff;">{</span>dval<span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
In C++, there are such declarations that can be interpreted as both <code>object instantiation</code> and <code>function declaration</code> at the same time. In such cases, <code>function declaration</code> has the priority. This is called <code>most vexing parse</code> and sometimes it leads to problems.
Example:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">A</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">B</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #feacd0;">B</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">A</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Here, we wanted to create a bx object from class B type by calling its constructor with a temporary object with class A type.</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C++ understands this as a function declaration. It is a function named bx and it has a return type of class B,</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">and takes a function pointer as a parameter. Sigh..</span>
   <span style="color: #6ae4b9;">B</span> <span style="color: #feacd0;">bx</span><span style="color: #ffffff;">(</span><span style="color: #feacd0;">A</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">))</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This can be prevented by using direct-list initialization.</span>
   <span style="color: #6ae4b9;">B</span> <span style="color: #ffffff;">by</span><span style="color: #ffffff;">{</span><span style="color: #feacd0;">A</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)}</span>;
   <span style="color: #6ae4b9;">B</span> <span style="color: #feacd0;">bz</span><span style="color: #ffffff;">(</span>A<span style="color: #ffffff;">{})</span>;
</pre>
</div>
</div>
</div>
