notes.html
<div id="outline-container-org3b49a89" class="outline-4">
<h4 id="org3b49a89">Value initialization</h4>
<div class="outline-text-4" id="text-org3b49a89">
<p>
If objects are initialized by using braces but inside of the braces are empty, it is called <code>value initialization</code>. Value initialized objects are first initialized to zero, if any additional initialization steps are required, this is done after <code>zero initialization</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Value initialization.</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4431e97" class="outline-3">
<h3 id="org4431e97">nullptr</h3>
<div class="outline-text-3" id="text-org4431e97">
<p>
In C++, there is a keyword that represents a null pointer, and it is called <code>nullptr</code>. It is not a macro like in C. It is a keyword, a constant and its type is <code>nullptr_t</code>.
</p>

<p>
You can assign <code>nullptr</code> to other pointer types but there is no implicit conversion from <code>nullptr_t</code> type to arithmetic types.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">nullptr</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid</span>
   <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">nullptr</span>;
   <span style="color: #6ae4b9;">double</span>* <span style="color: #ffffff;">z</span> = <span style="color: #00bcff;">nullptr</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c131c1" class="outline-3">
<h3 id="org0c131c1">Reference Semantics</h3>
<div class="outline-text-3" id="text-org0c131c1">
<p>
There is an alternative way to represent pointers in C++, which is called <code>reference</code>, but this is only an alternative at the language layer, the underlying representation does not change once the code is compiled. Everything works with the pointers in assembly level.
</p>

<p>
There are 3 different reference categories:
</p>
<ul class="org-ul">
<li>L-value reference</li>
<li>R-value reference (move semantics, perfect forwarding (generic prog.))</li>
<li>Forwarding/universal reference</li>
</ul>
<p>
An example:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">L-value reference</span>
    <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">y</span> = x;
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">R-value reference</span>
    <span style="color: #6ae4b9;">int</span>&amp;&amp; <span style="color: #ffffff;">z</span> = <span style="color: #00bcff;">10</span>;
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Forwarding/universal reference</span>
    <span style="color: #b6a0ff;">auto</span>&amp;&amp; <span style="color: #ffffff;">t</span> = <span style="color: #00bcff;">10</span>;
</pre>
</div>
</div>
<div id="outline-container-org8d6ed5c" class="outline-4">
<h4 id="org8d6ed5c">L-value references</h4>
<div class="outline-text-4" id="text-org8d6ed5c">
<p>
L-value references are similar to <code>top-level const pointer objects</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We cannot change the value of the ptr because it is a const pointer. It will always point to the same object</span>
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">which is x in this case. Whenever *ptr is used, it means x.</span>
    <span style="color: #6ae4b9;">int</span>* <span style="color: #b6a0ff;">const</span> <span style="color: #ffffff;">ptr</span> = &amp;x;
    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = *ptr; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int y = x;</span>
</pre>
</div>

<p>
L-value references represent their underlying object directly, there is no need for dereferencing like pointers. They cannot be default initialized, cannot be initialized with R-value objects and cannot be reassigned/rebound(like <code>top-level const pointer</code>).
</p>
<div class="org-src-container">
<pre class="src src-C++">       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Reference r directly represents x</span>
       <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r</span> = x;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">No need to dereference like a pointer</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = r; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int y = x;</span>

       <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r1</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Syntax error. References cannot be default initialized.</span>
       <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r2</span> = <span style="color: #00bcff;">10</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Syntax error. References cannot be initialized with R-value objects.</span>

       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span> = <span style="color: #00bcff;">10</span>;
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">t</span> = <span style="color: #00bcff;">20</span>;
       <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r3</span> = z;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid but equals to z = t. r3 still represents z, what we did is changing value of z.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">References cannot be reassigned.</span>
       r3 = t; 
</pre>
</div>

<p>
We can say that when we define a L-value reference we bind it to underlying object and they will stay bound until the end of scope.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">All r1, r2 and r3 bound to x</span>
    <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r1</span> = x;
    <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r2</span> = r1;
    <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r3</span> = r2;

    ++r1;
    ++r2;
    ++r3;
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">x is 13 here</span>

</pre>
</div>

<p>
L-value rereferences can also be bound to arrays and array decay rules do not change:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span><span style="color: #ffffff;">[]</span> = <span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">3</span>, <span style="color: #00bcff;">5</span>, <span style="color: #00bcff;">7</span>, <span style="color: #00bcff;">9</span> <span style="color: #ffffff;">}</span>;
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">r is bound to a</span>
    <span style="color: #feacd0;">int </span><span style="color: #ffffff;">(</span>&amp;ra<span style="color: #ffffff;">)[]</span> = a; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Normally, we do not have to write the type directly. we can use type deduction.</span>

    <span style="color: #feacd0;">for </span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">i</span> = <span style="color: #00bcff;">0</span>; i &lt; <span style="color: #00bcff;">5</span>; ++i<span style="color: #ffffff;">)</span>
    <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">ra[i] equals to a[i]</span>
    <span style="color: #ffffff;">}</span>

    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Same rules apply for array decay</span>
    <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p1</span> = a;
    <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p2</span> = ra;
</pre>
</div>

<p>
L-value references often used to pass the object to the function (<code>call by reference</code>) and also to return the object itself from the function.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r</span><span style="color: #ffffff;">)</span>
    <span style="color: #ffffff;">{</span>
    ++r;
    <span style="color: #b6a0ff;">return</span> r;
    <span style="color: #ffffff;">}</span>

    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Value of x will be 11 after foo() is called</span>
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">r represents x</span>
    <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r</span> = <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>;
</pre>
</div>
</div>
</div>
