notes.html
<div id="outline-container-org39e4188" class="outline-4">
<h4 id="org39e4188">L-value references and const semantics</h4>
<div class="outline-text-4" id="text-org39e4188">
<p>
We said that L-value references are like <code>top-level const pointer</code> by default but they can also be used like <code>low-level const pointer</code>.
Pointer parameters can be used as a mutator or accessor. L-value references also can be used in a similar way:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Mutator</span>
    <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Accessor</span>

    <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Mutator</span>
    <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f4</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Accessor</span>
</pre>
</div>

<p>
<code>const</code> objects can only be bound by <code>const</code> L-value references similar to pointers:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
    <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span> = &amp;x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid. int* p cannot point to const int x.</span>
    <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r</span> = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Also invalid. int&amp; r cannot bind to const int x.</span>

    <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">cr</span> = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
</pre>
</div>

<p>
Normally, initializing an L-value reference with a different/mismatching object type is syntax error:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
    <span style="color: #6ae4b9;">double</span>&amp; <span style="color: #ffffff;">r</span> = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Syntax error. double&amp; r cannot bind to int object.</span>
</pre>
</div>

<p>
But, if we try to initialize a <code>const</code> L-value reference with a different/mismatching object type and there is an implicit conversion from that object type to the type represented by the <code>const</code> L-value reference, the compiler creates a temporary object and the <code>const</code> L-value reference is bound to that temporary object:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid. Normally, double and int types do not match but implicit conversion is allowed from int to double.</span>
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">So, compiler creates a temporary double object and assign x to it, then cr binds to that temporary object.</span>
    <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">double</span>&amp; <span style="color: #ffffff;">cr</span> = x; 

    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We can think that compiler generates something like this for above code.</span>
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">double temporary_object = x;</span>
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const double&amp; cr = temporary_object;</span>
</pre>
</div>

<p>
This also applies, when we try to initialize <code>const</code> L-value references with R-value objects:
</p>
<div class="org-src-container">
<pre class="src src-C++">     <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is syntax error. L-value references cannot be initialized with R-value objects.</span>
    <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r</span> = <span style="color: #00bcff;">10</span>;

    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid when we use const L-value reference, because compiler creates a temporary object like the example above.</span>
    <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">cr</span> = <span style="color: #00bcff;">10</span>;

    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Compiler might generate something like this for above code.</span>
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int temporary_object = 10;</span>
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const int&amp; cr = temporary_object;</span>
</pre>
</div>

<p>
This becomes even more important when we call functions that take L-value reference parameters, for example:
</p>
<div class="org-src-container">
<pre class="src src-C++">     <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We can only pass an L-value objects to f1(). If we try to pass a R-value object it will be syntax error.</span>
     <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>;
     <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
     <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
     <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid, syntax error.</span>

     <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">It is not the same for f2() however. We can pass L-value objects to f2() but if we try to pass a R-value object, it will not cause</span>
     <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">any syntax error because of the rules above. The temporary object will be passed to f2() instead of R-value object itself. (Assuming there is no type problem)</span>
     <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>;
     <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">10</span>;
     <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span>y<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
     <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Also valid.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4075d4b" class="outline-4">
<h4 id="org4075d4b">Differences between pointers and L-value references</h4>
<div class="outline-text-4" id="text-org4075d4b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Pointers</th>
<th scope="col" class="org-left">References</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">don't have to be initialized</td>
<td class="org-left">have to be initialized</td>
</tr>

<tr>
<td class="org-left">pointer to pointer exists</td>
<td class="org-left">reference to reference doesn't exist (ignoring reference collapsing)</td>
</tr>

<tr>
<td class="org-left">arrays can store pointers</td>
<td class="org-left">arrays cannot store references</td>
</tr>

<tr>
<td class="org-left">pointers can be null (nullptr)</td>
<td class="org-left">references cannot be null</td>
</tr>

<tr>
<td class="org-left">pointers can be reassigned</td>
<td class="org-left">references cannot be reassigned</td>
</tr>
</tbody>
</table>
</div>
</div>
