notes.org
*** R-value references
 R-value references are mostly about move semantics and perfect forwarding. Details will be discussed in the future. We will just briefly explain the syntax for now.
 R-value references cannot be default-initialized like L-value references, and can be initialized only with R-value objects.
  #+BEGIN_SRC C++
    int&& r = 10; // Valid, R-value reference.

    int x = 10;
    int&& rr = x; // Invalid. R-value references cannot be initialized with L-value objects.
  #+END_SRC

  ...
  
** Type Deduction
 In C++, we don't need to write the type explicitly in some contexts. We can use one of the type deduction mechanisms to have the compiler determine the type for us by looking at the code.
 There are several different mechanisms for type deduction:
  - auto
  - decltype
  - decltyoe(auto)
  - template

