notes.html
<div id="outline-container-org264e0d2" class="outline-4">
<h4 id="org264e0d2">R-value references</h4>
<div class="outline-text-4" id="text-org264e0d2">
<p>
R-value references are mostly about move semantics and perfect forwarding. Details will be discussed in the future. We will just briefly explain the syntax for now.
R-value references cannot be default-initialized like L-value references, and can be initialized only with R-value objects.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span>&amp;&amp; <span style="color: #ffffff;">r</span> = <span style="color: #00bcff;">10</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, R-value reference.</span>

    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
    <span style="color: #6ae4b9;">int</span>&amp;&amp; <span style="color: #ffffff;">rr</span> = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid. R-value references cannot be initialized with L-value objects.</span>
</pre>
</div>

<p>
&#x2026;
</p>
</div>
</div>
</div>
<div id="outline-container-org1bbac5f" class="outline-3">
<h3 id="org1bbac5f">Type Deduction</h3>
<div class="outline-text-3" id="text-org1bbac5f">
<p>
In C++, we don't need to write the type explicitly in some contexts. We can use one of the type deduction mechanisms to have the compiler determine the type for us by looking at the code.
There are several different mechanisms for type deduction:
</p>
<ul class="org-ul">
<li>auto</li>
<li>decltype</li>
<li>decltyoe(auto)</li>
<li>template</li>
</ul>
</div>
