notes.org
*** auto type deduction
 The ~auto~ keyword can be used to determine the type of the variable during initialization. A very important point is that the type deduction is made for ~auto~ keyword not for the variable itself.
 #+BEGIN_SRC C++
   auto x = 10; // int x = 10;

   int y = 45;
   auto z = y; // int z = y;

   auto t = 0U; // unsigned int t = 0U;
   auto k = 0.; // double k = 0.;

   char c = 'a';
   auto a = c; // char a = c;
   auto b = +c; // int b = +c;

   auto d = 10 > 5; // bool d = 10 > 5;
 #+END_SRC

 We cannot ~default initialize~ an object with ~auto~ because in this case the compiler cannot determine its type:
 #+BEGIN_SRC C++
   auto x; // Invalid.
 #+END_SRC

 If an object is ~auto~ initialized with a ~const~ object and does not have any declarator (such as *, &), ~const~ qualifier drops:
 #+BEGIN_SRC C++
   const int cx = 6;
   // This equals to int y = cx;. const qualifier drops.
   auto y = cx;

   int* const ptr = 0;
   // ptr is const pointer to int. If the object itself is const, const qualifier drops.
   auto p = ptr; // int* p = ptr;

   const int* ptr1 = 0;
   // ptr1 is pointer to const int. The object itself is not const, const qualifier does not drop in this case.
   auto p1 = ptr1; // const int* p1 = ptr1;
 #+END_SRC

 If an object is ~auto~ initialized with a ~reference~ and does not have any declarator (such as *, &), ~reference~ qualifier drops:
 #+BEGIN_SRC C++
   int x = 10;
   int& r = x;
   // This equals to int y = r;. reference qualifier drops.
   auto y = r;

   const int& cr = x;
   // This equals to int z = cr;. const and reference qualifiers drop.
   auto z = cr;
 #+END_SRC

 Array decay rules are still valid: 
 #+BEGIN_SRC C++
   int a[] = { 1, 3, 6, 7 };
   auto p = a; // int* p = a;

   const int ca[] = { 1, 3, 6, 7 };
   // Here const qualifier does not drop. The object itself 'ca' is not const.
   // It is a pointer to const int after array decay.
   auto cp = ca; // const int* cp = ca;

   // The type of the "test" is const char[5], it decays to const char*.
   auto str = "test"; // const char* str = "test";
 #+END_SRC

 ~auto~ initialization with functions:
 #+BEGIN_SRC C++
   int foo(int);
   // Normally, type of the foo is int(int) but it decays to int (*)(int).
   auto fp = foo; // int (*fp)(int) = foo;
 #+END_SRC

 ~auto~ initialization and ~std::initializer_list~:
 #+BEGIN_SRC C++
   auto x = { 3 }; // std::initializer_list x = { 3 };
   auto y{ 3 }; // int y{ 3 }; This rule was different before. It was also meaning std::initializer_list y{ 3 };
 #+END_SRC

 Type deduction is made for ~auto~ keyword not for variable itself:
 #+BEGIN_SRC C++
   int x = 10;
   auto p1 = &x; // int* p1 = &x; auto -> int*
   auto* p2 = &x; // int* p2 = &x; auto -> int

   int* ptr = &x;
   auto p1 = &ptr; // int** p1 = &ptr; auto -> int**
   auto* p2 = &ptr; // int** p2 = &ptr; auto -> int*
   auto** p3 = &ptr; // int** p3 = &ptr; auto -> int
 #+END_SRC
 
 If declarators and ~auto~ are used together, rules are a bit different:
 In this example there is no difference:
 #+BEGIN_SRC C++
   int x = 10;
   auto& r = x; // int& r = x;
 #+END_SRC

 But when we use a ~const~ object:
 #+BEGIN_SRC C++
   const int x = 10;
   // const qualifier does not drop here.
   auto& r = x; // const int& r = x;
 #+END_SRC

 Array and function rules are also different:
 #+BEGIN_SRC C++
   int a[3] = { 1, 2, 3 };
   // Array decay does not occur here.
   auto& x = a; // int (&x)[3] = a;
   auto& str = "test"; // const char (&str)[5] = "test";

   int foo(int);
   // There is no decay here. Type deduction will be int(int) type for auto.
   auto& f1 = foo; // int (&f1)(int) = foo;   
 #+END_SRC

 If double reference (&&) declarator (forwarding-reference) is used with ~auto~, the rules change significantly. If ~auto&&~ is used, the type deduction for the ~auto~ keyword depends on the value category of the object used for initialization. Different rules are applied for L-value expressions and R-value expressions (PR-value or X-value).

 If value of category of the initializer is PR-value, the type deduction for ~auto~ will be the type of the expression:
 #+BEGIN_SRC C++
   // Type deduction for auto will be int because type of 20 is int.
   auto&& p = 20; // int&& p = 20;
 #+END_SRC

 If value of category of the initializer is L-value, the type deduction for ~auto~ will be L-value reference:
 #+BEGIN_SRC C++
   int x;
   // Type deduction for auto will be int& but there is no int&&&, so reference collapsing rules apply here.
   auto&& p = x; // After reference collapsing this equals to int& p = x;
 #+END_SRC

 Reference collapsing rules:
| reference type | binding reference type | result after reference collapsing |
|----------------+------------------------+-----------------------------------|
| T&             | T&&                    | T&                                |
| T&&            | T&                     | T&                                |
| T&             | T&                     | T&                                |
| T&&            | T&&                    | T&&                               |

