notes.html
<div id="outline-container-orgb94ae63" class="outline-4">
<h4 id="orgb94ae63">auto type deduction</h4>
<div class="outline-text-4" id="text-orgb94ae63">
<p>
The <code>auto</code> keyword can be used to determine the type of the variable during initialization. A very important point is that the type deduction is made for <code>auto</code> keyword not for the variable itself.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int x = 10;</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">45</span>;
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">z</span> = y; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int z = y;</span>

   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">t</span> = <span style="color: #00bcff;">0U</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">unsigned int t = 0U;</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">k</span> = <span style="color: #00bcff;">0</span>.; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">double k = 0.;</span>

   <span style="color: #6ae4b9;">char</span> <span style="color: #ffffff;">c</span> = <span style="color: #79a8ff;">'a'</span>;
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">a</span> = c; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">char a = c;</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">b</span> = +c; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int b = +c;</span>

   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">d</span> = <span style="color: #00bcff;">10</span> &gt; <span style="color: #00bcff;">5</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">bool d = 10 &gt; 5;</span>
</pre>
</div>

<p>
We cannot <code>default initialize</code> an object with <code>auto</code> because in this case the compiler cannot determine its type:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">x</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
</pre>
</div>

<p>
If an object is <code>auto</code> initialized with a <code>const</code> object and does not have any declarator (such as *, &amp;), <code>const</code> qualifier drops:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">cx</span> = <span style="color: #00bcff;">6</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This equals to int y = cx;. const qualifier drops.</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">y</span> = cx;

   <span style="color: #6ae4b9;">int</span>* <span style="color: #b6a0ff;">const</span> <span style="color: #ffffff;">ptr</span> = <span style="color: #00bcff;">0</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">ptr is const pointer to int. If the object itself is const, const qualifier drops.</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">p</span> = ptr; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int* p = ptr;</span>

   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">ptr1</span> = <span style="color: #00bcff;">0</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">ptr1 is pointer to const int. The object itself is not const, const qualifier does not drop in this case.</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">p1</span> = ptr1; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const int* p1 = ptr1;</span>
</pre>
</div>

<p>
If an object is <code>auto</code> initialized with a <code>reference</code> and does not have any declarator (such as *, &amp;), <code>reference</code> qualifier drops:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">r</span> = x;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This equals to int y = r;. reference qualifier drops.</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">y</span> = r;

   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">cr</span> = x;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This equals to int z = cr;. const and reference qualifiers drop.</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">z</span> = cr;
</pre>
</div>

<p>
Array decay rules are still valid: 
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span><span style="color: #ffffff;">[]</span> = <span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">3</span>, <span style="color: #00bcff;">6</span>, <span style="color: #00bcff;">7</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">p</span> = a; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int* p = a;</span>

   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">ca</span><span style="color: #ffffff;">[]</span> = <span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">3</span>, <span style="color: #00bcff;">6</span>, <span style="color: #00bcff;">7</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Here const qualifier does not drop. The object itself 'ca' is not const.</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">It is a pointer to const int after array decay.</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">cp</span> = ca; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const int* cp = ca;</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The type of the "test" is const char[5], it decays to const char*.</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">str</span> = <span style="color: #79a8ff;">"test"</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const char* str = "test";</span>
</pre>
</div>

<p>
<code>auto</code> initialization with functions:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Normally, type of the foo is int(int) but it decays to int (*)(int).</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">fp</span> = foo; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int (*fp)(int) = foo;</span>
</pre>
</div>

<p>
<code>auto</code> initialization and <code>std::initializer_list</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">x</span> = <span style="color: #ffffff;">{</span> <span style="color: #00bcff;">3</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">std::initializer_list x = { 3 };</span>
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">3</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int y{ 3 }; This rule was different before. It was also meaning std::initializer_list y{ 3 };</span>
</pre>
</div>

<p>
Type deduction is made for <code>auto</code> keyword not for variable itself:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">p1</span> = &amp;x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int* p1 = &amp;x; auto -&gt; int*</span>
   <span style="color: #b6a0ff;">auto</span>* <span style="color: #ffffff;">p2</span> = &amp;x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int* p2 = &amp;x; auto -&gt; int</span>

   <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">ptr</span> = &amp;x;
   <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">p1</span> = &amp;ptr; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int** p1 = &amp;ptr; auto -&gt; int**</span>
   <span style="color: #b6a0ff;">auto</span>* <span style="color: #ffffff;">p2</span> = &amp;ptr; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int** p2 = &amp;ptr; auto -&gt; int*</span>
   <span style="color: #b6a0ff;">auto</span>** <span style="color: #ffffff;">p3</span> = &amp;ptr; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int** p3 = &amp;ptr; auto -&gt; int</span>
</pre>
</div>

<p>
If declarators and <code>auto</code> are used together, rules are a bit different:
In this example there is no difference:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #b6a0ff;">auto</span>&amp; <span style="color: #ffffff;">r</span> = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int&amp; r = x;</span>
</pre>
</div>

<p>
But when we use a <code>const</code> object:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const qualifier does not drop here.</span>
   <span style="color: #b6a0ff;">auto</span>&amp; <span style="color: #ffffff;">r</span> = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const int&amp; r = x;</span>
</pre>
</div>

<p>
Array and function rules are also different:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span><span style="color: #ffffff;">[</span><span style="color: #00bcff;">3</span><span style="color: #ffffff;">]</span> = <span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">2</span>, <span style="color: #00bcff;">3</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Array decay does not occur here.</span>
   <span style="color: #b6a0ff;">auto</span>&amp; <span style="color: #ffffff;">x</span> = a; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int (&amp;x)[3] = a;</span>
   <span style="color: #b6a0ff;">auto</span>&amp; <span style="color: #ffffff;">str</span> = <span style="color: #79a8ff;">"test"</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const char (&amp;str)[5] = "test";</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">There is no decay here. Type deduction will be int(int) type for auto.</span>
   <span style="color: #b6a0ff;">auto</span>&amp; <span style="color: #ffffff;">f1</span> = foo; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int (&amp;f1)(int) = foo;   </span>
</pre>
</div>

<p>
If double reference (&amp;&amp;) declarator (forwarding-reference) is used with <code>auto</code>, the rules change significantly. If <code>auto&amp;&amp;</code> is used, the type deduction for the <code>auto</code> keyword depends on the value category of the object used for initialization. Different rules are applied for L-value expressions and R-value expressions (PR-value or X-value).
</p>

<p>
If value of category of the initializer is PR-value, the type deduction for <code>auto</code> will be the type of the expression:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Type deduction for auto will be int because type of 20 is int.</span>
   <span style="color: #b6a0ff;">auto</span>&amp;&amp; <span style="color: #ffffff;">p</span> = <span style="color: #00bcff;">20</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int&amp;&amp; p = 20;</span>
</pre>
</div>

<p>
If value of category of the initializer is L-value, the type deduction for <code>auto</code> will be L-value reference:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Type deduction for auto will be int&amp; but there is no int&amp;&amp;&amp;, so reference collapsing rules apply here.</span>
   <span style="color: #b6a0ff;">auto</span>&amp;&amp; <span style="color: #ffffff;">p</span> = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">After reference collapsing this equals to int&amp; p = x;</span>
</pre>
</div>

<p>
Reference collapsing rules:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">reference type</th>
<th scope="col" class="org-left">binding reference type</th>
<th scope="col" class="org-left">result after reference collapsing</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">T&amp;</td>
<td class="org-left">T&amp;&amp;</td>
<td class="org-left">T&amp;</td>
</tr>

<tr>
<td class="org-left">T&amp;&amp;</td>
<td class="org-left">T&amp;</td>
<td class="org-left">T&amp;</td>
</tr>

<tr>
<td class="org-left">T&amp;</td>
<td class="org-left">T&amp;</td>
<td class="org-left">T&amp;</td>
</tr>

<tr>
<td class="org-left">T&amp;&amp;</td>
<td class="org-left">T&amp;&amp;</td>
<td class="org-left">T&amp;&amp;</td>
</tr>
</tbody>
</table>
</div>
</div>
