notes.org
*** decltype type deduction
 ~auto~ type deduction can be used for initialization but ~decltype~ type deduction does not have this limitation. It can be used in any context intead of types. ~decltype~ is also ~unevaluated context~ like ~sizeof~.

 ~decltype~ has quite complex rules. Using paranthesis is necessary while using ~decltype~. There are 2 different rulesets for ~decltype~:

 Rulesets:
  - If the operand of the ~decltype~ is an ~identifier~, different rules are applied.
  - If the operand of the ~decltype~ is an ~expression~, different rules are applied.

 Example for rulesets:
 #+BEGIN_SRC C++
   struct Data { int a, b, c; };
   
   Data my_data{};
   int x = 10;   
   
   // Identifier rules applied here.
   decltype(my_data);
   decltype(my_data.a);
   decltype(x);
   
   // But here expression rules are applied.
   decltype((x));
   decltype(+x);
 #+END_SRC

 ~decltype~ can be used in a lot of contexts:
 #+BEGIN_SRC C++
   int x = 10;

   decltype(x) foo(); // Function declaration. int foo();
   using my_type = decltype(x); // using my_type = int;

   const int y = 5;
   decltype(x) z = 0; // const int z = 0;
 #+END_SRC

 ~decltype~ and references:
  #+BEGIN_SRC C++
    int x{};
    auto& r{ x };

    decltype(r) r2 = x; // int& r2 = x;

    int y{};
    const auto& r3 = y;
    decltype(r3) r4 = y; // const int& r4 = y;
  #+END_SRC

 When the operand of the ~decltype~ is an expression. The type will be determined by the ~primary value category~ of the expression.
 If the expression is:
  - L-value deduction will be ~T&~
  - PR-value deduction will be ~T~
  - X-value deduction will be ~T&&~

 PR-value expression:
 #+BEGIN_SRC C++
   decltype(10); // PR-Value. int
 #+END_SRC
 
 L-value expression:
 #+BEGIN_SRC C++
   int x = 10;
   int* ptr = &x;
   decltype(*ptr) r = x; // L-value. int& r = x;
 
   int y = 5;
   decltype((y)) z = y; // L-value. int& z = y;
 
   int t = 10;
   decltype(t++); // int
   decltype(++t); // int&
 #+END_SRC
 
 ~decltype~ and arrays:
 #+BEGIN_SRC C++
   int a[5]{};
 
   // a is an identifier
   decltype(a) b; // int b[5]; No array decay.
   // a[0] is an expression
   decltype(a[0]) c = a[1]; // int& c = a[1];
 #+END_SRC

 X-value expression:
 #+BEGIN_SRC C++
  int f1();
  int& f2();
  int&& f3();

  decltype(f1()) x = 5; // PR-value. int x = 5;
  decltype(f2()) y = x; // L-value. int& y = x;
  decltype(f3()) z = 5; // X-value. int&& z = 5;
 #+END_SRC

 Other type deduction mechanisms will be discussed later.
 
 ... 
 
