notes.html
<div id="outline-container-orgf912347" class="outline-4">
<h4 id="orgf912347">decltype type deduction</h4>
<div class="outline-text-4" id="text-orgf912347">
<p>
<code>auto</code> type deduction can be used for initialization but <code>decltype</code> type deduction does not have this limitation. It can be used in any context intead of types. <code>decltype</code> is also <code>unevaluated context</code> like <code>sizeof</code>.
</p>

<p>
<code>decltype</code> has quite complex rules. Using paranthesis is necessary while using <code>decltype</code>. There are 2 different rulesets for <code>decltype</code>:
</p>

<p>
Rulesets:
</p>
<ul class="org-ul">
<li>If the operand of the <code>decltype</code> is an <code>identifier</code>, different rules are applied.</li>
<li>If the operand of the <code>decltype</code> is an <code>expression</code>, different rules are applied.</li>
</ul>

<p>
Example for rulesets:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">Data</span> <span style="color: #ffffff;">{</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>, <span style="color: #ffffff;">b</span>, <span style="color: #ffffff;">c</span>; <span style="color: #ffffff;">}</span>;
   
   <span style="color: #6ae4b9;">Data</span> <span style="color: #ffffff;">my_data</span><span style="color: #ffffff;">{}</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;   
   
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Identifier rules applied here.</span>
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>my_data<span style="color: #ffffff;">)</span>;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>my_data.a<span style="color: #ffffff;">)</span>;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>;
   
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">But here expression rules are applied.</span>
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">))</span>;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>+x<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
<code>decltype</code> can be used in a lot of contexts:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Function declaration. int foo();</span>
   <span style="color: #b6a0ff;">using</span> <span style="color: #6ae4b9;">my_type</span> = <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">using my_type = int;</span>

   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">5</span>;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span> z = <span style="color: #00bcff;">0</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const int z = 0;</span>
</pre>
</div>

<p>
<code>decltype</code> and references:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{}</span>;
    <span style="color: #b6a0ff;">auto</span>&amp; <span style="color: #ffffff;">r</span><span style="color: #ffffff;">{</span> x <span style="color: #ffffff;">}</span>;

    <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>r<span style="color: #ffffff;">)</span> r2 = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int&amp; r2 = x;</span>

    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">{}</span>;
    <span style="color: #b6a0ff;">const</span> <span style="color: #b6a0ff;">auto</span>&amp; <span style="color: #ffffff;">r3</span> = y;
    <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>r3<span style="color: #ffffff;">)</span> r4 = y; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">const int&amp; r4 = y;</span>
</pre>
</div>

<p>
When the operand of the <code>decltype</code> is an expression. The type will be determined by the <code>primary value category</code> of the expression.
If the expression is:
</p>
<ul class="org-ul">
<li>L-value deduction will be <code>T&amp;</code></li>
<li>PR-value deduction will be <code>T</code></li>
<li>X-value deduction will be <code>T&amp;&amp;</code></li>
</ul>

<p>
PR-value expression:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">PR-Value. int</span>
</pre>
</div>

<p>
L-value expression:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">ptr</span> = &amp;x;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>*ptr<span style="color: #ffffff;">)</span> r = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">L-value. int&amp; r = x;</span>
 
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">5</span>;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">(</span>y<span style="color: #ffffff;">))</span> z = y; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">L-value. int&amp; z = y;</span>
 
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">t</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>t++<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int</span>
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>++t<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int&amp;</span>
</pre>
</div>

<p>
<code>decltype</code> and arrays:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span><span style="color: #ffffff;">[</span><span style="color: #00bcff;">5</span><span style="color: #ffffff;">]{}</span>;
 
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">a is an identifier</span>
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>a<span style="color: #ffffff;">)</span> b; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int b[5]; No array decay.</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">a[0] is an expression</span>
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>a<span style="color: #ffffff;">[</span><span style="color: #00bcff;">0</span><span style="color: #ffffff;">])</span> c = a<span style="color: #ffffff;">[</span><span style="color: #00bcff;">1</span><span style="color: #ffffff;">]</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int&amp; c = a[1];</span>
</pre>
</div>

<p>
X-value expression:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
  <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
  <span style="color: #6ae4b9;">int</span>&amp;&amp; <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

  <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span><span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">))</span> x = <span style="color: #00bcff;">5</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">PR-value. int x = 5;</span>
  <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span><span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">))</span> y = x; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">L-value. int&amp; y = x;</span>
  <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span><span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">))</span> z = <span style="color: #00bcff;">5</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">X-value. int&amp;&amp; z = 5;</span>
</pre>
</div>

<p>
Other type deduction mechanisms will be discussed later.
</p>

<p>
&#x2026; 
</p>
</div>
</div>
</div>
