notes.org
** Default Function Arguments
 Unlike C, C++ supports default function arguments. If a function mostly takes the same value for an argument, default function arguments are very helpful.
 When the ~default function argument~ is used, we do not need to pass a value to that argument when calling the function. The compiler will insert the value that we specified:
 #+BEGIN_SRC C++
   void func(int, int, int = 10);

   int x = 1;
   int y = 2;
   int z = 3;

   func(x, y, z); // func(x, y, z);
   func(x, y); // func(x, y, 10); The compiler will insert 10 for the 3rd argument because we did not send any argument for the 3rd parameter.
 #+END_SRC

 If a parameter of a function takes a ~default argument~, all parameters to the right of it must also take a ~default argument~. This essentially means that the ~default arguments~ are valid for the last function parameters:
 #+BEGIN_SRC C++
   void f1(int x, int y = 5, int z); // Invalid.
   void f2(int x, int y = 5, int z = 7); // Valid.
   void f3(int x = 3, int y = 5, int z = 7); // Valid.

   f3(); // f3(3, 5, 7);
   f3(40); // f3(40, 5, 7);
   f3(40, 50); // f3(40, 50, 7);
   f3(40, 50, 60); // f3(40, 50, 60);
 #+END_SRC

 Variables also can be used for ~default function arguments~:
 #+BEGIN_SRC C++
   int x{ 5 };
   void func(int = x); // Valid.

   func(); // func(x);

   int f1(int x = 0);
   void f2(int y = f1());

   f2(); // f2(f1(0));

   int y{ 5 };
   int foo(int n = y++)
   {
       return n;
   }

   // y = 5;
   foo(); // foo(y++); returns 5;
   foo(); // foo(y++); returns 6;
   foo(); // foo(y++); returns 7;
   // y = 8;
 #+END_SRC

 If ~the default function arguments~ are defined both in the function definition and in the declaration, this is a syntax error:
 #+BEGIN_SRC C++
   // Invalid.
   void f2(int x = 10);
   void f2(int x = 10)
   {
       //
   }

   // Valid.
   void f3(int x = 10);
   void f3(int x)
   {
       //
   }
 #+END_SRC
 
 If a function parameter does not take a ~default argument~, we can redeclare the function so that it takes a ~default argument~. This can, for example, allow us to pass ~default arguments~ to functions coming from external header files:
 #+BEGIN_SRC C++
   // external.h
   void func(int, int, int); // Function without any default arguments.

   // #include "external.h"
   void func(int, int, int = 10); // Valid.

   func(1, 5); // func(1, 5, 10);
 #+END_SRC
 
 The compiler takes the ~default arguments~ cumulatively:
 #+BEGIN_SRC C++
  // Invalid, because there are multiple definitions for the same parameter's default argument.
  void f1(int x = 10);
  void f1(int x = 10);

  // f2 does not take any default arguments. 
  void f2(int, int, int);
  // f2 takes a default argument for the 3rd parameter.
  void f2(int, int, int = 10);
  // f2 takes default arguments for the 2nd and 3rd parameters. This equals to void f2(int, int = 5, int = 10);
  // because the compiler takes the default arguments cumulatively.
  void f2(int, int = 5, int);

  f2(1) // f2(1, 5, 10);

  // f3 does not take any default arguments. 
  void f3(int, int, int);
  // Invalid. This is a different case, only last parameters can take default arguments.
  void f3(int, int = 5, int); 
 #+END_SRC

