notes.html
<div id="outline-container-orgde594a7" class="outline-3">
<h3 id="orgde594a7">Default Function Arguments</h3>
<div class="outline-text-3" id="text-orgde594a7">
<p>
Unlike C, C++ supports default function arguments. If a function mostly takes the same value for an argument, default function arguments are very helpful.
When the <code>default function argument</code> is used, we do not need to pass a value to that argument when calling the function. The compiler will insert the value that we specified:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span> = <span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">1</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">2</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span> = <span style="color: #00bcff;">3</span>;

   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>x, y, z<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func(x, y, z);</span>
   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>x, y<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func(x, y, 10); The compiler will insert 10 for the 3rd argument because we did not send any argument for the 3rd parameter.</span>
</pre>
</div>

<p>
If a parameter of a function takes a <code>default argument</code>, all parameters to the right of it must also take a <code>default argument</code>. This essentially means that the <code>default arguments</code> are valid for the last function parameters:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">5</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">5</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span> = <span style="color: #00bcff;">7</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">3</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">5</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span> = <span style="color: #00bcff;">7</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>

   <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f3(3, 5, 7);</span>
   <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">40</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f3(40, 5, 7);</span>
   <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">40</span>, <span style="color: #00bcff;">50</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f3(40, 50, 7);</span>
   <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">40</span>, <span style="color: #00bcff;">50</span>, <span style="color: #00bcff;">60</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f3(40, 50, 60);</span>
</pre>
</div>

<p>
Variables also can be used for <code>default function arguments</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">5</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> = x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>

   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func(x);</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">))</span>;

   <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f2(f1(0));</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">5</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">n</span> = y++<span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">return</span> n;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">y = 5;</span>
   <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">foo(y++); returns 5;</span>
   <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">foo(y++); returns 6;</span>
   <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">foo(y++); returns 7;</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">y = 8;</span>
</pre>
</div>

<p>
If <code>the default function arguments</code> are defined both in the function definition and in the declaration, this is a syntax error:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">//</span>
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">//</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
If a function parameter does not take a <code>default argument</code>, we can redeclare the function so that it takes a <code>default argument</code>. This can, for example, allow us to pass <code>default arguments</code> to functions coming from external header files:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">external.h</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Function without any default arguments.</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">#include "external.h"</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span> = <span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>

   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">5</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func(1, 5, 10);</span>
</pre>
</div>

<p>
The compiler takes the <code>default arguments</code> cumulatively:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid, because there are multiple definitions for the same parameter's default argument.</span>
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>;
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>;

  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f2 does not take any default arguments. </span>
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f2 takes a default argument for the 3rd parameter.</span>
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span> = <span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>;
  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f2 takes default arguments for the 2nd and 3rd parameters. This equals to void f2(int, int = 5, int = 10);</span>
  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">because the compiler takes the default arguments cumulatively.</span>
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span> = <span style="color: #00bcff;">5</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;

  <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">1</span><span style="color: #ffffff;">)</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f2(1, 5, 10);</span>

  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f3 does not take any default arguments. </span>
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid. This is a different case, only last parameters can take default arguments.</span>
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span> = <span style="color: #00bcff;">5</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>; 
</pre>
</div>
</div>
</div>
