notes.org
** Scoped enum / Enum class
 In addition to the ~traditional enum type~, C++ has a new enum type called ~scoped enum~ / ~enum class~. ~Scoped enum~ were introduced to overcome the disadvantages of the ~traditional enum type~.

*** Disadvantages of the traditional enum type
- ~Underlying type~ depends to the compiler. The compiler chooses ~int~ as default type but if ~int~ isn't big enough to store the ~enumeration constants~, the type choosen is compiler dependent. This is why ~traditional enum types~ cannot be used as ~incomplete types~. The compiler cannot know the size when used as an ~incomplete type~, because it may be larger than ~int~.
  #+BEGIN_SRC C++
    enum Color { Red, Green, Blue }; // Underlying type is int.
    enum MyEnum { Aa, Bb, Cc, Dd = 13024325325 }; // Underlying type is compiler dependent.
  #+END_SRC
- Implicit type conversion from ~traditional enum types~ to ~arithmetic types~ is allowed. Unfortunately, this can also lead to many problems.
  #+BEGIN_SRC C++
    enum Color { Red, Green, Blue };
    int x = Red; // Valid.
  #+END_SRC
- ~Enumeration constants~ don't have separate scope. This can cause name conflicts, especially with names from external header files.
  #+BEGIN_SRC C++
    // traffic.h
    enum TrafficLight { Red, Yellow, Green };
    // screen.h
    enum ScreenColor { Gray, White, Red };
  #+END_SRC

*** Advantages of the scoped enum type
 - The ~underlying type~ can be specified. If not specified ~int~ is default.
   #+BEGIN_SRC C++
     enum class Color : unsigned char { White, Black, Gray };
     enum Count : unsigned char { Zero, One, Two, Three }; // C++ also extended the traditional enum types, so that specifying underlying types is possible.
   #+END_SRC
 - No implicit type conversion from ~scoped enum types~ to ~arithmetic types~.
   #+BEGIN_SRC C++
     enum class Color : unsigned char { White, Black, Gray };
     Color color{ Color::Black };
     int x = color; // Invalid.
   #+END_SRC
 - ~Enumeration constants~ are no longer in the same scope with the ~enumeration type~. As the name indicates, they have a separate scope. This eliminates the name conflict problems.
   #+BEGIN_SRC C++
     enum class Color : unsigned char { White, Black, Gray };
     Color color1 = White; // Invalid.
     Color color2 = Color::White; // Valid.

     enum class TrafficLight { Red, Yellow, Green };
     enum class ScreenColor { Gray, White, Red };
     auto sc = ScreenColor::Red;
     auto tl = TrafficLight::Red;
   #+END_SRC

 In C++20, ~using enum declaration~ was added to the language. If we are sure that there is no name conflict, we can use ~using enum declaration~ to use ~enumeration constants~ without specifying them with a namespace.
 #+BEGIN_SRC C++
   enum class Color : unsigned char { White, Black, Gray };
   enum class Count : unsigned char { Zero, One, Two };

   void func()
   {
       // C++20, using enum declaration
       using enum Color;
       using enum Count::Zero;

       auto color1 = White; // Valid.
       auto color2 = Black; // Valid.

       auto count1 = Zero; // Valid.
       auto count2 = One; // Invalid.
   }
 #+END_SRC

