notes.html
<div id="outline-container-orgd123df8" class="outline-3">
<h3 id="orgd123df8">Scoped enum / Enum class</h3>
<div class="outline-text-3" id="text-orgd123df8">
<p>
In addition to the <code>traditional enum type</code>, C++ has a new enum type called <code>scoped enum</code> / <code>enum class</code>. <code>Scoped enum</code> were introduced to overcome the disadvantages of the <code>traditional enum type</code>.
</p>
</div>
<div id="outline-container-org9c0ccbc" class="outline-4">
<h4 id="org9c0ccbc">Disadvantages of the traditional enum type</h4>
<div class="outline-text-4" id="text-org9c0ccbc">
<ul class="org-ul">
<li><p>
<code>Underlying type</code> depends to the compiler. The compiler chooses <code>int</code> as default type but if <code>int</code> isn't big enough to store the <code>enumeration constants</code>, the type choosen is compiler dependent. This is why <code>traditional enum types</code> cannot be used as <code>incomplete types</code>. The compiler cannot know the size when used as an <code>incomplete type</code>, because it may be larger than <code>int</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Red</span>, <span style="color: #ffffff;">Green</span>, <span style="color: #ffffff;">Blue</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Underlying type is int.</span>
    <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">MyEnum</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Aa</span>, <span style="color: #ffffff;">Bb</span>, <span style="color: #ffffff;">Cc</span>, <span style="color: #ffffff;">Dd</span> = <span style="color: #00bcff;">13024325325</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Underlying type is compiler dependent.</span>
</pre>
</div></li>
<li><p>
Implicit type conversion from <code>traditional enum types</code> to <code>arithmetic types</code> is allowed. Unfortunately, this can also lead to many problems.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Red</span>, <span style="color: #ffffff;">Green</span>, <span style="color: #ffffff;">Blue</span> <span style="color: #ffffff;">}</span>;
    <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = Red; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
</pre>
</div></li>
<li><p>
<code>Enumeration constants</code> don't have separate scope. This can cause name conflicts, especially with names from external header files.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">traffic.h</span>
    <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">TrafficLight</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Red</span>, <span style="color: #ffffff;">Yellow</span>, <span style="color: #ffffff;">Green</span> <span style="color: #ffffff;">}</span>;
    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">screen.h</span>
    <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">ScreenColor</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Gray</span>, <span style="color: #ffffff;">White</span>, <span style="color: #ffffff;">Red</span> <span style="color: #ffffff;">}</span>;
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org85c7450" class="outline-4">
<h4 id="org85c7450">Advantages of the scoped enum type</h4>
<div class="outline-text-4" id="text-org85c7450">
<ul class="org-ul">
<li><p>
The <code>underlying type</code> can be specified. If not specified <code>int</code> is default.
</p>
<div class="org-src-container">
<pre class="src src-C++">     <span style="color: #b6a0ff;">enum</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Color</span> : <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">char</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">White</span>, <span style="color: #ffffff;">Black</span>, <span style="color: #ffffff;">Gray</span> <span style="color: #ffffff;">}</span>;
     <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Count</span> : <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">char</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Zero</span>, <span style="color: #ffffff;">One</span>, <span style="color: #ffffff;">Two</span>, <span style="color: #ffffff;">Three</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C++ also extended the traditional enum types, so that specifying underlying types is possible.</span>
</pre>
</div></li>
<li><p>
No implicit type conversion from <code>scoped enum types</code> to <code>arithmetic types</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">     <span style="color: #b6a0ff;">enum</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Color</span> : <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">char</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">White</span>, <span style="color: #ffffff;">Black</span>, <span style="color: #ffffff;">Gray</span> <span style="color: #ffffff;">}</span>;
     <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">color</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">Color</span>::Black <span style="color: #ffffff;">}</span>;
     <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = color; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
</pre>
</div></li>
<li><p>
<code>Enumeration constants</code> are no longer in the same scope with the <code>enumeration type</code>. As the name indicates, they have a separate scope. This eliminates the name conflict problems.
</p>
<div class="org-src-container">
<pre class="src src-C++">     <span style="color: #b6a0ff;">enum</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Color</span> : <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">char</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">White</span>, <span style="color: #ffffff;">Black</span>, <span style="color: #ffffff;">Gray</span> <span style="color: #ffffff;">}</span>;
     <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">color1</span> = White; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
     <span style="color: #6ae4b9;">Color</span> <span style="color: #ffffff;">color2</span> = <span style="color: #00bcff;">Color</span>::White; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>

     <span style="color: #b6a0ff;">enum</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">TrafficLight</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Red</span>, <span style="color: #ffffff;">Yellow</span>, <span style="color: #ffffff;">Green</span> <span style="color: #ffffff;">}</span>;
     <span style="color: #b6a0ff;">enum</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">ScreenColor</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Gray</span>, <span style="color: #ffffff;">White</span>, <span style="color: #ffffff;">Red</span> <span style="color: #ffffff;">}</span>;
     <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">sc</span> = <span style="color: #00bcff;">ScreenColor</span>::Red;
     <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">tl</span> = <span style="color: #00bcff;">TrafficLight</span>::Red;
</pre>
</div></li>
</ul>

<p>
In C++20, <code>using enum declaration</code> was added to the language. If we are sure that there is no name conflict, we can use <code>using enum declaration</code> to use <code>enumeration constants</code> without specifying them with a namespace.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">enum</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Color</span> : <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">char</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">White</span>, <span style="color: #ffffff;">Black</span>, <span style="color: #ffffff;">Gray</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #b6a0ff;">enum</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Count</span> : <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">char</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">Zero</span>, <span style="color: #ffffff;">One</span>, <span style="color: #ffffff;">Two</span> <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C++20, using enum declaration</span>
       <span style="color: #b6a0ff;">using</span> <span style="color: #b6a0ff;">enum</span> Color;
       <span style="color: #b6a0ff;">using</span> <span style="color: #b6a0ff;">enum</span> <span style="color: #00bcff;">Count</span>::Zero;

       <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">color1</span> = White; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
       <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">color2</span> = Black; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>

       <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">count1</span> = Zero; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
       <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">count2</span> = One; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
</div>
