notes.html
<div id="outline-container-org68dbf70" class="outline-3">
<h3 id="org68dbf70">Type Cast Operators</h3>
<div class="outline-text-3" id="text-org68dbf70">
<p>
In C++, there 2 different type conversions: <code>implicit type conversion</code> and <code>explicit type conversion</code>. In some cases the compiler is free to do <code>implicit type conversion</code> depending on the rules of the language, but if we want to explicity convert a type, we have to do <code>explicit type conversion</code> by using <code>type cast operators</code>.
</p>

<p>
There are 4-different type cast operators in C++ (excluding <code>C-style cast</code>):
</p>
<ul class="org-ul">
<li><code>static_cast&lt;target_type&gt;(operand)</code>
<ul class="org-ul">
<li>Mostly used casting between different arithmetic and enumeration types, also can be used to cast from <code>void*</code> to another pointer type.</li>
</ul></li>
<li><code>const_cast&lt;target_type&gt;(operand)</code>
<ul class="org-ul">
<li>Used for casting <code>const T*</code> to <code>T*</code>.</li>
</ul></li>
<li><code>reinterpret_cast&lt;target_type&gt;(operand)</code>
<ul class="org-ul">
<li>Used for casting between different pointer and reference types. Ex. <code>int*</code> to <code>char*</code>.</li>
</ul></li>
<li><code>dynamic_cast&lt;target_type&gt;(operand)</code>
<ul class="org-ul">
<li>This cast is about runtime polymorphism, can be used to cast from <code>base class</code> to <code>derived class</code>.</li>
</ul></li>
</ul>

<p>
Example for <code>static_cast</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">3</span>;

   <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">dval</span> = <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">double</span>&gt;<span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span> / y;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">ival</span> = <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">int</span>&gt;<span style="color: #ffffff;">(</span>dval<span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">enum</span> <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Pos</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">off</span>, <span style="color: #ffffff;">on</span>, <span style="color: #ffffff;">hold</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #6ae4b9;">Pos</span> <span style="color: #ffffff;">pos</span> = <span style="color: #00bcff;">Pos</span>::off;
   ival = <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">int</span>&gt;<span style="color: #ffffff;">(</span>pos<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
Example for <code>const_cast</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">char</span>* <span style="color: #feacd0;">mystrchr</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">p</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">c</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #feacd0;">while </span><span style="color: #ffffff;">(</span>*p<span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span>*p == c<span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #b6a0ff;">return</span> <span style="color: #b6a0ff;">const_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span>p<span style="color: #ffffff;">)</span>;
       <span style="color: #ffffff;">}</span>
       ++p;
       <span style="color: #ffffff;">}</span>

       <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span>c == <span style="color: #79a8ff;">'\0'</span><span style="color: #ffffff;">)</span>
       <span style="color: #b6a0ff;">return</span> <span style="color: #b6a0ff;">const_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span>p<span style="color: #ffffff;">)</span>;

       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">nullptr</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
Example for <code>reinterpret_cast</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">dval</span> = <span style="color: #00bcff;">451.2356</span>;
   <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">p</span> = <span style="color: #b6a0ff;">reinterpret_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span>&amp;dval<span style="color: #ffffff;">)</span>;

   <span style="color: #feacd0;">for </span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #ffffff;">i</span><span style="color: #ffffff;">{}</span>; i &lt; <span style="color: #feacd0;">sizeof</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span><span style="color: #ffffff;">)</span>; ++i<span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; p<span style="color: #ffffff;">[</span>i<span style="color: #ffffff;">]</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
Example for <code>dynamic_cast</code>:
 Will be explained later.
 &#x2026;
</p>
</div>
<div id="outline-container-org69878d0" class="outline-4">
<h4 id="org69878d0">Why C-style type cast is not enough?</h4>
<div class="outline-text-4" id="text-org69878d0">
<p>
Different <code>explicit type conversions</code> can have different intentions and meanings. There can be many different reasons for converting one type to another type:
</p>
<ul class="org-ul">
<li><code>Explicit type conversion</code> can be used to indicate that there will be data loss and that this is not a problem.</li>
<li><code>Explicit type conversion</code> can be used to convert <code>const T*</code> to <code>T*</code>, if we know the actual object is not a <code>const</code> object.</li>
<li><code>Explicit type conversion</code> can be used to convert <code>T*</code> to <code>char*</code>, to use the actual object as a char array.</li>
</ul>

<p>
The list can be extended with different examples, but the point is that not every <code>explicit type conversion</code> has the same intention/meaning. The syntax of <code>C-style type cast</code> is very simple, but it is not sufficient to explain the intention of the conversion.
</p>
</div>
</div>
</div>
