notes.html
<div id="outline-container-orgf8b7760" class="outline-3">
<h3 id="orgf8b7760">Function Overloading</h3>
<div class="outline-text-3" id="text-orgf8b7760">
<p>
In C++, multiple functions can have the same name but with different parameters. These functions can perform different tasks based on the parameters passed to them. The compiler differentiates between the overloaded functions by their number of parameters, types of parameters, and the order of parameters. When the compiler encounters a call to an overloaded function, it uses the argument types and number of arguments to determine which version of the overloaded function to invoke. This process, called <code>static/early binding</code> or <code>compile-time polymorphism</code>, happens at compile-time, meaning the function to be executed is determined before the program runs. Function overloading is all about compile-time, it has no run-time overhead. For function overloading, there are 2 different and important points for the compiler to decide. Is there a function overloading for the particular function and if so, which function to choose. The process by the compiler to decide which function to choose is called <code>function overload resolution</code>.
</p>

<p>
To talk about function overloading, there are 3 different things to consider:
</p>
<ul class="org-ul">
<li>Function names have to be the same.</li>
<li>Function signatures have to be different.</li>
<li>Functions have to be in the same scope.
<ul class="org-ul">
<li>namespace scope</li>
<li>class scope</li>
<li>block scope</li>
</ul></li>
</ul>

<p>
If one function is in <code>namespace scope</code> and the other is in <code>block scope</code>, even if they have the same name, it will not cause function overloading. It causes <code>name shadowing</code> instead:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span><span style="color: #ffffff;">)</span>;

       <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">5</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">There is no funcion overloading. foo(double) will be called due to name shadowing.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
In order to do function overloading, functions must have different signatures. <code>return</code> type is not part of the signature:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">double</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid, syntax error.</span>
</pre>
</div>

<p>
This is valid function overloading. Same function names, in the same scope and different signatures.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
<code>Default function arguments</code> do not effect <code>function signature</code>. These functions still have different signatures and this is valid <code>function overloading</code>. We don't talk about what happens when we call the function <code>foo()</code> with only one argument. It is about <code>function overload resolution</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span> = <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
If the parameter itself is <code>const</code> (<code>top-level const</code>) it doesn't effect <code>function signature</code>. No <code>function overloading</code> here, it is <code>function redeclaration</code>;
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, no overload. Function redeclaration.</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span>* <span style="color: #b6a0ff;">const</span> <span style="color: #ffffff;">p</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span>* <span style="color: #ffffff;">p</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, no overload. Function redeclaration</span>
</pre>
</div>

<p>
<code>const T*</code> is a different type than <code>T*</code>. <code>Low-level const</code> changes <code>function signature</code>. This is valid <code>function overloading</code> and mostly called <code>const overload</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>*<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>*<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
<code>const T&amp;</code> is a different type than <code>T&amp;</code>. This is valid <code>function overloading</code> and it is commonly used:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
A Type alias doesn't mean a different type than the underlying type. No <code>function oveloading</code> here:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">typedef</span> <span style="color: #6ae4b9;">double</span> <span style="color: #6ae4b9;">flt_type</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">flt_type</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, no overload. Function redeclaration.</span>
</pre>
</div>

<p>
<code>char</code>, <code>unsigned char</code> and <code>signed char</code> are 3 different distinct types. There are 3 <code>function overload</code> here:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">char</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">signed</span> <span style="color: #6ae4b9;">char</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">char</span><span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
There are 3 <code>function overloads</code> here:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>*<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>**<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>***<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
L-value reference and R-value reference. This is valid <code>function overloading</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;&amp;<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
There are 3 overloads:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;&amp;<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
We can't say there is <code>function overload</code> or not. This is <code>implementation defined</code>, <code>std::int32_t</code> is not a distinct type but a type alias and underlying type is dependent to the compiler:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If std::int32_t is alias to int. This is function redeclaration.</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If std::int32_t is alias to long. This is valid function overload.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::int32_t<span style="color: #ffffff;">)</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid function overload. std::int32_t and std::int16_t cannot be alias of the same type.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::int32_t<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::int16_t<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
If array notation used in function declaration, array decay happens. There is no <code>function overloading</code> here:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">p</span><span style="color: #ffffff;">[])</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Decays to foo(int*);</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">p</span><span style="color: #ffffff;">[</span><span style="color: #00bcff;">20</span><span style="color: #ffffff;">])</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Decays to foo(int*); Function redeclaration.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">foo(int*); Function redeclaration.</span>
</pre>
</div>

<p>
If a function takes function as a parameter. It decays to function pointer. No <code>function overloading</code> here:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">))</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Decays to foo(int (*)(int));</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">(</span>*<span style="color: #ffffff;">)(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">))</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Function redeclaration.</span>
</pre>
</div>

<p>
There are 4 different <code>function overloads</code> here:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #feacd0;"> </span><span style="color: #ffffff;">(</span>*<span style="color: #ffffff;">)[</span><span style="color: #00bcff;">5</span><span style="color: #ffffff;">])</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int(*)[5]; a pointer to int[5]</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #feacd0;"> </span><span style="color: #ffffff;">(</span>*<span style="color: #ffffff;">)[</span><span style="color: #00bcff;">6</span><span style="color: #ffffff;">])</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int(*)[6]; a pointer to int[6]</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #feacd0;"> </span><span style="color: #ffffff;">(</span>*<span style="color: #ffffff;">)[</span><span style="color: #00bcff;">7</span><span style="color: #ffffff;">])</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int(*)[7]; a pointer to int[7]</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #feacd0;"> </span><span style="color: #ffffff;">(</span>*<span style="color: #ffffff;">)[</span><span style="color: #00bcff;">8</span><span style="color: #ffffff;">])</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int(*)[8]; a pointer to int[8]</span>
</pre>
</div>
</div>
