notes.org
*** Function overload resolution
 ~Function overload resolution~ is handled by the compiler as a 3 step process. Actually, 3 steps is the maximum, it may take fewer steps:
 - Choosing ~candidate functions~.
   + In this step, the compiler doesn't check function arguments but marks the visible functions in the same scope which has the same name.
 - Choosing ~viable functions~.
   + The compiler checks each ~candidate function~ too see if it can be called with the arguments we passed it without syntax errors. If there are no syntax errors, the compiler marks that function. These marked functions are called ~viable functions~. After this step, all functions that are not suitable for calling are eliminated and only those functions that can be called legally remain.
   + In this step, the compiler determines the ~viable functions~ depending on passed arguments. The number of arguments, the types of arguments, the default function arguments and the implicit conversion rules between types all are very important in this step.
   + More than one function overload does not guarantee that a call with this name is valid. None of the function overloads may be ~viable functions~, this is called ~no match~. 
 - Choosing the ~best viable function~.
   + If there are more than one ~viable function~, the compiler will decide which one is the ~best match~ based on the rules of the language.
   + There may be more than one ~viable function~ among which the compiler cannot decide which one to choose, because there are no selection criteria in terms of the rules of the language, this is called ~ambiguity~.

 Rules for choosing the ~best viable function~ / ~best match~:
  - ~variadic conversion~ always loses if there are any other alternatives.
  - ~user-defined conversion~ always loses except when the alternative is ~variadic conversion~.
    + If there are more than one ~viable function~ with ~user-defined conversion~, this might cause an ~ambiguity~ error, if there is no better alternative (~standard converion~).
  - ~standard/implicit conversion~ always wins except when the other alternatives are also ~standart conversion~. There are different rules for this case.
    + ~exact match~ always wins over ~promotion~.
      * When the function parameters and the arguments are the same.
      * ~implicit conversion~ from ~T*~ to ~const T*~.
      * ~array to pointer conversion~ / ~Array decay~.
      * ~function to pointer conversion~.
    + ~promotion~ always wins over ~conversion~.
      * ~integral promotion~ (types which have lower rank than ~int~ are promoted to ~int~),
      * ~float to double promotion~
    + ~conversion~ always wins over ~user-defined conversion~.
      * ~conversion~ between different types which is not ~promotion~. (~char~ to ~double~, ~double~ to ~int~ etc.)

 Functions with multiple parameters can also be overloaded. In this case, one of the ~function overloads~ must be win over to the others in at least one parameter and must be at least equal (shouldn't be weaker) in the other parameters.

 From weaker ~viable function~ to stronger:
  ~variadic conversion~ < ~user-defined conversion~ < ~standard conversion~ < ~standard promotion~ < ~exact match~

 #+BEGIN_SRC C++
   void f(int);
   void f(double);
   void f(long);

   f(3.4); // f(double) will be called, exact match.
   f(12); // f(int) will be called, exact match.
   f(12u); // unsigned int can be converted to int, double and long. Three different standard conversion causes ambiguity.
   f(true); // f(int) will be called, bool to int is integral promotion and promotion wins over conversion.
   f(2.3L); // long double can be converted to int, double and long. Three different standard conversion causes ambiguity.
   f(2.3f); // f(double) will be called, float to double promotion.
   f('A'); // f(int) will be called, integral promotion from char to int.
 #+END_SRC

 If one of the ~viable functions~ takes ~T*~ and the other one takes ~const T*~, this is called ~const overloading~ and means both of them are ~exact match~. If the argument type is ~const T*~, ~const T*~ will be called, otherwise ~T*~ will be called. This is also valid for references.
 #+BEGIN_SRC C++
   void f1(int*);
   void f1(const int*);
   void f2(int&);
   void f2(const int&);

   const int cx = 5;
   int x = 5;

   f1(&cx); // f1(const int*) will be called.
   f1(&x); // f1(int*) will be called.

   f2(&cx); // f2(const int&) will be called.
   f2(&x); // f2(int&) will be called.
 #+END_SRC

 Default function arguments can cause ~ambiguity~:
 #+BEGIN_SRC C++
   void func(int x, int y = 0);
   void func(int x);

   func(12); // There are 2 valid oveloads of func but the compiler cannot decide between them. Ambiguity error.
 #+END_SRC

 Having 2 different ~function overloads~ for ~call by value~ and ~call by reference~ can cause ~ambiguity~:
 #+BEGIN_SRC C++
   void f1(int& x);
   void f1(int x);

   void f2(const int& x);
   void f2(int x);

   int x = 10;

   f1(x); // Invalid, ambigious call.
   f1(10); // Valid, func(x) will be called.
   f2(x); // Invalid, ambigious call.
   f2(10); // Invalid, ambigious call.
 #+END_SRC

 Using C-style null pointer can cause ~ambiguity~:
 #+BEGIN_SRC C++
   void func(double*);
   void func(int);

   // Let's say the intention was to call func(double*) with null pointer and then we added a new overload func(int). This code will not give any error and call to func(int), because it will be exact match. If we really want to call func(double*) with null pointer we should use nullptr.
   func(0); // Valid, func(int) will be called.
   func(nullptr); // Valid, func(double*) will be called.
 #+END_SRC

 We can choose the overload we want to call by using ~explicit cast~. We can also use ~name shadowing~ to call the function we want by ~redeclaring~ it in the current scope.
 #+BEGIN_SRC C++
   void func(int);
   void func(double);
   void func(long);

   int main()
   {
       int x = 10;

       func(static_cast<double>(x)); // func(double) will be called.

	// This function redeclaration causes name shadowing. From this point on, every call to func in this scope will be call to func(long).
       void func(long);

       func(x); // func(long) will be called.
       func(2.3); // func(long) will be called.
   }
 #+END_SRC

 When one of the overloads is ~bool~ and the other is ~void*~, this should normally cause ~ambiguity~ when called with pointer types, but this is an exception and the ~void*~ one will be called:
 #+BEGIN_SRC C++
   void func(bool);
   void func(void*);

   int x{};

   // Implicit conversion from int* to bool and from int* to void* exist. Normally, this should cause ambiguity but this is a special case and func(void*) will be called.
   func(&x);
 #+END_SRC

 We can call ~L-value reference~ overloads with ~L-value expressions~, and ~R-value reference~ overloads with ~R-value expressions~. Normally, ~const L-value reference~ and ~R-value reference~ both can be called with ~R-value expressions~ but this doesn't cause ~ambiguity~. The function which takes an ~R-value reference~ will be called in this case:
 #+BEGIN_SRC C++
     void f1(int&);
     void f1(int&&);

     void f2(const int&);
     void f2(int&&);

     int x{};

     f1(10); // Valid, 10 is R-value expression, f1(int&&) will be called.
     f1(x); // Valid, x is L-value expression, f1(int&) will be called.

     f2(x); // Valid, x is L-value expression, f2(const int&) will be called.
     // Valid, 10 is R-value expression, normally f2(const int&) and f2(int&&) both
     // can be called with a R-value expression but this does not cause ambiguity. f2(int&&) will be called.
     f2(10);
 #+END_SRC

 ~Data type~ (~declaration type~) and ~value category~ are not the same thing. Variables/declarations don't have a ~value category~ but ~data type~, we need to have an ~expression~ to talk about ~value category~. We can observe it in this example:
 #+BEGIN_SRC C++
   #include <iostream>

   void bar(int& x)
   {
       std::cout << 3;
   }

   void bar(int&& x)
   {
       std::cout << 4;
   }

   void func(int& x)
   {
       std::cout << 1;
       bar(x);
   }

   void func(int&& x)
   {
       std::cout << 2;
       // The data/declaration type of x is int&& but the value category of x when used in an expression is L-value
       // so bar(int&) will be called.
       bar(x);
   }

   int main()
   {
       int x = 10;

       func(x); // Output: 13
       func(10); // Output: 23
   }
 #+END_SRC

 We were always using one paramater for ~function oveloads~, but functions with multiple parameters can also be overloaded. In this case, one of the ~function overloads~ must win over to the others in at least one parameter and must be at least equal in the other parameters.
 #+BEGIN_SRC C++
   void f1(int, double, long); // 1
   void f1(char, int, double); // 2
   void f1(long, unsigned int, float); // 3

   // Function 1 will be chosen. The 1st parameter of function 1 wins over the 1st parameter of function 2 and 3, because it is exact match. 2nd and 3rd parameter is equal for functions 1, 2 and 3, because all of them are standart conversion.
   f(12, 4L, 1);
   // Function 2 will be chosen. The 2nd parameter of function 2 wins over the 2nd parameter of function 1 and 3, because it is standard promotion. 1st and 3rd parameter is equal for functions 1, 2 and 3, because all of them are standart conversion.
   f(2.3, true, 12);
   // Function 3 will be chosen. The 1st parameter of function 3 wins over the 1st parameter of function 1 and 2, because it is exact match. 2nd and 3rd parameter is equal for functions 1, 2 and 3, because all of them are standart conversion.
   f(34L, 3.5L, 12);
   // This causes ambiguity. The 1st parameter of function 1 has exact match, but the 2nd parameter of the function 2 also has exact match. The 3rd parameters have standard conversion. There are 2 exact matches for different function overloads, in this case the compiler cannot decide. One of the overloads must win over others at least on one parameter, and at least be equal on the other parameters.
   f(12, 12, 12);
 #+END_SRC

