notes.html
<div id="outline-container-org41a5942" class="outline-4">
<h4 id="org41a5942">Function overload resolution</h4>
<div class="outline-text-4" id="text-org41a5942">
<p>
<code>Function overload resolution</code> is handled by the compiler as a 3 step process. Actually, 3 steps is the maximum, it may take fewer steps:
</p>
<ul class="org-ul">
<li>Choosing <code>candidate functions</code>.
<ul class="org-ul">
<li>In this step, the compiler doesn't check function arguments but marks the visible functions in the same scope which has the same name.</li>
</ul></li>
<li>Choosing <code>viable functions</code>.
<ul class="org-ul">
<li>The compiler checks each <code>candidate function</code> too see if it can be called with the arguments we passed it without syntax errors. If there are no syntax errors, the compiler marks that function. These marked functions are called <code>viable functions</code>. After this step, all functions that are not suitable for calling are eliminated and only those functions that can be called legally remain.</li>
<li>In this step, the compiler determines the <code>viable functions</code> depending on passed arguments. The number of arguments, the types of arguments, the default function arguments and the implicit conversion rules between types all are very important in this step.</li>
<li>More than one function overload does not guarantee that a call with this name is valid. None of the function overloads may be <code>viable functions</code>, this is called <code>no match</code>.</li>
</ul></li>
<li>Choosing the <code>best viable function</code>.
<ul class="org-ul">
<li>If there are more than one <code>viable function</code>, the compiler will decide which one is the <code>best match</code> based on the rules of the language.</li>
<li>There may be more than one <code>viable function</code> among which the compiler cannot decide which one to choose, because there are no selection criteria in terms of the rules of the language, this is called <code>ambiguity</code>.</li>
</ul></li>
</ul>

<p>
Rules for choosing the <code>best viable function</code> / <code>best match</code>:
</p>
<ul class="org-ul">
<li><code>variadic conversion</code> always loses if there are any other alternatives.</li>
<li><code>user-defined conversion</code> always loses except when the alternative is <code>variadic conversion</code>.
<ul class="org-ul">
<li>If there are more than one <code>viable function</code> with <code>user-defined conversion</code>, this might cause an <code>ambiguity</code> error, if there is no better alternative (<code>standard converion</code>).</li>
</ul></li>
<li><code>standard/implicit conversion</code> always wins except when the other alternatives are also <code>standart conversion</code>. There are different rules for this case.
<ul class="org-ul">
<li><code>exact match</code> always wins over <code>promotion</code>.
<ul class="org-ul">
<li>When the function parameters and the arguments are the same.</li>
<li><code>implicit conversion</code> from <code>T*</code> to <code>const T*</code>.</li>
<li><code>array to pointer conversion</code> / <code>Array decay</code>.</li>
<li><code>function to pointer conversion</code>.</li>
</ul></li>
<li><code>promotion</code> always wins over <code>conversion</code>.
<ul class="org-ul">
<li><code>integral promotion</code> (types which have lower rank than <code>int</code> are promoted to <code>int</code>),</li>
<li><code>float to double promotion</code></li>
</ul></li>
<li><code>conversion</code> always wins over <code>user-defined conversion</code>.
<ul class="org-ul">
<li><code>conversion</code> between different types which is not <code>promotion</code>. (<code>char</code> to <code>double</code>, <code>double</code> to <code>int</code> etc.)</li>
</ul></li>
</ul></li>
</ul>

<p>
Functions with multiple parameters can also be overloaded. In this case, one of the <code>function overloads</code> must be win over to the others in at least one parameter and must be at least equal (shouldn't be weaker) in the other parameters.
</p>

<p>
From weaker <code>viable function</code> to stronger:
 <code>variadic conversion</code> &lt; <code>user-defined conversion</code> &lt; <code>standard conversion</code> &lt; <code>standard promotion</code> &lt; <code>exact match</code>
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">long</span><span style="color: #ffffff;">)</span>;

   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">3.4</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f(double) will be called, exact match.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">12</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f(int) will be called, exact match.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">12u</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">unsigned int can be converted to int, double and long. Three different standard conversion causes ambiguity.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">true</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f(int) will be called, bool to int is integral promotion and promotion wins over conversion.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">2.3L</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">long double can be converted to int, double and long. Three different standard conversion causes ambiguity.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">2.3f</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f(double) will be called, float to double promotion.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">'A'</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f(int) will be called, integral promotion from char to int.</span>
</pre>
</div>

<p>
If one of the <code>viable functions</code> takes <code>T*</code> and the other one takes <code>const T*</code>, this is called <code>const overloading</code> and means both of them are <code>exact match</code>. If the argument type is <code>const T*</code>, <code>const T*</code> will be called, otherwise <code>T*</code> will be called. This is also valid for references.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>*<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>*<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">cx</span> = <span style="color: #00bcff;">5</span>;
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">5</span>;

   <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span>&amp;cx<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f1(const int*) will be called.</span>
   <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span>&amp;x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f1(int*) will be called.</span>

   <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span>&amp;cx<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f2(const int&amp;) will be called.</span>
   <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span>&amp;x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f2(int&amp;) will be called.</span>
</pre>
</div>

<p>
Default function arguments can cause <code>ambiguity</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>;

   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">12</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">There are 2 valid oveloads of func but the compiler cannot decide between them. Ambiguity error.</span>
</pre>
</div>

<p>
Having 2 different <code>function overloads</code> for <code>call by value</code> and <code>call by reference</code> can cause <code>ambiguity</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

   <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid, ambigious call.</span>
   <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, func(x) will be called.</span>
   <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid, ambigious call.</span>
   <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid, ambigious call.</span>
</pre>
</div>

<p>
Using C-style null pointer can cause <code>ambiguity</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span>*<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Let's say the intention was to call func(double*) with null pointer and then we added a new overload func(int). This code will not give any error and call to func(int), because it will be exact match. If we really want to call func(double*) with null pointer we should use nullptr.</span>
   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, func(int) will be called.</span>
   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">nullptr</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, func(double*) will be called.</span>
</pre>
</div>

<p>
We can choose the overload we want to call by using <code>explicit cast</code>. We can also use <code>name shadowing</code> to call the function we want by <code>redeclaring</code> it in the current scope.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">long</span><span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">double</span>&gt;<span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">))</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func(double) will be called.</span>

    <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This function redeclaration causes name shadowing. From this point on, every call to func in this scope will be call to func(long).</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">long</span><span style="color: #ffffff;">)</span>;

       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func(long) will be called.</span>
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">2.3</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func(long) will be called.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
When one of the overloads is <code>bool</code> and the other is <code>void*</code>, this should normally cause <code>ambiguity</code> when called with pointer types, but this is an exception and the <code>void*</code> one will be called:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">bool</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">void</span>*<span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Implicit conversion from int* to bool and from int* to void* exist. Normally, this should cause ambiguity but this is a special case and func(void*) will be called.</span>
   <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>&amp;x<span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
We can call <code>L-value reference</code> overloads with <code>L-value expressions</code>, and <code>R-value reference</code> overloads with <code>R-value expressions</code>. Normally, <code>const L-value reference</code> and <code>R-value reference</code> both can be called with <code>R-value expressions</code> but this doesn't cause <code>ambiguity</code>. The function which takes an <code>R-value reference</code> will be called in this case:
</p>
<div class="org-src-container">
<pre class="src src-C++">     <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;
     <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;&amp;<span style="color: #ffffff;">)</span>;

     <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>&amp;<span style="color: #ffffff;">)</span>;
     <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;&amp;<span style="color: #ffffff;">)</span>;

     <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{}</span>;

     <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, 10 is R-value expression, f1(int&amp;&amp;) will be called.</span>
     <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, x is L-value expression, f1(int&amp;) will be called.</span>

     <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, x is L-value expression, f2(const int&amp;) will be called.</span>
     <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, 10 is R-value expression, normally f2(const int&amp;) and f2(int&amp;&amp;) both</span>
     <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">can be called with a R-value expression but this does not cause ambiguity. f2(int&amp;&amp;) will be called.</span>
     <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>;
</pre>
</div>

<p>
<code>Data type</code> (<code>declaration type</code>) and <code>value category</code> are not the same thing. Variables/declarations don't have a <code>value category</code> but <code>data type</code>, we need to have an <code>expression</code> to talk about <code>value category</code>. We can observe it in this example:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ff7f86;">   #include</span> <span style="color: #79a8ff;">&lt;iostream&gt;</span>

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">bar</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #00bcff;">3</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">bar</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;&amp; <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #00bcff;">4</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #00bcff;">1</span>;
       <span style="color: #feacd0;">bar</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>&amp;&amp; <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #00bcff;">2</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The data/declaration type of x is int&amp;&amp; but the value category of x when used in an expression is L-value</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">so bar(int&amp;) will be called.</span>
       <span style="color: #feacd0;">bar</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Output: 13</span>
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Output: 23</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
We were always using one paramater for <code>function oveloads</code>, but functions with multiple parameters can also be overloaded. In this case, one of the <code>function overloads</code> must win over to the others in at least one parameter and must be at least equal in the other parameters.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">double</span>, <span style="color: #6ae4b9;">long</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">1</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">char</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">double</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">2</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">long</span>, <span style="color: #6ae4b9;">unsigned</span> <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">float</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">3</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Function 1 will be chosen. The 1st parameter of function 1 wins over the 1st parameter of function 2 and 3, because it is exact match. 2nd and 3rd parameter is equal for functions 1, 2 and 3, because all of them are standart conversion.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">12</span>, <span style="color: #00bcff;">4L</span>, <span style="color: #00bcff;">1</span><span style="color: #ffffff;">)</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Function 2 will be chosen. The 2nd parameter of function 2 wins over the 2nd parameter of function 1 and 3, because it is standard promotion. 1st and 3rd parameter is equal for functions 1, 2 and 3, because all of them are standart conversion.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">2.3</span>, <span style="color: #00bcff;">true</span>, <span style="color: #00bcff;">12</span><span style="color: #ffffff;">)</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Function 3 will be chosen. The 1st parameter of function 3 wins over the 1st parameter of function 1 and 2, because it is exact match. 2nd and 3rd parameter is equal for functions 1, 2 and 3, because all of them are standart conversion.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">34L</span>, <span style="color: #00bcff;">3.5L</span>, <span style="color: #00bcff;">12</span><span style="color: #ffffff;">)</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This causes ambiguity. The 1st parameter of function 1 has exact match, but the 2nd parameter of the function 2 also has exact match. The 3rd parameters have standard conversion. There are 2 exact matches for different function overloads, in this case the compiler cannot decide. One of the overloads must win over others at least on one parameter, and at least be equal on the other parameters.</span>
   <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">12</span>, <span style="color: #00bcff;">12</span>, <span style="color: #00bcff;">12</span><span style="color: #ffffff;">)</span>;
</pre>
</div>
</div>
</div>
</div>
