notes.org
** Name Mangling
 ~Name mangling~ is a process used by C++ compilers to generate unique names for functions, variables, and other entities to support features like ~function overloading~, ~namespaces~, and ~template instantiation~. Since C++ allows multiple functions with the same name (through ~function overloading~), the compiler needs a way to differentiate between these functions at the binary level. ~Name mangling~ achieves this by encoding additional information, such as the function's ~parameter types~, ~return type~, and the ~namespace~ or ~class~ it belongs to, into the function's name. 

 ~Name mangling~ can cause some problems when we call a C function from a C++ source. An example of a problem caused by ~name mangling~:
 #+BEGIN_SRC C++
   // test.h
   int func(int);

   // test.c
   int func(int x)
   {
       return x + 1;
   }

   // main.cpp
   #include "test.h"

   int main()
   {
       // This code will be built successfully but will not be linked. The
       // linker program will not find func(int) because the C++ compiler
       // will produce a mangled/decorated name for func(int), but it is a
       // C function. The name produced by the C compiler will not match
       // the name produced by the C++ compiler, because there is no name
       // mangling in C.
       auto x = func(20);
   }
 #+END_SRC

 To solve this kind of problems we typically use ~extern "C"~ declaration with ~conditional compiling~. By doing this we can use the same ~header file~ for both C and C++.

 #+BEGIN_SRC C++
   // test.h
   #ifdef __cplusplus
   extern "C" { // open extern "C" block.
   #endif

   int func(int);

   #ifdef __cplusplus
   } // close extern "C" block.
   #endif

   // test.c
   int func(int x)
   {
       return x + 1;
   }

   // main.cpp
   #include "test.h"

   int main()
   {
       // This code will be built and linked successfully. The
       // compiler won't generate mangled names for func(int)
       // because its declaration is inside of an extern "C" block.
       auto x = func(20);
   }
 #+END_SRC

** One Definition Rule (ODR)
 Objects (variables, functions, templates, classes etc.) in C++ can have multiple declarations but only one definition across the project. This is called ~one definition rule~. If a program has more than one definition of a particular object, the program is ~ill-formed~ and the compiler isn't required to give any diagnostics. The linker program may give some diagnostics but it is also not guaranteed. If the same object has multiple definitions in the same source file, it is a syntax error and diagnostic is required.

 Some examples:
 #+BEGIN_SRC C++
   // test.h
   int x = 10;

   // If test.h is to be included from multiple source files, this is against the ODR because variable x will have multiple definitions.
 #+END_SRC

#+BEGIN_SRC C++
  // test.h
  void func()
  {
  }
  // If test.h is to be included from multiple source files, this is against the ODR because func() will have multiple definitions.
 #+END_SRC

 When an ~inline function~ in a ~header file~ is included from multiple source files, this isn't against the ~ODR~ and but every source file will have its own definition for that particular function.
 #+BEGIN_SRC C++
  // test.h
  static void func()
  {
  }
  // If test.h is to be included from multiple source files, this is not against the ODR because func() will be in internal linkage. Every source file will have its own func().
 #+END_SRC

 There are such objects that can have more than one definition in different source files but do not violate the ~ODR~, but their definitions must be the same ~token-by-token~. This is very important because in practice it means that the definitions of these objects can be in ~header files~.
 Definitions that can coexist in different source files without violating ODR:
  - ~class definitions~
  - ~inline function definitions~
  - ~inline variable definitions~ (C++17)
  - ~constexpr functions~
  - ~constexpr variables~
  - ~class templates~
  - ~function templates~

