notes.html
<div id="outline-container-org6b1ea2d" class="outline-3">
<h3 id="org6b1ea2d">Name Mangling</h3>
<div class="outline-text-3" id="text-org6b1ea2d">
<p>
<code>Name mangling</code> is a process used by C++ compilers to generate unique names for functions, variables, and other entities to support features like <code>function overloading</code>, <code>namespaces</code>, and <code>template instantiation</code>. Since C++ allows multiple functions with the same name (through <code>function overloading</code>), the compiler needs a way to differentiate between these functions at the binary level. <code>Name mangling</code> achieves this by encoding additional information, such as the function's <code>parameter types</code>, <code>return type</code>, and the <code>namespace</code> or <code>class</code> it belongs to, into the function's name. 
</p>

<p>
<code>Name mangling</code> can cause some problems when we call a C function from a C++ source. An example of a problem caused by <code>name mangling</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.h</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.c</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">return</span> x + <span style="color: #00bcff;">1</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">main.cpp</span>
<span style="color: #ff7f86;">   #include</span> <span style="color: #79a8ff;">"test.h"</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This code will be built successfully but will not be linked. The</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">linker program will not find func(int) because the C++ compiler</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">will produce a mangled/decorated name for func(int), but it is a</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C function. The name produced by the C compiler will not match</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">the name produced by the C++ compiler, because there is no name</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">mangling in C.</span>
       <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">x</span> = <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">20</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
To solve this kind of problems we typically use <code>extern "C"</code> declaration with <code>conditional compiling</code>. By doing this we can use the same <code>header file</code> for both C and C++.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.h</span>
<span style="color: #ff7f86;">   #ifdef</span> __cplusplus
   <span style="color: #b6a0ff;">extern</span> <span style="color: #79a8ff;">"C"</span> <span style="color: #ffffff;">{</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">open extern "C" block.</span>
<span style="color: #ff7f86;">   #endif</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;

<span style="color: #ff7f86;">   #ifdef</span> __cplusplus
   <span style="color: #ffffff;">}</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">close extern "C" block.</span>
<span style="color: #ff7f86;">   #endif</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.c</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">return</span> x + <span style="color: #00bcff;">1</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">main.cpp</span>
<span style="color: #ff7f86;">   #include</span> <span style="color: #79a8ff;">"test.h"</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This code will be built and linked successfully. The</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">compiler won't generate mangled names for func(int)</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">because its declaration is inside of an extern "C" block.</span>
       <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">x</span> = <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">20</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa343fc" class="outline-3">
<h3 id="orgfa343fc">One Definition Rule (ODR)</h3>
<div class="outline-text-3" id="text-orgfa343fc">
<p>
Objects (variables, functions, templates, classes etc.) in C++ can have multiple declarations but only one definition across the project. This is called <code>one definition rule</code>. If a program has more than one definition of a particular object, the program is <code>ill-formed</code> and the compiler isn't required to give any diagnostics. The linker program may give some diagnostics but it is also not guaranteed. If the same object has multiple definitions in the same source file, it is a syntax error and diagnostic is required.
</p>

<p>
Some examples:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.h</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If test.h is to be included from multiple source files, this is against the ODR because variable x will have multiple definitions.</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.h</span>
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
  <span style="color: #ffffff;">}</span>
  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If test.h is to be included from multiple source files, this is against the ODR because func() will have multiple definitions.</span>
</pre>
</div>

<p>
When an <code>inline function</code> in a <code>header file</code> is included from multiple source files, this isn't against the <code>ODR</code> and but every source file will have its own definition for that particular function.
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.h</span>
  <span style="color: #b6a0ff;">static</span> <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
  <span style="color: #ffffff;">}</span>
  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If test.h is to be included from multiple source files, this is not against the ODR because func() will be in internal linkage. Every source file will have its own func().</span>
</pre>
</div>

<p>
There are such objects that can have more than one definition in different source files but do not violate the <code>ODR</code>, but their definitions must be the same <code>token-by-token</code>. This is very important because in practice it means that the definitions of these objects can be in <code>header files</code>.
Definitions that can coexist in different source files without violating ODR:
</p>
<ul class="org-ul">
<li><code>class definitions</code></li>
<li><code>inline function definitions</code></li>
<li><code>inline variable definitions</code> (C++17)</li>
<li><code>constexpr functions</code></li>
<li><code>constexpr variables</code></li>
<li><code>class templates</code></li>
<li><code>function templates</code></li>
</ul>
</div>
</div>
