notes.org
** Inline functions
 Functions defined with the ~inline~ keyword are called ~inline functions~, meaning that they will not violate the ~ODR~. This means we can define ~inline functions~ in ~header files~. ~inline functions~ are not directly related with the ~inline expansion~. ~inline expansion~ is an old and effective optimization method often used by compilers. In a nutshell, this means that instead of calling a function, the compiler embeds the code for that function directly into the source code, depending on the different parameters. The main purpose of defining an ~inline function~ using the ~inline~ keyword is not to allow the compiler to do ~inline expansion~ but to avoid violating ~ODR~. Unless a special compiler flag is used, it is up to the compiler to decide whether to do ~inline expansion~ or not.

 When an ~inline function~ in a ~header file~ is included from multiple source files, this is not against the ~ODR~ and there will be only one definition from the compiler perspective even it is included in multiple source files unlike ~static~ functions.
 
 #+BEGIN_SRC C++
  // test.h
  inline void func()
  {
  }
  // If test.h is to be included from multiple source files, this is not against the ODR. There will be only one func() even it is included in multiple source files.
 #+END_SRC

** Inline variables 
 Variables defined with the ~inline~ keyword are called ~inline variables~, meaning that they will not violate the ~ODR~ similar to ~inline functions~. ~Inline variables~ were added in C++17. When an ~inline variable~ in a ~header file~ is included from multiple source files, this is not against the ~ODR~ and there will be only one definition from the compiler perspective even it is included in multiple source files.

 #+BEGIN_SRC C++
   // test.h
   inline int x = 10;
   // If test.h is to be included from multiple source files, this is not against the ODR. There will be only one x even it is included in multiple source files.
 #+END_SRC

** constexpr
*** constexpr variables
 In C++, variables defined with the ~const~ keyword can be initialized with const and non-const expressions:

 #+BEGIN_SRC C++
   int foo();

   // These are valid definitions, const objects can be initialized with const and non-const expressions.
   const int x = 10;
   const int y = foo();

   int arr1[x]; // This is valid because x is initialized with a const expression (10) which means expression created by x is also const expression.
   int arr2[y]; // This is invalid because y is initialized with a non-const expression (foo()) which means expression created by y is also non-const expression.
 #+END_SRC

 But, variables defined with the ~constexpr~ keyword has to be initialized with a constant expression:
 #+BEGIN_SRC C++
   int foo();

   constexpr int x = 10; // This is valid. 10 is constant expression.
   constexpr int y = foo(); // This is invalid. foo() is non-const expression.
 #+END_SRC

 Variables defined with the ~constexpr~ keyword has ~const~ declaration type:
 #+BEGIN_SRC C++
   constexpr int x = 10;

   x = 5; // This is invalid because x is const.
   decltype(x); // This equals to const int.

   int g{};

   constexpr int* p = &g;
   decltype(p); // This equals to int* const p;

   constexpr const int* t = &g;
   decltype(t); // This equals to const int* const t;
 #+END_SRC

