notes.html
<div id="outline-container-orgb1677a5" class="outline-3">
<h3 id="orgb1677a5">Inline functions</h3>
<div class="outline-text-3" id="text-orgb1677a5">
<p>
Functions defined with the <code>inline</code> keyword are called <code>inline functions</code>, meaning that they will not violate the <code>ODR</code>. This means we can define <code>inline functions</code> in <code>header files</code>. <code>inline functions</code> are not directly related with the <code>inline expansion</code>. <code>inline expansion</code> is an old and effective optimization method often used by compilers. In a nutshell, this means that instead of calling a function, the compiler embeds the code for that function directly into the source code, depending on the different parameters. The main purpose of defining an <code>inline function</code> using the <code>inline</code> keyword is not to allow the compiler to do <code>inline expansion</code> but to avoid violating <code>ODR</code>. Unless a special compiler flag is used, it is up to the compiler to decide whether to do <code>inline expansion</code> or not.
</p>

<p>
When an <code>inline function</code> in a <code>header file</code> is included from multiple source files, this is not against the <code>ODR</code> and there will be only one definition from the compiler perspective even it is included in multiple source files unlike <code>static</code> functions.
</p>

<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.h</span>
  <span style="color: #b6a0ff;">inline</span> <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
  <span style="color: #ffffff;">}</span>
  <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If test.h is to be included from multiple source files, this is not against the ODR. There will be only one func() even it is included in multiple source files.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3588f28" class="outline-3">
<h3 id="org3588f28">Inline variables</h3>
<div class="outline-text-3" id="text-org3588f28">
<p>
Variables defined with the <code>inline</code> keyword are called <code>inline variables</code>, meaning that they will not violate the <code>ODR</code> similar to <code>inline functions</code>. <code>Inline variables</code> were added in C++17. When an <code>inline variable</code> in a <code>header file</code> is included from multiple source files, this is not against the <code>ODR</code> and there will be only one definition from the compiler perspective even it is included in multiple source files.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.h</span>
   <span style="color: #b6a0ff;">inline</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If test.h is to be included from multiple source files, this is not against the ODR. There will be only one x even it is included in multiple source files.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2faa43b" class="outline-3">
<h3 id="org2faa43b">constexpr</h3>
<div class="outline-text-3" id="text-org2faa43b">
</div>
<div id="outline-container-org77ce377" class="outline-4">
<h4 id="org77ce377">constexpr variables</h4>
<div class="outline-text-4" id="text-org77ce377">
<p>
In C++, variables defined with the <code>const</code> keyword can be initialized with const and non-const expressions:
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These are valid definitions, const objects can be initialized with const and non-const expressions.</span>
   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;
   <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">arr1</span><span style="color: #ffffff;">[</span>x<span style="color: #ffffff;">]</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid because x is initialized with a const expression (10) which means expression created by x is also const expression.</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">arr2</span><span style="color: #ffffff;">[</span>y<span style="color: #ffffff;">]</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid because y is initialized with a non-const expression (foo()) which means expression created by y is also non-const expression.</span>
</pre>
</div>

<p>
But, variables defined with the <code>constexpr</code> keyword has to be initialized with a constant expression:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">constexpr</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid. 10 is constant expression.</span>
   <span style="color: #b6a0ff;">constexpr</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span> = <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid. foo() is non-const expression.</span>
</pre>
</div>

<p>
Variables defined with the <code>constexpr</code> keyword has <code>const</code> declaration type:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">constexpr</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

   x = <span style="color: #00bcff;">5</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid because x is const.</span>
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This equals to const int.</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">g</span><span style="color: #ffffff;">{}</span>;

   <span style="color: #b6a0ff;">constexpr</span> <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">p</span> = &amp;g;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>p<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This equals to int* const p;</span>

   <span style="color: #b6a0ff;">constexpr</span> <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span>* <span style="color: #ffffff;">t</span> = &amp;g;
   <span style="color: #feacd0;">decltype</span><span style="color: #ffffff;">(</span>t<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This equals to const int* const t;</span>
</pre>
</div>
</div>
</div>
