notes.org
*** constexpr functions
 ~constexpr~ functions are functions whose return value is obtained at compile time when certain conditions are met. If ~constexpr~ functions are called with non-const arguments, the return value will be calculated at runtime like normal functions.

 Some restrictions when defining ~constexpr~ functions:
   - Cannot define ~static~ local variables.
   - Cannot be a virtual function.
   - Return type cannot be ~void~.
   - Return type, types of all local variables and types of arguments must be ~literal type~.

 #+BEGIN_SRC C++
   constexpr int sum_square(int a, int b)
   {
       return a * a + b * b;
   }

   constexpr int ndigit(int x)
   {
       int digit_count = 0;

       if (x == 0)
	   return 1;

       while (x)
       {
	   ++digit_count;
	   x /= 10;
       }

      return digit_count;
   }

   int main()
   {
       const int a = 87234;
       const int b = 7624271;

       // These will be calculated at compile time and the generated return values are also constant expression. 
       constexpr auto x = sum_square(10, 20); 
       constexpr auto y = sum_square(ndigit(a) + ndigit(b));

       int j = 1515;

       // This is valid. j is not const and because of that ndigit(j) will be called at runtime.
       int k = ndigit(j);

       // This is invalid. j is not const and because of that ndigit(j) will be called at runtime. This means generated return value also will be non-const and constexpr variables cannot be initialized with non-const expressions.
       constexpr int l = ndigit(j);
   }
 #+END_SRC

** Classes
 The use of classes in C++ is not limited to object-oriented programming. Classes are the main tools for data abstraction also beyond object-oriented programming.

