notes.html
<div id="outline-container-org60f4ea5" class="outline-4">
<h4 id="org60f4ea5">constexpr functions</h4>
<div class="outline-text-4" id="text-org60f4ea5">
<p>
<code>constexpr</code> functions are functions whose return value is obtained at compile time when certain conditions are met. If <code>constexpr</code> functions are called with non-const arguments, the return value will be calculated at runtime like normal functions.
</p>

<p>
Some restrictions when defining <code>constexpr</code> functions:
</p>
<ul class="org-ul">
<li>Cannot define <code>static</code> local variables.</li>
<li>Cannot be a virtual function.</li>
<li>Return type cannot be <code>void</code>.</li>
<li>Return type, types of all local variables and types of arguments must be <code>literal type</code>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">constexpr</span> <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">sum_square</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">b</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">return</span> a * a + b * b;
   <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">constexpr</span> <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">ndigit</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">digit_count</span> = <span style="color: #00bcff;">0</span>;

       <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span>x == <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span>
       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">1</span>;

       <span style="color: #feacd0;">while </span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       ++digit_count;
       x /= <span style="color: #00bcff;">10</span>;
       <span style="color: #ffffff;">}</span>

      <span style="color: #b6a0ff;">return</span> digit_count;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span> = <span style="color: #00bcff;">87234</span>;
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">b</span> = <span style="color: #00bcff;">7624271</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These will be calculated at compile time and the generated return values are also constant expression. </span>
       <span style="color: #b6a0ff;">constexpr</span> <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">x</span> = <span style="color: #feacd0;">sum_square</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span>, <span style="color: #00bcff;">20</span><span style="color: #ffffff;">)</span>; 
       <span style="color: #b6a0ff;">constexpr</span> <span style="color: #b6a0ff;">auto</span> <span style="color: #ffffff;">y</span> = <span style="color: #feacd0;">sum_square</span><span style="color: #ffffff;">(</span><span style="color: #feacd0;">ndigit</span><span style="color: #ffffff;">(</span>a<span style="color: #ffffff;">)</span> + <span style="color: #feacd0;">ndigit</span><span style="color: #ffffff;">(</span>b<span style="color: #ffffff;">))</span>;

       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">j</span> = <span style="color: #00bcff;">1515</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid. j is not const and because of that ndigit(j) will be called at runtime.</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">k</span> = <span style="color: #feacd0;">ndigit</span><span style="color: #ffffff;">(</span>j<span style="color: #ffffff;">)</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid. j is not const and because of that ndigit(j) will be called at runtime. This means generated return value also will be non-const and constexpr variables cannot be initialized with non-const expressions.</span>
       <span style="color: #b6a0ff;">constexpr</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">l</span> = <span style="color: #feacd0;">ndigit</span><span style="color: #ffffff;">(</span>j<span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org561f0c2" class="outline-3">
<h3 id="org561f0c2">Classes</h3>
<div class="outline-text-3" id="text-org561f0c2">
<p>
The use of classes in C++ is not limited to object-oriented programming. Classes are the main tools for data abstraction also beyond object-oriented programming.
</p>
</div>
