notes.org
*** Class definition
 Classes are ~user-defined types~ that can have ~data members~, ~member functions~ and ~type member / member type / nested type~. They are defined/declared with the keywords ~class~ and ~struct~ (note that unlike C, ~struct~ is also a class).
 A class definition gives the compiler all the information about that class. It is also possible to declare a class without defining it. In this case, the compiler cannot get all the information about the class from the class declaration. All it knows is that the class is declared and that it must get all the necessary information about this class from the definition which can be in another source file. 

 Members of the classes can be taxonomically listed as follows:
 - ~class members~
   - ~data members~
     - ~non-static data members~
     - ~static data members~
   - ~member functions~
     - ~non-static member functions~
     - ~static member functions~
   - ~type member / member type / nested type~

 Defining and declaring classes:
 #+BEGIN_SRC C++
   // Class declaration / Forwarding declaration. In this point, C1 is incomplete class. The compiler doesn't know anything but just the name of it. 
   class C1;

   // Class types can be empty. If a class is empty, it is called empty class.
   class C2 // Class definition
   {

   };

   // In C++ when we say class we also mean struct because structs are also class type.
   // Note: Empty structs are invalid in C.
   struct C3 // Class definition
   {

   };
 #+END_SRC

 Classes can have different type of ~class members~ in the ~class scope~.
 #+BEGIN_SRC C++
   class C1 
   {
       // Data members
       // Member functions
       // Type member / Member type / Nested type
   };

  class C2
  {
      int mx; // Data member
      void f(); // Member function
      enum Pos{ ON, OFF }; // Member type
  };
 #+END_SRC

 If a class will be used also in other source files, the definition can be placed in a header file. It is not against the ODR.
 #+BEGIN_SRC C++
   // test.h
   class C1
   {
       int a, b;
       double d1, d2;
       void f();
   };

   // main.cpp
   // #include "test.h"
   int main()
   {
       C1 c1;

       return 0;
   }
 #+END_SRC

