notes.html
<div id="outline-container-orgf5b92e0" class="outline-4">
<h4 id="orgf5b92e0">Class definition</h4>
<div class="outline-text-4" id="text-orgf5b92e0">
<p>
Classes are <code>user-defined types</code> that can have <code>data members</code>, <code>member functions</code> and <code>type member / member type / nested type</code>. They are defined/declared with the keywords <code>class</code> and <code>struct</code> (note that unlike C, <code>struct</code> is also a class).
A class definition gives the compiler all the information about that class. It is also possible to declare a class without defining it. In this case, the compiler cannot get all the information about the class from the class declaration. All it knows is that the class is declared and that it must get all the necessary information about this class from the definition which can be in another source file. 
</p>

<p>
Members of the classes can be taxonomically listed as follows:
</p>
<ul class="org-ul">
<li><code>class members</code>
<ul class="org-ul">
<li><code>data members</code>
<ul class="org-ul">
<li><code>non-static data members</code></li>
<li><code>static data members</code></li>
</ul></li>
<li><code>member functions</code>
<ul class="org-ul">
<li><code>non-static member functions</code></li>
<li><code>static member functions</code></li>
</ul></li>
<li><code>type member / member type / nested type</code></li>
</ul></li>
</ul>

<p>
Defining and declaring classes:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Class declaration / Forwarding declaration. In this point, C1 is incomplete class. The compiler doesn't know anything but just the name of it. </span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Class types can be empty. If a class is empty, it is called empty class.</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C2</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Class definition</span>
   <span style="color: #ffffff;">{</span>

   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">In C++ when we say class we also mean struct because structs are also class type.</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Note: Empty structs are invalid in C.</span>
   <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">C3</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Class definition</span>
   <span style="color: #ffffff;">{</span>

   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
Classes can have different type of <code>class members</code> in the <code>class scope</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span> 
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Data members</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Member functions</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Type member / Member type / Nested type</span>
   <span style="color: #ffffff;">}</span>;

  <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C2</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Data member</span>
      <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Member function</span>
      <span style="color: #b6a0ff;">enum</span> <span style="color: #6ae4b9;">Pos</span><span style="color: #ffffff;">{</span> <span style="color: #ffffff;">ON</span>, <span style="color: #ffffff;">OFF</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Member type</span>
  <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
If a class will be used also in other source files, the definition can be placed in a header file. It is not against the ODR.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">test.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>, <span style="color: #ffffff;">b</span>;
       <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">d1</span>, <span style="color: #ffffff;">d2</span>;
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">main.cpp</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">#include "test.h"</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;

       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
