notes.org
*** Access control
 Normally, when an identifier is used, the compiler performs a name lookup to find out what object that name represents, but in C++ (also in other languages which supports OOP style programming) there is one more step after the name lookup. The compiler must check that the code trying to access an identifier has permission to access that identifier. This is called ~access control~.

 There are 3 different access categories that apply to the members of classes and determine who can and cannot access them. These 3 categories are actually also keywords and are called ~access specifiers~:
  - ~public~
    + ~public class members~ can be accessed both within the class itself and by clients using the class, meaning there is no access control for ~public class members~.
  - ~private~
    + ~private class members~ can only be accessed within the class itself and cannot be used by external codes.
  - ~protected~
    + ~protected class members~ can be accessed within the class itself and from its derived classes. 

 ~access specifiers~ can be used to define ~access rights~ for a group of ~class members~:
 #+BEGIN_SRC C++
  class C1
  {
  public: // Each class member will have public access right from here until the compiler sees another access specifier.
      int x;
      int y;
      void f1();

  private:
      int z; // Each class member will have private access right from here until the compiler sees another access specifier.
      void f2();

  protected: // Same applies here.
      int t;
  };
 #+END_SRC
 
 If a class type is defined with the ~class~ keyword, all of its ~class members~ are ~private~ by default:
 #+BEGIN_SRC C++
   class C1
   {
       // If no access specifier is used these class members are private by default.
       int x;
       void f1();

   public:
       int a, b;
   };
 #+END_SRC
 
 If a class type is defined with the ~struct~ keyword, all of its ~class members~ are ~public~ by default: 
 #+BEGIN_SRC C++
   struct C1
   {
       // If no access specifier is used these class members are public by default.
       int x;
       void f1();

   private:
       int a, b;
   };
 #+END_SRC

 Same ~access specifier~ can be used multiple times:
 #+BEGIN_SRC C++
   class C1
   {
   public:

   private:

   public:

   private:
   };
 #+END_SRC

*** Non-static data members
 ~non-static data members~ are variables that are actually held within the object of a class, that is, they are variables of the object that is created of that class. 

 When ~non-static data members~ are added to an object, the object's storage requirement will increase depending on the added members:
 #+BEGIN_SRC C++
   class C1
   {
       int x;
   };

   class C2
   {
   };

   int main()
   {
       // This will print 4 assuming int is 4 bytes.   
       std::cout << "sizeof(C1) = " << sizeof(C1) << '\n';
       // Empty classes are 1 byte.
       std::cout << "sizeof(C2) = " << sizeof(C2) << '\n';
   }
 #+END_SRC

