notes.html
<div id="outline-container-org1a46a1e" class="outline-4">
<h4 id="org1a46a1e">Access control</h4>
<div class="outline-text-4" id="text-org1a46a1e">
<p>
Normally, when an identifier is used, the compiler performs a name lookup to find out what object that name represents, but in C++ (also in other languages which supports OOP style programming) there is one more step after the name lookup. The compiler must check that the code trying to access an identifier has permission to access that identifier. This is called <code>access control</code>.
</p>

<p>
There are 3 different access categories that apply to the members of classes and determine who can and cannot access them. These 3 categories are actually also keywords and are called <code>access specifiers</code>:
</p>
<ul class="org-ul">
<li><code>public</code>
<ul class="org-ul">
<li><code>public class members</code> can be accessed both within the class itself and by clients using the class, meaning there is no access control for <code>public class members</code>.</li>
</ul></li>
<li><code>private</code>
<ul class="org-ul">
<li><code>private class members</code> can only be accessed within the class itself and cannot be used by external codes.</li>
</ul></li>
<li><code>protected</code>
<ul class="org-ul">
<li><code>protected class members</code> can be accessed within the class itself and from its derived classes.</li>
</ul></li>
</ul>

<p>
<code>access specifiers</code> can be used to define <code>access rights</code> for a group of <code>class members</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
  <span style="color: #ffffff;">{</span>
  <span style="color: #b6a0ff;">public</span>: <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Each class member will have public access right from here until the compiler sees another access specifier.</span>
      <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
      <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span>;
      <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

  <span style="color: #b6a0ff;">private</span>:
      <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Each class member will have private access right from here until the compiler sees another access specifier.</span>
      <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

  <span style="color: #b6a0ff;">protected</span>: <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Same applies here.</span>
      <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">t</span>;
  <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
If a class type is defined with the <code>class</code> keyword, all of its <code>class members</code> are <code>private</code> by default:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If no access specifier is used these class members are private by default.</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>, <span style="color: #ffffff;">b</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
If a class type is defined with the <code>struct</code> keyword, all of its <code>class members</code> are <code>public</code> by default: 
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">struct</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If no access specifier is used these class members are public by default.</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>, <span style="color: #ffffff;">b</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
Same <code>access specifier</code> can be used multiple times:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:

   <span style="color: #b6a0ff;">private</span>:

   <span style="color: #b6a0ff;">public</span>:

   <span style="color: #b6a0ff;">private</span>:
   <span style="color: #ffffff;">}</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org7ebbd02" class="outline-4">
<h4 id="org7ebbd02">Non-static data members</h4>
<div class="outline-text-4" id="text-org7ebbd02">
<p>
<code>non-static data members</code> are variables that are actually held within the object of a class, that is, they are variables of the object that is created of that class. 
</p>

<p>
When <code>non-static data members</code> are added to an object, the object's storage requirement will increase depending on the added members:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C2</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This will print 4 assuming int is 4 bytes.   </span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"sizeof(C1) = "</span> &lt;&lt; <span style="color: #feacd0;">sizeof</span><span style="color: #ffffff;">(</span>C1<span style="color: #ffffff;">)</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Empty classes are 1 byte.</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"sizeof(C2) = "</span> &lt;&lt; <span style="color: #feacd0;">sizeof</span><span style="color: #ffffff;">(</span>C2<span style="color: #ffffff;">)</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
