notes.html
<div id="outline-container-org98a13af" class="outline-4">
<h4 id="org98a13af">Non-static member functions</h4>
<div class="outline-text-4" id="text-org98a13af">
<p>
<code>non-static member functions</code> are no different from normal functions at the assembly level, they are just an abstraction that exists at the language layer. <code>non-static member functions</code> are functions defined in the <code>class definition</code>. They have an implicit <code>this</code> pointer that refers to the object on which they are called. <code>this</code> pointer allows them to access the object's <code>non-static data members</code> and other <code>non-static member functions</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Non-static member functions have implicit ~this pointer~ which is the address of the caller object. The compiler sees it like void foo(C1* this, int);</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Non-static data member</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;    

       c1.<span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">12</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is similar to foo(&amp;c1, 12);</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
There are 2 different ways to define <code>non-static member functions</code>.
</p>

<p>
A <code>non-static member function</code> can be declared in the header file and defined it in the source file. If the signatures don't match it is a syntax error:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">fighter.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Fighter</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">attack</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">Fighter</span>&amp;<span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">fighter.cpp</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">#include "fighter.h"</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #00bcff;">Fighter</span>::<span style="color: #feacd0;">attack</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">Fighter</span>&amp; <span style="color: #ffffff;">f</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>

   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
A <code>non-static member function</code> can be declared and defined directly in the <code>class definition</code>. When a <code>non-static member function</code> is defined like this, it is implicitly an <code>inline function</code>, meaning including it to multiple source file isn't against the <code>ODR</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">fighter.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Fighter</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">attack</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">Fighter</span>&amp; <span style="color: #ffffff;">f</span><span style="color: #ffffff;">)</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This equals to inline void attack(Fighter &amp;f);. Using inline explicity doesn't matter in this case.</span>
       <span style="color: #ffffff;">{</span>

       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
In this case, if the <code>inline</code> keyword is not used explicity in the declaration or definition, it is against the <code>ODR</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">fighter.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Fighter</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">attack</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">Fighter</span>&amp; <span style="color: #ffffff;">f</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is not implicitly inline function because it doesn't have definition.</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is the definition of attack function but it is also in the header file. If we include this header file</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">from multiple source file it is agains the ODR. We should use the inline keyword explicitly in the declaration or definition</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">if we want to do this.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #00bcff;">Fighter</span>::<span style="color: #feacd0;">attack</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">Fighter</span>&amp; <span style="color: #ffffff;">f</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>unqualified identifiers</code> in the definition of a <code>non-static member function</code> are searched in this order:
</p>
<ul class="org-ul">
<li><code>block scope</code></li>
<li><code>enclosing block scopes</code> (there can be multiple <code>enclosing blocks</code>)</li>
<li><code>class scope</code></li>
<li><code>namespace scope</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">class.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">3</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">4</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">class.c</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #00bcff;">C1</span>::<span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">2</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span> = <span style="color: #00bcff;">0</span>;

       <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">1</span><span style="color: #ffffff;">)</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">1</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">1 - x will be searched in this if block first. From x to beginning of if block.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">2 - x will be searched in the enclosing block (function block in this case) if it couldn't be found in 1. </span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">3 - x will be searched in the class scope if it couldn't be found in 2.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">4 - x will be searched in the namespace scope if it couldn't be found in 3.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If it couldn't be found in 4, name look-up will fail.</span>
       x;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">mx will be found in 3 (class scope). The compiler will change it to qualified identifier by using implicit ~this pointer~.</span>
       mx; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is equal to this-&gt;mx.</span>

           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">a will be found in 2 (enclosing block). This will increase the local a inside of the function block, not the a in the class scope.</span>
           a++;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
The <code>non-static data members</code> accessed in <code>non-static member functions</code> are the data members of the object they are called on:
</p>

<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Counter</span>
  <span style="color: #ffffff;">{</span>
  <span style="color: #b6a0ff;">public</span>:
      <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
      <span style="color: #ffffff;">{</span>
          <span style="color: #00bcff;">std</span>::cout &lt;&lt; m_c &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
      <span style="color: #ffffff;">}</span>
      
      <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">set</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">val</span><span style="color: #ffffff;">)</span>
      <span style="color: #ffffff;">{</span>
          m_c = val;
      <span style="color: #ffffff;">}</span>

  <span style="color: #b6a0ff;">private</span>:
      <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">m_c</span><span style="color: #ffffff;">{}</span>;
  <span style="color: #ffffff;">}</span>;

  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #6ae4b9;">Counter</span> <span style="color: #ffffff;">c1</span>;

      c1.<span style="color: #feacd0;">set</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">78</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Sets c1's m_c to 78.</span>
      c1.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Prints c1's m_c, which is 78.</span>
      c1.<span style="color: #feacd0;">set</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">99</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Sets c1's m_c to 99.</span>
      c1.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Prints 99.</span>

      <span style="color: #6ae4b9;">Counter</span> <span style="color: #ffffff;">c2</span>;
      
      c2.<span style="color: #feacd0;">set</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">3333</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Sets c2's m_c to 3333.</span>
      c2.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Prints c2's m_c, which is 3333.</span>
  <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
