notes.org
*** Class scope
 ~class members~ declared in the ~class definition~ are included in the ~class scope~.
 In which cases is a identifier searched within a ~class definition~?
  - If the identifier is the right operand of ~. operator~.
    + ~object.x~, ~x~ will be searched in the ~class scope~.
  - If the identifier is the right operand of ~-> operator~.
    + ~object->x~, ~x~ will be searched in the ~class scope~.
  - If the identifier is the right operand of ~:: operator~.
    + ~class::x~, ~x~ will be searched in the ~class scope~.

 All of the ~access specifiers~ are in the same ~class scope~. ~public~, ~private~ and ~protected~ don't create new scope, they share the same ~class scope~.
      
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void foo();
   private:
       int x;
   };

   int x = 3477;

   void C1::foo()
   {
       int x = 10;

       x = 56; // This x is defined in the block scope.

       C1::x = 20; // If we want access the x which is in the class scope. We can use qualified name. The compiler will search it only in the class scope.
       ::x = 22; // This x in the namespace scope.
   }
 #+END_SRC

 ~Member functions~ cannot be redeclared:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void foo(int);
       void foo(int); // Redeclaration is invalid, syntax error.
   };

   void foo(int);
   void foo(int); // Redeclaration is valid.
 #+END_SRC

 ~Function overloading~ and ~function overload resolution~ rules also apply to ~member functions~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // This is valid function overloading, because they are in the same class scope.
       void foo(int);
       void foo(int, int);
   };
 #+END_SRC

 ~Access specifiers~ don't effect ~function overloading~ rules because they are not related with scope:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // This is valid function overloading, because they are in the same class scope.
       void foo(int);
   private:
       void foo(int, int);
   };
 #+END_SRC

 #+BEGIN_SRC C++
   class C1
   {
   public:
       void foo(int);
   private:
       void foo(double);
   };

   int main()
   {
       C1 c;
       c.func(2.3); // After function overload resolution, foo(double) will be chosen (exact match) but access control will fail because it is a private function.
   }
 #+END_SRC

