notes.html
<div id="outline-container-org5140c92" class="outline-4">
<h4 id="org5140c92">Class scope</h4>
<div class="outline-text-4" id="text-org5140c92">
<p>
<code>class members</code> declared in the <code>class definition</code> are included in the <code>class scope</code>.
In which cases is a identifier searched within a <code>class definition</code>?
</p>
<ul class="org-ul">
<li>If the identifier is the right operand of <code>. operator</code>.
<ul class="org-ul">
<li><code>object.x</code>, <code>x</code> will be searched in the <code>class scope</code>.</li>
</ul></li>
<li>If the identifier is the right operand of <code>-&gt; operator</code>.
<ul class="org-ul">
<li><code>object-&gt;x</code>, <code>x</code> will be searched in the <code>class scope</code>.</li>
</ul></li>
<li>If the identifier is the right operand of <code>:: operator</code>.
<ul class="org-ul">
<li><code>class::x</code>, <code>x</code> will be searched in the <code>class scope</code>.</li>
</ul></li>
</ul>

<p>
All of the <code>access specifiers</code> are in the same <code>class scope</code>. <code>public</code>, <code>private</code> and <code>protected</code> don't create new scope, they share the same <code>class scope</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">3477</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #00bcff;">C1</span>::<span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span> = <span style="color: #00bcff;">10</span>;

       x = <span style="color: #00bcff;">56</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This x is defined in the block scope.</span>

       <span style="color: #00bcff;">C1</span>::x = <span style="color: #00bcff;">20</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If we want access the x which is in the class scope. We can use qualified name. The compiler will search it only in the class scope.</span>
       ::x = <span style="color: #00bcff;">22</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This x in the namespace scope.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>Member functions</code> cannot be redeclared:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Redeclaration is invalid, syntax error.</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Redeclaration is valid.</span>
</pre>
</div>

<p>
<code>Function overloading</code> and <code>function overload resolution</code> rules also apply to <code>member functions</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid function overloading, because they are in the same class scope.</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>Access specifiers</code> don't effect <code>function overloading</code> rules because they are not related with scope:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid function overloading, because they are in the same class scope.</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">double</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c</span>;
       c.<span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">2.3</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">After function overload resolution, foo(double) will be chosen (exact match) but access control will fail because it is a private function.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
