notes.org
*** this keyword
 ~this~ is a keyword that can only be used in ~non-static member functions~ of a class. ~this~ represents a pointer and often called ~this pointer~. ~this pointer~ holds the address of the object on which the function is called.

 The use of ~this~ keyword in ~global functions~ or in ~static member functions~ of classes is a syntax error:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void f1(int)
       {
           this; // This is valid.
       }
       
       static void f2(int)
       {
           this; // This is invalid.
       }
   };
 #+END_SRC

~this pointer~ holds the address of the caller object:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void foo()
       {
           std::cout << "this: " << this << '\n';
       }

       int main()
       {
           C1 c1;
           std::cout << "&c1: " << &c1 << '\n';
           c1.foo(); // The address of the c1 (&c1) and ~this pointer~ are same.

           C1 c2;
           std::cout << "&c2: " << &c2 << '\n';
           c2.foo(); // The address of the c2 (&c2) and ~this pointer~ are same.
       }
    };
 #+END_SRC

 The value category of an expression created by ~this pointer~ is ~PR-value expression~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void foo()
       {
           &this; // This is invalid. ~this~ is a PR-value expression. Only L-value expressions can be the operand of address operator.
       }
    };
 #+END_SRC

 #+BEGIN_SRC C++
   class C1
   {
   public:
       void foo()
       {
           &this; // This is invalid. ~this~ is a PR-value expression. Only L-value expressions can be the operand of address operator.
       }
    };
 #+END_SRC

 The ~non-static data members~ can be accessed from ~non-static member functions~ with or without a ~qualifier~, but it is also possible to access them via ~this pointer~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void foo()
       {
           // All of these are same.
           mx = 20; // Access with unqualified identifier.
           C1::mx = 20; // Access with qualified identifier.
           this->mx = 20; // Access through ~this pointer~.
       }

   private:
       int mx;
   };
 #+END_SRC

 There are situations where it is not possible to do what we want without using ~this pointer~. 

 It is not possible to call another function within a ~non-static member function~ for the caller object without ~this pointer~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void f1();
   };

   void f2(C1*);
   void f3(C1);
   void f4(C1&);

   int C1::f1()
   {
       // There is no way to call f2, f3 and f4 with the caller object without ~this pointer~.
       f2(this);
       f3(*this);
       f4(*this);
   }
 #+END_SRC

 It is not possible to return the caller object or the address of the caller object without ~this pointer~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1 f1()
       {
	   return *this;
       }

       C1* f2()
       {
	   return this;
       }

       C1& f3()
       {
           return *this;
       }
   };
 #+END_SRC

