notes.html
<div id="outline-container-org4feddca" class="outline-4">
<h4 id="org4feddca">this keyword</h4>
<div class="outline-text-4" id="text-org4feddca">
<p>
<code>this</code> is a keyword that can only be used in <code>non-static member functions</code> of a class. <code>this</code> represents a pointer and often called <code>this pointer</code>. <code>this pointer</code> holds the address of the object on which the function is called.
</p>

<p>
The use of <code>this</code> keyword in <code>global functions</code> or in <code>static member functions</code> of classes is a syntax error:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #b6a0ff;">this</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid.</span>
       <span style="color: #ffffff;">}</span>
       
       <span style="color: #b6a0ff;">static</span> <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #b6a0ff;">this</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid.</span>
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>this pointer</code> holds the address of the caller object:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"&amp;c1: "</span> &lt;&lt; &amp;c1 &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
           c1.<span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The address of the c1 (&amp;c1) and ~this pointer~ are same.</span>

           <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c2</span>;
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"&amp;c2: "</span> &lt;&lt; &amp;c2 &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
           c2.<span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The address of the c2 (&amp;c2) and ~this pointer~ are same.</span>
       <span style="color: #ffffff;">}</span>
    <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
The value category of an expression created by <code>this pointer</code> is <code>PR-value expression</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           &amp;<span style="color: #b6a0ff;">this</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid. ~this~ is a PR-value expression. Only L-value expressions can be the operand of address operator.</span>
       <span style="color: #ffffff;">}</span>
    <span style="color: #ffffff;">}</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           &amp;<span style="color: #b6a0ff;">this</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid. ~this~ is a PR-value expression. Only L-value expressions can be the operand of address operator.</span>
       <span style="color: #ffffff;">}</span>
    <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
The <code>non-static data members</code> can be accessed from <code>non-static member functions</code> with or without a <code>qualifier</code>, but it is also possible to access them via <code>this pointer</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">foo</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">All of these are same.</span>
           mx = <span style="color: #00bcff;">20</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Access with unqualified identifier.</span>
           <span style="color: #00bcff;">C1</span>::mx = <span style="color: #00bcff;">20</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Access with qualified identifier.</span>
           <span style="color: #b6a0ff;">this</span>-&gt;mx = <span style="color: #00bcff;">20</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Access through ~this pointer~.</span>
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
There are situations where it is not possible to do what we want without using <code>this pointer</code>. 
</p>

<p>
It is not possible to call another function within a <code>non-static member function</code> for the caller object without <code>this pointer</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>*<span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span><span style="color: #ffffff;">)</span>;
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f4</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #00bcff;">C1</span>::<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">There is no way to call f2, f3 and f4 with the caller object without ~this pointer~.</span>
       <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">this</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span>*<span style="color: #b6a0ff;">this</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">f4</span><span style="color: #ffffff;">(</span>*<span style="color: #b6a0ff;">this</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
It is not possible to return the caller object or the address of the caller object without <code>this pointer</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">C1</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">return</span> *<span style="color: #b6a0ff;">this</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">C1</span>* <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">return</span> <span style="color: #b6a0ff;">this</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #feacd0;">f3</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #b6a0ff;">return</span> *<span style="color: #b6a0ff;">this</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>
</div>
</div>
