notes.org
*** Const member functions
 ~this pointer~ is a hidden parameter that all ~non-static member functions~ have, so we cannot tell whether a function is a mutator or an accessor function. To avoid this confusion, if a function is not a mutator, we can define/declare it as ~const~ to indicate this. When a ~non-static member function~ is defined as ~const~, the hidden ~this pointer~ becomes ~const~. The ~const member functions~ basically tell us that they will not change the value/state of the object.

 There are 2 different categories for ~non-static member functions~:
  - ~const member function~
  - ~non-const member function~

 #+BEGIN_SRC C++
   class C1
   {
   public:
       // Const member function / Accessor function. This equals to void get(const C1*);
       void get() const;

       // Non-const member function / Mutator function. This equals to void get(C1*);
       void set();
   };
 #+END_SRC

 The compiler performs the same checks for ~const this pointer~ as it does for other ~const objects~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void f1() const
       {
           // This equals to this->mx = 10;
           mx = 10; // Invalid, because ~this pointer~ is const. Mutating a const object is a syntax error.
       }

   private:
       int mx;
   };
 #+END_SRC

 ~non-const member functions~ cannot be called within ~const member functions~, because there is no implicit conversion from ~const T*~ to ~T*~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void f1()
       {
           f2(); // Valid. T* can be converted to const T* implicitly.
       }

       void f2() const
       {
           // f2() takes const ~this pointer~ and tries to call f1() which takes non-const ~this pointer~, 
           // but there is no implicit cast from const T* to T*.
           f1(); // Invalid. 
       }
  };
 #+END_SRC

 ~non-const/const member functions~ can be called with ~non-const~ class objects:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void f1()
       {
       }

       void f2() const
       {
       }
  };

   int main()
   {
       C1 a;
       
       a.f1(); // Valid.
       a.f2(); // Valid.
    }
 #+END_SRC

 ~const~ class objects can only call ~const member functions~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void f1()
       {
       }

       void f2() const
       {
       }
  };

   int main()
   {
       const C1 a;

       // &a is const C1* but f1() has implicit non-const ~this pointer~ and
       // there is no implicit conversion from const T* to T*.
       a.f1(); // Invalid.
       a.f2(); // Valid.
    }
 #+END_SRC

 To define ~const member functions~, the ~const~ keyword must appear in both the declaration and the definition:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       void f1() const;
   };

   void C1::f1() const
   {
   }
 #+END_SRC

 ~non-const/const member functions~ can be used for ~function overloading~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // These are valid overloads.

       void f1()
       {
	   std::cout << "C1::f1()\n";
       }

       void f1() const
       {
	   std::cout << "C1::f1() const\n";
       }
   };

   int main()
   {
       const C1 a;
       C1 b;

       a.f1(); // C1::f1() const will be called.
       b.f1(); // C1::f1() will be called.
   }
 #+END_SRC

