notes.html
<div id="outline-container-orgb0a6a7f" class="outline-4">
<h4 id="orgb0a6a7f">Const member functions</h4>
<div class="outline-text-4" id="text-orgb0a6a7f">
<p>
<code>this pointer</code> is a hidden parameter that all <code>non-static member functions</code> have, so we cannot tell whether a function is a mutator or an accessor function. To avoid this confusion, if a function is not a mutator, we can define/declare it as <code>const</code> to indicate this. When a <code>non-static member function</code> is defined as <code>const</code>, the hidden <code>this pointer</code> becomes <code>const</code>. The <code>const member functions</code> basically tell us that they will not change the value/state of the object.
</p>

<p>
There are 2 different categories for <code>non-static member functions</code>:
</p>
<ul class="org-ul">
<li><code>const member function</code></li>
<li><code>non-const member function</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Const member function / Accessor function. This equals to void get(const C1*);</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">get</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Non-const member function / Mutator function. This equals to void get(C1*);</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">set</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
The compiler performs the same checks for <code>const this pointer</code> as it does for other <code>const objects</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This equals to this-&gt;mx = 10;</span>
           mx = <span style="color: #00bcff;">10</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid, because ~this pointer~ is const. Mutating a const object is a syntax error.</span>
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>non-const member functions</code> cannot be called within <code>const member functions</code>, because there is no implicit conversion from <code>const T*</code> to <code>T*</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid. T* can be converted to const T* implicitly.</span>
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">f2() takes const ~this pointer~ and tries to call f1() which takes non-const ~this pointer~, </span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">but there is no implicit cast from const T* to T*.</span>
           <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid. </span>
       <span style="color: #ffffff;">}</span>
  <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>non-const/const member functions</code> can be called with <code>non-const</code> class objects:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #ffffff;">}</span>
  <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">a</span>;
       
       a.<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
       a.<span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
    <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>const</code> class objects can only call <code>const member functions</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #ffffff;">}</span>
  <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">a</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">&amp;a is const C1* but f1() has implicit non-const ~this pointer~ and</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">there is no implicit conversion from const T* to T*.</span>
       a.<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
       a.<span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
    <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
To define <code>const member functions</code>, the <code>const</code> keyword must appear in both the declaration and the definition:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #00bcff;">C1</span>::<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>non-const/const member functions</code> can be used for <code>function overloading</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These are valid overloads.</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1::f1()\n"</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1::f1() const\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">a</span>;
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">b</span>;

       a.<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1::f1() const will be called.</span>
       b.<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1::f1() will be called.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
