notes.org
*** mutable keyword
 Normally, the ~const member functions~ and ~const objects~ of the class cannot change the value of the object's ~non-static data members~, but the ~non-static data members~ declared with the ~mutable~ keyword can be changed by the ~const member functions~.

 If the reason for the existence of ~const member functions~ is to prevent modification of ~non-static data members~, why do we want to allow changes by using ~mutable~ keyword? Not every ~non-static data member~ of an object has to directly represent the state of the object. For example, some ~data members~ can be used for debugging and caching purposes and have no direct effect on the ~observable state~ of the object. The ~mutable~ keyword is particularly useful in these cases.

 Assume there is a ~Date~ class with some ~non-static data members~ to represent the day, month and year. If we want to know how many times the month was accessed, we can put an additional ~data member~ to count it and increment it in the month's ~getter~, but this is not directly related to the state of the object. It is just additional data that is needed for some reason. If there was no ~mutable~ keyword, we would have to change ~getter~ to ~non-const member function~ just to have some debug information. Example:
 #+BEGIN_SRC C++
   class Date
   {
   public:
       int get_month() const
       {
           // ...
           ++m_debug_month_hit_count;
           return m_month; 
       }
   private:
       int m_day, m_month, m_year;
       // This data member is not directly related with the value/state of the object. It is just a debug information.
       // It is declared as mutable so it is allowed to be changed even from const member functions.
       mutable int m_debug_month_hit_count;
   };
 #+END_SRC
 
 ~const objects~ can also change the ~mutable~ data members:
 #+BEGIN_SRC C++
   class Date
   {
   public:
       int get_month() const
       {
           return m_month; 
       }

   private:
       int m_day, m_month, m_year;

   public:   
       mutable int m_debug_cache_value;
  };

   int main()
   {
       const Date date{};
       date.m_debug_cache_value = 365;
   }
 #+END_SRC

*** Constructor and destructor of classes
 The ~constructor~ and ~destructor~ are in the category of ~non-static member functions~. The instantiation of a class object is performed by the ~constructor~ of the class, while the end of life of the object is performed by the ~destructor~ of the class.

 There is a special type of ~constructor~ called ~default constructor~ which will be discussed in ~special member functions~. In short, a ~constructor~ that can be called without taking any parameters is called a ~default constructor~.

