notes.html
<div id="outline-container-orgcca7afb" class="outline-4">
<h4 id="orgcca7afb">mutable keyword</h4>
<div class="outline-text-4" id="text-orgcca7afb">
<p>
Normally, the <code>const member functions</code> and <code>const objects</code> of the class cannot change the value of the object's <code>non-static data members</code>, but the <code>non-static data members</code> declared with the <code>mutable</code> keyword can be changed by the <code>const member functions</code>.
</p>

<p>
If the reason for the existence of <code>const member functions</code> is to prevent modification of <code>non-static data members</code>, why do we want to allow changes by using <code>mutable</code> keyword? Not every <code>non-static data member</code> of an object has to directly represent the state of the object. For example, some <code>data members</code> can be used for debugging and caching purposes and have no direct effect on the <code>observable state</code> of the object. The <code>mutable</code> keyword is particularly useful in these cases.
</p>

<p>
Assume there is a <code>Date</code> class with some <code>non-static data members</code> to represent the day, month and year. If we want to know how many times the month was accessed, we can put an additional <code>data member</code> to count it and increment it in the month's <code>getter</code>, but this is not directly related to the state of the object. It is just additional data that is needed for some reason. If there was no <code>mutable</code> keyword, we would have to change <code>getter</code> to <code>non-const member function</code> just to have some debug information. Example:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Date</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">get_month</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">...</span>
           ++m_debug_month_hit_count;
           <span style="color: #b6a0ff;">return</span> m_month; 
       <span style="color: #ffffff;">}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">m_day</span>, <span style="color: #ffffff;">m_month</span>, <span style="color: #ffffff;">m_year</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This data member is not directly related with the value/state of the object. It is just a debug information.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">It is declared as mutable so it is allowed to be changed even from const member functions.</span>
       <span style="color: #b6a0ff;">mutable</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">m_debug_month_hit_count</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>const objects</code> can also change the <code>mutable</code> data members:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Date</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">get_month</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #b6a0ff;">return</span> m_month; 
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">m_day</span>, <span style="color: #ffffff;">m_month</span>, <span style="color: #ffffff;">m_year</span>;

   <span style="color: #b6a0ff;">public</span>:   
       <span style="color: #b6a0ff;">mutable</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">m_debug_cache_value</span>;
  <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">Date</span> <span style="color: #ffffff;">date</span><span style="color: #ffffff;">{}</span>;
       date.m_debug_cache_value = <span style="color: #00bcff;">365</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org876ba8b" class="outline-4">
<h4 id="org876ba8b">Constructor and destructor of classes</h4>
<div class="outline-text-4" id="text-org876ba8b">
<p>
The <code>constructor</code> and <code>destructor</code> are in the category of <code>non-static member functions</code>. The instantiation of a class object is performed by the <code>constructor</code> of the class, while the end of life of the object is performed by the <code>destructor</code> of the class.
</p>

<p>
There is a special type of <code>constructor</code> called <code>default constructor</code> which will be discussed in <code>special member functions</code>. In short, a <code>constructor</code> that can be called without taking any parameters is called a <code>default constructor</code>.
</p>
</div>
<ul class="org-ul">
