notes.org
**** Constructor
 If any class object, regardless of its type, is alive, it was brought to life by a ~constructor~. There is no exception to this rule in C++. Every object is instantiated by a call to a ~constructor~ function. After the ~constructor~ is called, the class object becomes available, which means that the memory space allocated for that class object is no longer a pile of garbage, but is now filled with values that can be used by the class. This typically means initializing the ~non-static data members~ of the class.

 ~Constructor~:
 - is ~non-static member function~ (not allowed to be ~static~). 
 - is ~non-const member functions~ (not allowed to be ~const~). 
 - has ~this pointer~.
 - cannot be ~global function~.
 - must have the same name with the class.
 - doesn't have concept of a return value.
 - can be ~overloaded~.
 - can be ~public~, ~private~ and ~protected~.  
 - cannot be called by objects using ~.~ and ~->~ operators.
 - is a ~special member function~ if it is the ~default constructor~.

 Declaration of a ~constructor~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1(); // Has to have the same name with the class.
   };
 #+END_SRC

 A class can have multiple ~constructors~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // These are valid function overloads.
       C1();
       C1(int);
   };
 #+END_SRC

 ~Constructors~ cannot be ~static~ or ~const~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       static C1(); // Invalid.
       C1(int) const; // Invalid.
   };
 #+END_SRC

 ~Constructors~ don't have to be ~public~ they can also be ~private~ or ~protected~:
 #+BEGIN_SRC C++
   class C1
   {
   // This is valid, but when we try to create an instance of the class,
   // access control will fail and we will get a syntax error.
   private:
       C1();
       C1(int);
       C1(int);
   };
 #+END_SRC

 Definition and declaration of a ~constructor~ can be in ~class definition~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           // These are valid.
           mx = 10;
           this->mx = 10;
           C1::mx = 10;
       }
   private:
       int mx, my;
   };
 #+END_SRC

 Definition and declaration of a ~constructor~ can also be separate:
 #+BEGIN_SRC C++
   // c1.h
   class C1
   {
   public:
       C1(int);

   private:
       int mx, my;
   };
  
   // c1.cpp
   // #include "c1.h"
   C1::C1(int x)
   {
       mx = x;
       this->mx = x;
       C1::mx = x;
   }
 #+END_SRC

 ~Constructors~ can't be called by objects using ~.~ and ~->~ operators:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1();
   };

   int main()
   {
       C1 c1;

       c1.C1(); // This is invalid.
   }
 #+END_SRC

