notes.html
<li><a id="org70d33f1"></a>Constructor<br />
<div class="outline-text-5" id="text-org70d33f1">
<p>
If any class object, regardless of its type, is alive, it was brought to life by a <code>constructor</code>. There is no exception to this rule in C++. Every object is instantiated by a call to a <code>constructor</code> function. After the <code>constructor</code> is called, the class object becomes available, which means that the memory space allocated for that class object is no longer a pile of garbage, but is now filled with values that can be used by the class. This typically means initializing the <code>non-static data members</code> of the class.
</p>

<p>
<code>Constructor</code>:
</p>
<ul class="org-ul">
<li>is <code>non-static member function</code> (not allowed to be <code>static</code>).</li>
<li>is <code>non-const member functions</code> (not allowed to be <code>const</code>).</li>
<li>has <code>this pointer</code>.</li>
<li>cannot be <code>global function</code>.</li>
<li>must have the same name with the class.</li>
<li>doesn't have concept of a return value.</li>
<li>can be <code>overloaded</code>.</li>
<li>can be <code>public</code>, <code>private</code> and <code>protected</code>.</li>
<li>cannot be called by objects using <code>.</code> and <code>-&gt;</code> operators.</li>
<li>is a <code>special member function</code> if it is the <code>default constructor</code>.</li>
</ul>

<p>
Declaration of a <code>constructor</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Has to have the same name with the class.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
A class can have multiple <code>constructors</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These are valid function overloads.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>Constructors</code> cannot be <code>static</code> or <code>const</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #b6a0ff;">static</span> <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>Constructors</code> don't have to be <code>public</code> they can also be <code>private</code> or <code>protected</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid, but when we try to create an instance of the class,</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">access control will fail and we will get a syntax error.</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
Definition and declaration of a <code>constructor</code> can be in <code>class definition</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These are valid.</span>
           mx = <span style="color: #00bcff;">10</span>;
           <span style="color: #b6a0ff;">this</span>-&gt;mx = <span style="color: #00bcff;">10</span>;
           <span style="color: #00bcff;">C1</span>::mx = <span style="color: #00bcff;">10</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
Definition and declaration of a <code>constructor</code> can also be separate:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
   <span style="color: #ffffff;">}</span>;
  
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1.cpp</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">#include "c1.h"</span>
   <span style="color: #00bcff;">C1</span>::<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       mx = x;
       <span style="color: #b6a0ff;">this</span>-&gt;mx = x;
       <span style="color: #00bcff;">C1</span>::mx = x;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>Constructors</code> can't be called by objects using <code>.</code> and <code>-&gt;</code> operators:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;

       c1.<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
