notes.org
**** Destructor
 Every class object that is instantiated has a lifespan/lifetime, and its lifetime will end at some point in the program's runtime. End-of-life class objects are deleted with a call to a ~destructor~ function. There is also no exception to this rule in C++. After the call to the ~destructor~, the object's life is completely over and all memory allocated for the object is freed.

 ~Destructor~:
 - is ~non-static member functions~ (not allowed to be ~static~). 
 - is ~non-const member functions~ (not allowed to be ~const~). 
 - has ~this pointer~.
 - cannot be ~global function~.
 - must have the same name with the class and have the prefix ~~~.
 - don't have concept of a return value.
 - cannot have parameters, so it cannot be ~overloaded~.
 - can be ~public~, ~private~ and ~protected~.  
 - can be called manually by objects using ~.~ and ~->~ operators.
 - is a ~special member function~.

 Declaration of a ~destructor~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       ~C1(); // Has to have the same name with the class prefixed by ~.
   };
 #+END_SRC
  
 A class cannot have multiple ~destructors~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       ~C1(); // Valid.
        // Invalid. Destructors cannot have parameters and cannot be overloaded.
       // This means there is no way to have more than one destructor.
       ~C1(int);
   };
 #+END_SRC

~Destructor~ cannot be ~static~ or ~const~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       static ~C1(); // Invalid.
   };

   class C2
   {
   public:
       ~C2() const; // Invalid.
   };
 #+END_SRC

 ~Destructor~ can be ~public~, ~private~ and ~protected~:
 #+BEGIN_SRC C++
   class C1
   {
   // This is valid, but access control will fail
   // when destructor is called and we will get a syntax error.
   private:
       ~C1();
   };
 #+END_SRC

Definition and declaration of a ~destructor~ can be in ~class definition~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       ~C1()
       {
           // These are valid.
           mx = 0;
           this->mx = 0;
           C1::mx = 0;
       }
   private:
       int mx, my;
   };
 #+END_SRC

 Definition and declaration of a ~destructor~ can also be separate:
 #+BEGIN_SRC C++
   // c1.h
   class C1
   {
   public:
       ~C1();

   private:
       int mx, my;
   };
  
   // c1.cpp
   // #include "c1.h"
   C1::~C1()
   {
       mx = 0;
       this->mx = 0;
       C1::mx = 0;
   }
 #+END_SRC

 ~Destructor~ can be called manually by objects using ~.~ and ~->~ operators:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1();
   };

   int main()
   {
       C1 c1;

       // This is valid, but the cases where this is needed are very rare.
       // There is almost only one case and it is about ~placement new~ operator.
       c1.~C1(); 
   }
 #+END_SRC

