notes.html
<li><a id="org67dff53"></a>Destructor<br />
<div class="outline-text-5" id="text-org67dff53">
<p>
Every class object that is instantiated has a lifespan/lifetime, and its lifetime will end at some point in the program's runtime. End-of-life class objects are deleted with a call to a <code>destructor</code> function. There is also no exception to this rule in C++. After the call to the <code>destructor</code>, the object's life is completely over and all memory allocated for the object is freed.
</p>

<p>
<code>Destructor</code>:
</p>
<ul class="org-ul">
<li>is <code>non-static member functions</code> (not allowed to be <code>static</code>).</li>
<li>is <code>non-const member functions</code> (not allowed to be <code>const</code>).</li>
<li>has <code>this pointer</code>.</li>
<li>cannot be <code>global function</code>.</li>
<li>must have the same name with the class and have the prefix <code>~</code>.</li>
<li>don't have concept of a return value.</li>
<li>cannot have parameters, so it cannot be <code>overloaded</code>.</li>
<li>can be <code>public</code>, <code>private</code> and <code>protected</code>.</li>
<li>can be called manually by objects using <code>.</code> and <code>-&gt;</code> operators.</li>
<li>is a <code>special member function</code>.</li>
</ul>

<p>
Declaration of a <code>destructor</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Has to have the same name with the class prefixed by ~.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
A class cannot have multiple <code>destructors</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
        <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid. Destructors cannot have parameters and cannot be overloaded.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This means there is no way to have more than one destructor.</span>
       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>Destructor</code> cannot be <code>static</code> or <code>const</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #b6a0ff;">static</span> ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C2</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       ~<span style="color: #feacd0;">C2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>Destructor</code> can be <code>public</code>, <code>private</code> and <code>protected</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid, but access control will fail</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">when destructor is called and we will get a syntax error.</span>
   <span style="color: #b6a0ff;">private</span>:
       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
Definition and declaration of a <code>destructor</code> can be in <code>class definition</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These are valid.</span>
           mx = <span style="color: #00bcff;">0</span>;
           <span style="color: #b6a0ff;">this</span>-&gt;mx = <span style="color: #00bcff;">0</span>;
           <span style="color: #00bcff;">C1</span>::mx = <span style="color: #00bcff;">0</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
Definition and declaration of a <code>destructor</code> can also be separate:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
   <span style="color: #ffffff;">}</span>;
  
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1.cpp</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">#include "c1.h"</span>
   <span style="color: #00bcff;">C1</span>::~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       mx = <span style="color: #00bcff;">0</span>;
       <span style="color: #b6a0ff;">this</span>-&gt;mx = <span style="color: #00bcff;">0</span>;
       <span style="color: #00bcff;">C1</span>::mx = <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>Destructor</code> can be called manually by objects using <code>.</code> and <code>-&gt;</code> operators:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid, but the cases where this is needed are very rare.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">There is almost only one case and it is about ~placement new~ operator.</span>
       c1.~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; 
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
