notes.org
**** When are the constructor and the destructor called?
 For a ~global class object~:
 - The ~constructor~ is called before the ~main~ function.
 - The ~destructor~ is called after the ~main~ function.

 If there is more than one ~global class object~, the calling order of its ~constructors~ must be the same as the order of object declarations, and the order in which their ~destructors~ are called must be the reverse order of the order in which ~contructors~ are called. This is only valid in the same source file. The order of instantiation of ~global class objects~ defined in different source files is not specified. The term used for this situation is ~static initilization fiasco~.

 Example for a ~global class object~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor this: " << this << '\n';
       }

       ~C1()
       {
           std::cout << "C1 destructor this: " << this << '\n';
       }
   };

   C1 c1;

   int main()
   {
       std::cout << "main begins\n";
       std::cout << "&c1: " << &c1 << '\n';
       std::cout << "main ends\n";
   }

   /*
       Output: 
       C1 default constructor this: <c1 address>
       main begins
       &c1: <c1 address>
       main ends
       C1 destructor this: <c1 address>
   */
 #+END_SRC

 Example for multiple ~global class object~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor this: " << this << '\n';
       }

       ~C1()
       {
           std::cout << "C1 destructor this: " << this << '\n';
       }
   };

   C1 c1a;
   C1 c1b;

   int main()
   {
       std::cout << "main begins\n";
       std::cout << "main ends\n";
   }

   /*
       Output: 
       C1 default constructor this: <c1a address>
       C1 default constructor this: <c1b address>
       main begins
       main ends
       C1 destructor this: <c1b address>
       C1 destructor this: <c1a address>
   */
 #+END_SRC

 Example for multiple ~global class object~ in different source files:
 #+BEGIN_SRC C++
   // c1.h
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor this: " << this << '\n';
       }

       ~C1()
       {
           std::cout << "C1 destructor this: " << this << '\n';
       }
   };

   // main.cpp
   C1 c1;

   // a.cpp
   C1 c1a;

   // b.cpp
   C1 c1b;

   // In this case, we cannot say anything about initilization order.
   // There is no way to know in which order objects will be created.
 #+END_SRC
 
For a ~static local class object~:
 - The ~constructor~ is called the first time when the function containing the object is called.
 - The ~destructor~ is called after the ~main~ function.

 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
	   std::cout << "C1 default constructor this: " << this << '\n';
       }

       ~C1()
       {
	   std::cout << "C1 destructor this: " << this << '\n';
       }
   };

   int f1()
   {
       std::cout << "f1() is called\n";
       // When the program reaches this point, the constructor will be called,
       // and this is the first call to f1(). If f1() gets called more than once,
       // the constructor will not be called again because the object has alreay been created and
       // is still alive (because it has static lifetime).
       static C1 c1;
   }

   int main()
   {
       std::cout << "main begins\n";
       f1();
       f1();
       f1();
       std::cout << "main ends\n";
   }

   /*
       Output: 
       main begins
       f1() is called
       C1 default constructor this: <c1 address>
       f1() is called
       f1() is called
       main ends
       C1 destructor this: <c1 address>
   ,*/
 #+END_SRC

For a ~local/automatic class object~:
 - The ~constructor~ is called when the the program reaches the point where the object is created.
 - The ~destructor~ is called when the scope defining the lifetime of the object ends.

 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor\n";
       }

       ~C1()
       {
           std::cout << "C1 destructor\n";
       }
   };

   int main()
   {
       std::cout << "main begins\n";

       if (1)
       {
           C1 c1; // The constructor will be called when program reaches this point. c1 is alive after this point.

           std::cout << "main continues\n";

           // The destructor will be called here at the end of scope which c1 object is in.
       }
       std::cout << "main continues\n";

       std::cout << "main ends\n";
   }

   /*
       Output: 
       main begins
       C1 default constructor
       main continues
       C1 destructor
       main continues
       main ends
   */
 #+END_SRC

 Unlike ~static local class objects~, ~local/automatic class objects~ are recreated each time the program enters the ~block/scope~ they are in:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor\n";
       }

       ~C1()
       {
           std::cout << "C1 destructor\n";
       }
   };

   int main()
   {
       std::cout << "main begins\n";

       for (int i = 0; i < 3; ++i)
       {
           C1 c1; // In each iteration, the constructor is called and c1 gets created.

           // Each time the scope of the for-loop ends, the destructor is called, and c1 gets destroyed.
       }

       std::cout << "main ends\n";
   }

   /*
       Output: 
       main begins
       C1 default constructor
       C1 destructor
       C1 default constructor
       C1 destructor
       C1 default constructor
       C1 destructor
       main ends
   */
 #+END_SRC

 For a ~dynamic class objects~:
 - The ~constructor~ is called when one of the ~new expressions/operators~ is used.
 - The ~destructor~ is called when one of the ~delete expressions/operators~ is used.

# TODO: Probably we need to put this explanations under a seperate title?
 The ~new expressions~ and ~delete expressions~ are not equivalents of ~malloc~ and ~free~. The ~malloc~ and ~free~ functions are used to allocate and deallocate a memory space. The ~new expressions~ and ~delete expressions~ are used to create and destroy ~class objects~ with ~dynamic lifetime~. 

 When a ~new expression~ is used (in order):
  - The function ~void* operator new(std::size_t)~ is called. The ~operator new~ function allocates a memory space (possibly using ~malloc~) for the object. It returns this address if the allocation succeeds, or throws an ~exception~ of type ~std:bad_alloc~ if it fails.
  - The address returned from ~operator new~ function is then ~casted~ from ~void*~ to the address of the ~class type~ and the ~constructor~ of the class is called for that address.
  - The allocated address is returned to the caller.

 When a ~delete expression~ is used (in order):
  - The ~destructor~ of the class is called for the object.
  - The function ~void operator delete(void*)~ is called with the address of the object (which is allocated by ~operator new~ function). The ~operator delete~ function deallocates the memory space (possibly using ~free~).

 The ~operator new~ and ~operator delete~ functions are part of the C++ standard library.

 What ~new expressions~ and ~delete expressions~ do:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1();
   };

   int main()
   {
       //  Memory is allocated for the object.
       // C1* address_obj = (C1*)operator new(sizeof(C1));
       // The constructor is called with the allocated address of the object.
       // Normally, we cannot call the constructor manually but the compiler can do it.
       // address_obj->constructor(); 
       // The allocated address is returned to the caller.
       // c1 = address_obj;
       C1* c1 = new C1;

       // The destructor is called for the object.
       // c1->~C1();
       // The operator delete function is called with the allocated address of the object.
       // operator delete(c1);
       delete c1;
   }
 #+END_SRC

 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor this: " << this << '\n';
       }

       ~C1()
       {
           std::cout << "C1 destructor this: " << this << '\n';
       }

       void f1()
       {
           std::cout << "f1() is called\n";
       }
   };

   int main()
   {
       std::cout << "main begins\n";
      
       C1* c1 = new C1;
       
       c1->f1();

       delete c1;
      
       std::cout << "main ends\n";
   }

   /*
       Output: 
       main begins
       C1 default constructor this: <c1 address>
       f1() is called
       C1 destructor this: <c1 address>
       main ends
   */
 #+END_SRC

 The ~pointer~ and ~reference~ types do not cause the constructor and destructor to be called:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor\n";
       }

       ~C1()
       {
           std::cout << "C1 destructor\n";
       }
   };

   int main()
   {
       // The constructor will be only called when c1 gets created in the first line.
       C1 c1;
       // c1p and c1p are just pointer/reference types, they don't directly represent the class.
       // No constructor/destructor will be called for c1p and c1r.
       C1* c1p = &c1; 
       C1& c1r = c1;

      // The destructor for c1 will be called here. Nothing will happen for c1p and c1r.
   }
 #+END_SRC

 For arrays of ~class objects~, the ~constructor~ and ~destructor~ are called separately for each ~class object:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor this: " << this << '\n';
       }

       ~C1()
       {
           std::cout << "C1 destructor this: " << this << '\n';
       }

   private:
       char m_buf[16]{};
   };

   int main()
   {
       C1 c1[5];
   }

   /*
       Output: 
       C1 default constructor this: <c1 address>
       C1 default constructor this: <c1 address + 16>
       C1 default constructor this: <c1 address + 32>
       C1 default constructor this: <c1 address + 48>
       C1 default constructor this: <c1 address + 64>
       C1 destructor this: <c1 address + 64>
       C1 destructor this: <c1 address + 48>
       C1 destructor this: <c1 address + 32>
       C1 destructor this: <c1 address + 16>
       C1 destructor this: <c1 address>
   */
 #+END_SRC

