notes.html
<li><a id="org0d2ebd4"></a>When are the constructor and the destructor called?<br />
<div class="outline-text-5" id="text-org0d2ebd4">
<p>
For a <code>global class object</code>:
</p>
<ul class="org-ul">
<li>The <code>constructor</code> is called before the <code>main</code> function.</li>
<li>The <code>destructor</code> is called after the <code>main</code> function.</li>
</ul>

<p>
If there is more than one <code>global class object</code>, the calling order of its <code>constructors</code> must be the same as the order of object declarations, and the order in which their <code>destructors</code> are called must be the reverse order of the order in which <code>contructors</code> are called. This is only valid in the same source file. The order of instantiation of <code>global class objects</code> defined in different source files is not specified. The term used for this situation is <code>static initilization fiasco</code>.
</p>

<p>
Example for a <code>global class object</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main begins\n"</span>;
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"&amp;c1: "</span> &lt;&lt; &amp;c1 &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main ends\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">       Output: </span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">       main begins</span>
<span style="color: #989898; font-style: italic;">       &amp;c1: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">       main ends</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">   */</span>
</pre>
</div>

<p>
Example for multiple <code>global class object</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1a</span>;
   <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1b</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main begins\n"</span>;
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main ends\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">       Output: </span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1a address&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1b address&gt;</span>
<span style="color: #989898; font-style: italic;">       main begins</span>
<span style="color: #989898; font-style: italic;">       main ends</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1b address&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1a address&gt;</span>
<span style="color: #989898; font-style: italic;">   */</span>
</pre>
</div>

<p>
Example for multiple <code>global class object</code> in different source files:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">main.cpp</span>
   <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">a.cpp</span>
   <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1a</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">b.cpp</span>
   <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1b</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">In this case, we cannot say anything about initilization order.</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">There is no way to know in which order objects will be created.</span>
</pre>
</div>

<p>
For a <code>static local class object</code>:
</p>
<ul class="org-ul">
<li>The <code>constructor</code> is called the first time when the function containing the object is called.</li>
<li>The <code>destructor</code> is called after the <code>main</code> function.</li>
</ul>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"f1() is called\n"</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">When the program reaches this point, the constructor will be called,</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">and this is the first call to f1(). If f1() gets called more than once,</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">the constructor will not be called again because the object has alreay been created and</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">is still alive (because it has static lifetime).</span>
       <span style="color: #b6a0ff;">static</span> <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main begins\n"</span>;
       <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main ends\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">       Output: </span>
<span style="color: #989898; font-style: italic;">       main begins</span>
<span style="color: #989898; font-style: italic;">       f1() is called</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">       f1() is called</span>
<span style="color: #989898; font-style: italic;">       f1() is called</span>
<span style="color: #989898; font-style: italic;">       main ends</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">   */</span>
</pre>
</div>

<p>
For a <code>local/automatic class object</code>:
</p>
<ul class="org-ul">
<li>The <code>constructor</code> is called when the the program reaches the point where the object is created.</li>
<li>The <code>destructor</code> is called when the scope defining the lifetime of the object ends.</li>
</ul>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor\n"</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main begins\n"</span>;

       <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">1</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The constructor will be called when program reaches this point. c1 is alive after this point.</span>

           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main continues\n"</span>;

           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The destructor will be called here at the end of scope which c1 object is in.</span>
       <span style="color: #ffffff;">}</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main continues\n"</span>;

       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main ends\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">       Output: </span>
<span style="color: #989898; font-style: italic;">       main begins</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor</span>
<span style="color: #989898; font-style: italic;">       main continues</span>
<span style="color: #989898; font-style: italic;">       C1 destructor</span>
<span style="color: #989898; font-style: italic;">       main continues</span>
<span style="color: #989898; font-style: italic;">       main ends</span>
<span style="color: #989898; font-style: italic;">   */</span>
</pre>
</div>

<p>
Unlike <code>static local class objects</code>, <code>local/automatic class objects</code> are recreated each time the program enters the <code>block/scope</code> they are in:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor\n"</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main begins\n"</span>;

       <span style="color: #feacd0;">for </span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">i</span> = <span style="color: #00bcff;">0</span>; i &lt; <span style="color: #00bcff;">3</span>; ++i<span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">In each iteration, the constructor is called and c1 gets created.</span>

           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Each time the scope of the for-loop ends, the destructor is called, and c1 gets destroyed.</span>
       <span style="color: #ffffff;">}</span>

       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main ends\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">       Output: </span>
<span style="color: #989898; font-style: italic;">       main begins</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor</span>
<span style="color: #989898; font-style: italic;">       C1 destructor</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor</span>
<span style="color: #989898; font-style: italic;">       C1 destructor</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor</span>
<span style="color: #989898; font-style: italic;">       C1 destructor</span>
<span style="color: #989898; font-style: italic;">       main ends</span>
<span style="color: #989898; font-style: italic;">   */</span>
</pre>
</div>

<p>
For a <code>dynamic class objects</code>:
</p>
<ul class="org-ul">
<li>The <code>constructor</code> is called when one of the <code>new expressions/operators</code> is used.</li>
<li>The <code>destructor</code> is called when one of the <code>delete expressions/operators</code> is used.</li>
</ul>

<p>
The <code>new expressions</code> and <code>delete expressions</code> are not equivalents of <code>malloc</code> and <code>free</code>. The <code>malloc</code> and <code>free</code> functions are used to allocate and deallocate a memory space. The <code>new expressions</code> and <code>delete expressions</code> are used to create and destroy <code>class objects</code> with <code>dynamic lifetime</code>. 
</p>

<p>
When a <code>new expression</code> is used (in order):
</p>
<ul class="org-ul">
<li>The function <code>void* operator new(std::size_t)</code> is called. The <code>operator new</code> function allocates a memory space (possibly using <code>malloc</code>) for the object. It returns this address if the allocation succeeds, or throws an <code>exception</code> of type <code>std:bad_alloc</code> if it fails.</li>
<li>The address returned from <code>operator new</code> function is then <code>casted</code> from <code>void*</code> to the address of the <code>class type</code> and the <code>constructor</code> of the class is called for that address.</li>
<li>The allocated address is returned to the caller.</li>
</ul>

<p>
When a <code>delete expression</code> is used (in order):
</p>
<ul class="org-ul">
<li>The <code>destructor</code> of the class is called for the object.</li>
<li>The function <code>void operator delete(void*)</code> is called with the address of the object (which is allocated by <code>operator new</code> function). The <code>operator delete</code> function deallocates the memory space (possibly using <code>free</code>).</li>
</ul>

<p>
The <code>operator new</code> and <code>operator delete</code> functions are part of the C++ standard library.
</p>

<p>
What <code>new expressions</code> and <code>delete expressions</code> do:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">//  </span><span style="color: #989898; font-style: italic;">Memory is allocated for the object.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1* address_obj = (C1*)operator new(sizeof(C1));</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The constructor is called with the allocated address of the object.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Normally, we cannot call the constructor manually but the compiler can do it.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">address_obj-&gt;constructor(); </span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The allocated address is returned to the caller.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1 = address_obj;</span>
       <span style="color: #6ae4b9;">C1</span>* <span style="color: #ffffff;">c1</span> = <span style="color: #b6a0ff;">new</span> <span style="color: #6ae4b9;">C1</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The destructor is called for the object.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1-&gt;~C1();</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The operator delete function is called with the allocated address of the object.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">operator delete(c1);</span>
       <span style="color: #b6a0ff;">delete</span> c1;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"f1() is called\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main begins\n"</span>;
      
       <span style="color: #6ae4b9;">C1</span>* <span style="color: #ffffff;">c1</span> = <span style="color: #b6a0ff;">new</span> <span style="color: #6ae4b9;">C1</span>;
       
       c1-&gt;<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

       <span style="color: #b6a0ff;">delete</span> c1;
      
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main ends\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">       Output: </span>
<span style="color: #989898; font-style: italic;">       main begins</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">       f1() is called</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">       main ends</span>
<span style="color: #989898; font-style: italic;">   */</span>
</pre>
</div>

<p>
The <code>pointer</code> and <code>reference</code> types do not cause the constructor and destructor to be called:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor\n"</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The constructor will be only called when c1 gets created in the first line.</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1p and c1p are just pointer/reference types, they don't directly represent the class.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">No constructor/destructor will be called for c1p and c1r.</span>
       <span style="color: #6ae4b9;">C1</span>* <span style="color: #ffffff;">c1p</span> = &amp;c1; 
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #ffffff;">c1r</span> = c1;

      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The destructor for c1 will be called here. Nothing will happen for c1p and c1r.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
For arrays of <code>class objects</code>, the <code>constructor</code> and <code>destructor</code> are called separately for each ~class object:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">char</span> <span style="color: #ffffff;">m_buf</span><span style="color: #ffffff;">[</span><span style="color: #00bcff;">16</span><span style="color: #ffffff;">]{}</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span><span style="color: #ffffff;">[</span><span style="color: #00bcff;">5</span><span style="color: #ffffff;">]</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">       Output: </span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1 address + 16&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1 address + 32&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1 address + 48&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 default constructor this: &lt;c1 address + 64&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1 address + 64&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1 address + 48&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1 address + 32&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1 address + 16&gt;</span>
<span style="color: #989898; font-style: italic;">       C1 destructor this: &lt;c1 address&gt;</span>
<span style="color: #989898; font-style: italic;">   */</span>
</pre>
</div>
</div>
</li>
