notes.org
**** When the default constructor is called?
 Normally, ~default initialized~ objects are created with ~garbage value~, but ~default initialized~ class objects are created with a call to the ~default constructor~. The ~non-static data members~ of the class can still have garbage value if they are not initialized in the ~default constructor~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor\n";
       }

   private:
       int mx;
   };

   int main()
   {
       int x; // x is default initialized and have garbage value.
       C1 c1; // c1 is default initialized and the default constructor is called.

       c1.mx; // c1.mx still has a garbage value because it is not initialized in the default constructor.
   }
 #+END_SRC

 ~value initialized~ class objects are created with a call to the ~default constructor~. The ~non-static data members~ of the class will be also ~zero initialized~ before the ~default constructor~ is called. This means built-in types like ~int~ will be set to ~0~, and pointers will be set to ~nullptr~.
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor\n";
       }

   private:
       int mx;
  };

   int main()
   {
       int x{}; // x is value initialized and set to 0. 
       C1 c1{}; // c1 is value initialized.

       c1.mx // c1.mx is also value initialized before the default constructor is called, meaning it is zero initialized.
   }
 #+END_SRC

 ~direct initialization~ without providing a value is not possible because of ~most vexing parse~. The compiler might give a warning:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
           std::cout << "C1 default constructor\n";
       }
   };

   int main()
   {
       int x(5); // x is direct initialized and set to 5.
       // Valid but doesn't mean direct initilization.
       // Because of the most vexing parse, the compiler understand this as a function declaration.
       int x();
       // It is same for the class objects. Valid but doesn't mean direct initilization.
       // Because of the most vexing parse, the compiler understand this as a function declaration.
       // The default constructor is not called because there is no object instantiation here.
       C1 c1();
   }
 #+END_SRC

 The ~default constructor~ is also called when the elements of an array are ~class objects~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1()
       {
	   std::cout << "C1 default constructor\n";
       }
   };

   int main()
   {
       C1 c1[5]; // The default constructor is called one by one for each element of array c1.
   }
 #+END_SRC

  It is also important to understand that classes do not have to have a ~default constructor~. The ~default constructor~ may not be declared. There are different rules for cases where the ~default constructor~ is not declared, which will be discussed later.

