notes.html
<li><a id="orgdf89030"></a>When the default constructor is called?<br />
<div class="outline-text-5" id="text-orgdf89030">
<p>
Normally, <code>default initialized</code> objects are created with <code>garbage value</code>, but <code>default initialized</code> class objects are created with a call to the <code>default constructor</code>. The <code>non-static data members</code> of the class can still have garbage value if they are not initialized in the <code>default constructor</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor\n"</span>;
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">x is default initialized and have garbage value.</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1 is default initialized and the default constructor is called.</span>

       c1.mx; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1.mx still has a garbage value because it is not initialized in the default constructor.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>value initialized</code> class objects are created with a call to the <code>default constructor</code>. The <code>non-static data members</code> of the class will be also <code>zero initialized</code> before the <code>default constructor</code> is called. This means built-in types like <code>int</code> will be set to <code>0</code>, and pointers will be set to <code>nullptr</code>.
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor\n"</span>;
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>;
  <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">x is value initialized and set to 0. </span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span><span style="color: #ffffff;">{}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1 is value initialized.</span>

       c1.mx <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1.mx is also value initialized before the default constructor is called, meaning it is zero initialized.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>direct initialization</code> without providing a value is not possible because of <code>most vexing parse</code>. The compiler might give a warning:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">x</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">5</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">x is direct initialized and set to 5.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid but doesn't mean direct initilization.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Because of the most vexing parse, the compiler understand this as a function declaration.</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">x</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">It is same for the class objects. Valid but doesn't mean direct initilization.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Because of the most vexing parse, the compiler understand this as a function declaration.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The default constructor is not called because there is no object instantiation here.</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #feacd0;">c1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
The <code>default constructor</code> is also called when the elements of an array are <code>class objects</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span><span style="color: #ffffff;">[</span><span style="color: #00bcff;">5</span><span style="color: #ffffff;">]</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The default constructor is called one by one for each element of array c1.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
It is also important to understand that classes do not have to have a <code>default constructor</code>. The <code>default constructor</code> may not be declared. There are different rules for cases where the <code>default constructor</code> is not declared, which will be discussed later.
</p>
</div>
</li>
