notes.org
**** How non-default constructors can be called?
 A ~non-default constructor~ is any ~constructor~ that requires one or more arguments to be passed when an object is created. These ~constructors~ differ from the ~default constructor~, which either takes no arguments or has all default values for its parameters. ~non-default constructors~ are explicitly defined by the programmer and are used to initialize objects with specific values.

 ~non-default constructors~ can be called when an object is created with ~direct initialization~, ~direct-list initialization~ and ~copy initialization~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1(int x)
       {
	   std::cout << "C1(int x) x: " << x << '\n';
       }

       C1(int x, int y)
       {
	   std::cout << "C1(int x, int y) x: " << x << " y: " << y << '\n';
       }
   };

   int main()
   {
       C1 c1(10); // c1 is direct initialized. C1(int x) constructor is called.
       C1 c1{20}; // c1 is direct-list initialized. C1(int x) constructor is called.
       C1 c1 = 30; // c1 is copy initialized. C1(int x) constructor is called.

       // C1(int x, int y) constructor is called for all of these.
       C1 c1(1, 2);
       C1 c1{3, 4};
       C1 c1 = {5, 6};
   }
 #+END_SRC

