notes.html
<li><a id="orgc053688"></a>How non-default constructors can be called?<br />
<div class="outline-text-5" id="text-orgc053688">
<p>
A <code>non-default constructor</code> is any <code>constructor</code> that requires one or more arguments to be passed when an object is created. These <code>constructors</code> differ from the <code>default constructor</code>, which either takes no arguments or has all default values for its parameters. <code>non-default constructors</code> are explicitly defined by the programmer and are used to initialize objects with specific values.
</p>

<p>
<code>non-default constructors</code> can be called when an object is created with <code>direct initialization</code>, <code>direct-list initialization</code> and <code>copy initialization</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1(int x) x: "</span> &lt;&lt; x &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1(int x, int y) x: "</span> &lt;&lt; x &lt;&lt; <span style="color: #79a8ff;">" y: "</span> &lt;&lt; y &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #feacd0;">c1</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1 is direct initialized. C1(int x) constructor is called.</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span><span style="color: #ffffff;">{</span><span style="color: #00bcff;">20</span><span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1 is direct-list initialized. C1(int x) constructor is called.</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span> = <span style="color: #00bcff;">30</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1 is copy initialized. C1(int x) constructor is called.</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(int x, int y) constructor is called for all of these.</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #feacd0;">c1</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">2</span><span style="color: #ffffff;">)</span>;
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span><span style="color: #ffffff;">{</span><span style="color: #00bcff;">3</span>, <span style="color: #00bcff;">4</span><span style="color: #ffffff;">}</span>;
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span> = <span style="color: #ffffff;">{</span><span style="color: #00bcff;">5</span>, <span style="color: #00bcff;">6</span><span style="color: #ffffff;">}</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
