notes.org
**** Constructor initializer list
 The ~constructor~ initializes the ~non-static data members~ of the class object it creates. The syntax used by ~constructors~ to initialize ~non-static data members~ is called the ~constructor initializer list~.

 Usage of the ~constructor initializer list~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // This means that when this constructor is called, mx, my, and md are initialized to 10, 20, and 8.8 respectively,
       // before the constructor's body is executed.
       C1() : mx(10), my(20), md{ 8.8 }
       {
           // mx, my and md are already initialized here.
           mx; // 10
           my; // 20
           md; // 8.8
       }

   private:
       int mx, my;
       double md;
   };
 #+END_SRC

 Not all ~non-static data members~ of the class have to be initialized with the ~constructor initializer list~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() : mx{ 10 }
       {
           // Note that these are assignments, not initializations. 
           my = 20;
           md = 8.8;
       }

   private:
       int mx, my;
       double md;
   };
 #+END_SRC

 ~non-static data members~ are initialized in ~declaration order~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // mx will be initialized before my because mx is declared first.
       C1() : my{ 10 }, mx{ 20 }
       {

       }

   private:
       // mx is declarared before my;
       int mx, my;
   };
 #+END_SRC

 When using the constructor initializer list, the ~constructor~ block must exist even if it is empty:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() : mx(10), mx(20); // Invalid.
       C1() : mx(10), mx(20) {} // Valid, the constructor block must exist even it is empty.

   private:
       int mx, my;
   };
 #+END_SRC

 The ~constructor initializer list~ can also be used with ~non-default constructors~:
 #+BEGIN_SRC C++
   // date.h
   class Date
   {
   public:
       Date(int day, int mon, int year);

   private:
       int m_day, m_mon, m_year;
   };

   // date.cpp
   Date::Date(int day, int mon, int year) : m_day{ day }, m_mon { mon }, m_year{ year } {}

   // main.cpp
   int main()
   {
       Date date(19, 9, 2024);
   }
 #+END_SRC

 ~reference~ and ~const~ types must be initialized with the ~constructor initializer list~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // Invalid, mr is a reference and not initialized with the constructor initializer list.
       // mx is a const variable and not initialized with the constructor initializer list.
       // Reference and const types cannot be default initialized.
       C1() : mx{ 10 }
       {

       }

   private:
       int& mr;
       const int mx;
       int mx;
   };
 #+END_SRC


