notes.html
<li><a id="orga3f6d0c"></a>Constructor initializer list<br />
<div class="outline-text-5" id="text-orga3f6d0c">
<p>
The <code>constructor</code> initializes the <code>non-static data members</code> of the class object it creates. The syntax used by <code>constructors</code> to initialize <code>non-static data members</code> is called the <code>constructor initializer list</code>.
</p>

<p>
Usage of the <code>constructor initializer list</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This means that when this constructor is called, mx, my, and md are initialized to 10, 20, and 8.8 respectively,</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">before the constructor's body is executed.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">mx</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>, <span style="color: #feacd0;">my</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">20</span><span style="color: #ffffff;">)</span>, md<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">8.8</span> <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">mx, my and md are already initialized here.</span>
           mx; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">10</span>
           my; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">20</span>
           md; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">8.8</span>
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
       <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">md</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
Not all <code>non-static data members</code> of the class have to be initialized with the <code>constructor initializer list</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : mx<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">10</span> <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Note that these are assignments, not initializations. </span>
           my = <span style="color: #00bcff;">20</span>;
           md = <span style="color: #00bcff;">8.8</span>;
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
       <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">md</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>non-static data members</code> are initialized in <code>declaration order</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">mx will be initialized before my because mx is declared first.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : my<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">10</span> <span style="color: #ffffff;">}</span>, mx<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">20</span> <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>

       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">mx is declarared before my;</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
When using the constructor initializer list, the <code>constructor</code> block must exist even if it is empty:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">mx</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>, <span style="color: #feacd0;">mx</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">20</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">mx</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>, <span style="color: #feacd0;">mx</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">20</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{}</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, the constructor block must exist even it is empty.</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>, <span style="color: #ffffff;">my</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
The <code>constructor initializer list</code> can also be used with <code>non-default constructors</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">date.h</span>
   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Date</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">Date</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">day</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mon</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">year</span><span style="color: #ffffff;">)</span>;

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">m_day</span>, <span style="color: #ffffff;">m_mon</span>, <span style="color: #ffffff;">m_year</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">date.cpp</span>
   <span style="color: #00bcff;">Date</span>::<span style="color: #feacd0;">Date</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">day</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mon</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">year</span><span style="color: #ffffff;">)</span> : m_day<span style="color: #ffffff;">{</span> day <span style="color: #ffffff;">}</span>, m_mon <span style="color: #ffffff;">{</span> mon <span style="color: #ffffff;">}</span>, m_year<span style="color: #ffffff;">{</span> year <span style="color: #ffffff;">}</span> <span style="color: #ffffff;">{}</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">main.cpp</span>
   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">Date</span> <span style="color: #feacd0;">date</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">19</span>, <span style="color: #00bcff;">9</span>, <span style="color: #00bcff;">2024</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>reference</code> and <code>const</code> types must be initialized with the <code>constructor initializer list</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid, mr is a reference and not initialized with the constructor initializer list.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">mx is a const variable and not initialized with the constructor initializer list.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Reference and const types cannot be default initialized.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : mx<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">10</span> <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>

       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span>&amp; <span style="color: #ffffff;">mr</span>;
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>;
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>
</div>
</li>
</ul>
</div>
