notes.org
*** Special member functions
 ~special member functions~ are ~member functions~ related to a very important group of functions of a class. There are 6 different ~special member functions~.

 These ~special member functions~ are:
 - ~default constructor~
 - ~destructor~
 - ~copy constructor~
 - ~move constructor~ (C++11)
 - ~copy assignment~
 - ~move assignment~  (C++11)

~special member functions~ can be in one of the following states:
 - ~not declared~
 - ~implicitly declared~
   + ~implicitly declared~ and ~defaulted~
   + ~implicitly declared~ and ~deleted~
 - ~explicitly/user declared~
   + ~explicitly/user declared~ and ~defined~
   + ~explicitly/user declared~ and ~defaulted~
   + ~explicitly/user declared~ and ~deleted~

 The definitions of these functions can be written by the compiler if certain conditions are met. These functions, which are generated automatically by the compiler are called ~defaulted functions~. Only ~special member functions~ can be ~defaulted~.

 ~special member functions~ can be ~defaulted~ in 2 different ways:
 - The compiler can declare and define the ~special member functions~ ~implicitly~ according to the rules of the language.
 - We can ~explicitly~ ask the compiler to write the code for the ~special member functions~.

 ~special member functions~ can be ~deleted~ in 2 different ways:
 - The compiler can ~delete~ the ~special member functions~ ~implicitly~ according to the rules of the language.
 - We can ~explicitly~ ask the compiler to ~delete~ the ~special member functions~.

 ~deleted function~ means that the function exists, but calling it would cause a syntax error. ~deleted functions~ are distinguished from functions that were ~not declared~. They are included in the ~function overload resolution~ process. With some exceptions, ~special member functions~, ~class member functions~ and ~global functions~ can be ~deleted~, but most of the time ~deleted functions~ are about ~special member functions~.

 Calling ~deleted functions~ is invalid:
 #+BEGIN_SRC C++
  void func(int) = delete;

  int main()
  {
      func(10); // Invalid. Deleted functions cannot be referenced.
  }
 #+END_SRC
 
 ~deleted functions~ are included in ~function overload resolution~:
 #+BEGIN_SRC C++
  void func(int) = delete;
  void func(float);

  int main()
  {
      f1(2.3); // Valid, func(float) will be called.
      f1(2); // Invalid, func(int) will be chosen but deleted functions cannot be referenced.
  }
 #+END_SRC

 There are some rules defining how each ~special member function~ should be ~defaulted~ by the compiler. When a ~special member function~ is defaulted by the compiler violates the rules of the language, the compiler ~deletes~ the function it should have ~defaulted~ to instead of throwing a syntax error.

 Cases that can cause a syntax error when the compiler tries to ~default~ a ~special member function~:
 - If some of the ~non-static data members~ of a class cannot be ~default initialized~.
 - If there is a call to a function that does not exist / ~non declared~.
 - If there is a call to a ~private~ function.
 - If there is a call to a ~deleted~ function.

