notes.html
<div id="outline-container-orga3e8862" class="outline-4">
<h4 id="orga3e8862">Special member functions</h4>
<div class="outline-text-4" id="text-orga3e8862">
<p>
<code>special member functions</code> are <code>member functions</code> related to a very important group of functions of a class. There are 6 different <code>special member functions</code>.
</p>

<p>
These <code>special member functions</code> are:
</p>
<ul class="org-ul">
<li><code>default constructor</code></li>
<li><code>destructor</code></li>
<li><code>copy constructor</code></li>
<li><code>move constructor</code> (C++11)</li>
<li><code>copy assignment</code></li>
<li><code>move assignment</code>  (C++11)</li>
</ul>

<p>
<code>special member functions</code> can be in one of the following states:
</p>
<ul class="org-ul">
<li><code>not declared</code></li>
<li><code>implicitly declared</code>
<ul class="org-ul">
<li><code>implicitly declared</code> and <code>defaulted</code></li>
<li><code>implicitly declared</code> and <code>deleted</code></li>
</ul></li>
<li><code>explicitly/user declared</code>
<ul class="org-ul">
<li><code>explicitly/user declared</code> and <code>defined</code></li>
<li><code>explicitly/user declared</code> and <code>defaulted</code></li>
<li><code>explicitly/user declared</code> and <code>deleted</code></li>
</ul></li>
</ul>

<p>
The definitions of these functions can be written by the compiler if certain conditions are met. These functions, which are generated automatically by the compiler are called <code>defaulted functions</code>. Only <code>special member functions</code> can be <code>defaulted</code>.
</p>

<p>
<code>special member functions</code> can be <code>defaulted</code> in 2 different ways:
</p>
<ul class="org-ul">
<li>The compiler can declare and define the <code>special member functions</code> <code>implicitly</code> according to the rules of the language.</li>
<li>We can <code>explicitly</code> ask the compiler to write the code for the <code>special member functions</code>.</li>
</ul>

<p>
<code>special member functions</code> can be <code>deleted</code> in 2 different ways:
</p>
<ul class="org-ul">
<li>The compiler can <code>delete</code> the <code>special member functions</code> <code>implicitly</code> according to the rules of the language.</li>
<li>We can <code>explicitly</code> ask the compiler to <code>delete</code> the <code>special member functions</code>.</li>
</ul>

<p>
<code>deleted function</code> means that the function exists, but calling it would cause a syntax error. <code>deleted functions</code> are distinguished from functions that were <code>not declared</code>. They are included in the <code>function overload resolution</code> process. With some exceptions, <code>special member functions</code>, <code>class member functions</code> and <code>global functions</code> can be <code>deleted</code>, but most of the time <code>deleted functions</code> are about <code>special member functions</code>.
</p>

<p>
Calling <code>deleted functions</code> is invalid:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">delete</span>;

  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid. Deleted functions cannot be referenced.</span>
  <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>deleted functions</code> are included in <code>function overload resolution</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">delete</span>;
  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">float</span><span style="color: #ffffff;">)</span>;

  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">2.3</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid, func(float) will be called.</span>
      <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">2</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid, func(int) will be chosen but deleted functions cannot be referenced.</span>
  <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
There are some rules defining how each <code>special member function</code> should be <code>defaulted</code> by the compiler. When a <code>special member function</code> is defaulted by the compiler violates the rules of the language, the compiler <code>deletes</code> the function it should have <code>defaulted</code> to instead of throwing a syntax error.
</p>

<p>
Cases that can cause a syntax error when the compiler tries to <code>default</code> a <code>special member function</code>:
</p>
<ul class="org-ul">
<li>If some of the <code>non-static data members</code> of a class cannot be <code>default initialized</code>.</li>
<li>If there is a call to a function that does not exist / <code>non declared</code>.</li>
<li>If there is a call to a <code>private</code> function.</li>
<li>If there is a call to a <code>deleted</code> function.</li>
</ul>
</div>
<ul class="org-ul">
