notes.org
**** Default constructor
 For a ~constructor~ to be the ~default constructor~, it must either take no parameters or all its parameters must take default arguments. In other words, a ~constructor~ is the ~default constructor~ if it can be called without passing any arguments. The ~default constructor~ is one of the ~special member functions~.

 Example for the ~default constructor~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1(); // Default constructor.
   };

   class C2
   {
   public:
       C2(int = 0); // Default constructor.
   };
#+END_SRC

 The ~default constructor~ is ~defaulted~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() = default; // The default constructor is user-declared and defaulted.
   };
 #+END_SRC

 The ~default constructor~ is ~implicitly deleted~:
 #+BEGIN_SRC C++
   class C1
   {
   // The default constructor is implicitly declared and deleted.
   public:
       const int x;
   };

   int main()
   {
       C1 c1; // Invalid. The default constructor is deleted and cannot be called.
   }
 #+END_SRC

 The ~default constructor~ is ~deleted~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() = delete; // The default constructor is user declared and deleted.
   };
 #+END_SRC

 ~default constructor~ which is ~defaulted~ by the compiler must be:
 - ~non-static~
 - ~inline~ (because it will be defined in ~class definition~, meaning it is implicitly ~inline~)
 - ~public~
 function of a class.

 The compiler will generate code for a ~default constructor~ that ~default initializes~ all ~non-static data members~. If there is an ~explicitly declared~ constructor (it doesn't have to be ~default constructor~) the compiler will not ~default~ a ~default constructor~.

 The ~default constructor~ will be ~defaulted~ by the compiler because there is no syntax error and it is not ~explicitly declared~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // The compiler will generate something like this as a default constructor. All non-static data members are default initialized.
       // C1() : ax(), bx(), cx()
       // {
              // The compiler can also add extra code depending on its implementation.
       // }
   private:
       int ax;
       double bx;
       char* cx;
   };
 #+END_SRC

 The ~default constructor~ will be ~deleted~ because ~const~ objects cannot be ~default initialized~:
 #+BEGIN_SRC C++
   class C1
   {
   // The default constructor will be deleted by compiler because const objects cannot be default initialized.
   // Instead of throwing a syntax error the compiler deletes the default constructor.
   private:
       const int x;
   };

   int main()
   {
       C1 c1; // This is a syntax error. Deleted functions cannot be referenced.
       return 0;
   }
 #+END_SRC

 The ~default constructor~ will be ~deleted~ because the ~non-static data member~ does not have ~default constructor~ and cannot be ~default initialized~:
 #+BEGIN_SRC C++
   class C2
   {
   public:
       // There is an explicily declared constructor, meaning that this class does not have a default constructor.
       // The default constructor is non-declared.
       C2(int);
   };

   class C1
   {
   // The default constructor will be deleted because c2 does not have a default constructor so cannot be default initialized.
   private:
       C2 c2;
   };

   int main()
   {
       C1 c1; // Syntax error. Attempting to reference a deleted function.
       
       return 0;
   }
 #+END_SRC

