notes.html
<li><a id="org2ee0a42"></a>Default constructor<br />
<div class="outline-text-5" id="text-org2ee0a42">
<p>
For a <code>constructor</code> to be the <code>default constructor</code>, it must either take no parameters or all its parameters must take default arguments. In other words, a <code>constructor</code> is the <code>default constructor</code> if it can be called without passing any arguments. The <code>default constructor</code> is one of the <code>special member functions</code>.
</p>

<p>
Example for the <code>default constructor</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Default constructor.</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C2</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> = <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Default constructor.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
The <code>default constructor</code> is <code>defaulted</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The default constructor is user-declared and defaulted.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
The <code>default constructor</code> is <code>implicitly deleted</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The default constructor is implicitly declared and deleted.</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Invalid. The default constructor is deleted and cannot be called.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
The <code>default constructor</code> is <code>deleted</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">delete</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The default constructor is user declared and deleted.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>default constructor</code> which is <code>defaulted</code> by the compiler must be:
</p>
<ul class="org-ul">
<li><code>non-static</code></li>
<li><code>inline</code> (because it will be defined in <code>class definition</code>, meaning it is implicitly <code>inline</code>)</li>
<li><code>public</code></li>
</ul>
<p>
function of a class.
</p>

<p>
The compiler will generate code for a <code>default constructor</code> that <code>default initializes</code> all <code>non-static data members</code>. If there is an <code>explicitly declared</code> constructor (it doesn't have to be <code>default constructor</code>) the compiler will not <code>default</code> a <code>default constructor</code>.
</p>

<p>
The <code>default constructor</code> will be <code>defaulted</code> by the compiler because there is no syntax error and it is not <code>explicitly declared</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The compiler will generate something like this as a default constructor. All non-static data members are default initialized.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1() : ax(), bx(), cx()</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">{</span>
              <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The compiler can also add extra code depending on its implementation.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">ax</span>;
       <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">bx</span>;
       <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">cx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
The <code>default constructor</code> will be <code>deleted</code> because <code>const</code> objects cannot be <code>default initialized</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The default constructor will be deleted by compiler because const objects cannot be default initialized.</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Instead of throwing a syntax error the compiler deletes the default constructor.</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is a syntax error. Deleted functions cannot be referenced.</span>
       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
The <code>default constructor</code> will be <code>deleted</code> because the <code>non-static data member</code> does not have <code>default constructor</code> and cannot be <code>default initialized</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C2</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">There is an explicily declared constructor, meaning that this class does not have a default constructor.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The default constructor is non-declared.</span>
       <span style="color: #feacd0;">C2</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The default constructor will be deleted because c2 does not have a default constructor so cannot be default initialized.</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">C2</span> <span style="color: #ffffff;">c2</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Syntax error. Attempting to reference a deleted function.</span>
       
       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
