notes.org
**** Copy constructor
 The ~copy constructor~ is called when a ~class object~ instantiated by taking its value from another ~class object~ of the same type. The ~copy constructor~ has the same name as the class and takes a ~const L-value reference~ parameter of that class type.
 
 ~explicitly declared copy constructor~ example:
  #+BEGIN_SRC C++ :includes <iostream>
   class Date
   {
   public:
       Date(int d, int m, int y) : md{ d }, mm{ m }, my{ y } { }
       Date(const Date& other) : md{ other.md }, mm{ other.mm }, my{ other.my }
       {
           std::cout << "this: " << this << " &other: " << &other << '\n';
       }
   private:
       int md{ 1 }, mm{ 1 }, my{ 1990 };
   };

   int main()
   {
       Date dx{ 12, 8, 1999 };
       Date dy = dx;

       std::cout << "&dy: " << &dy << " &dx: " << &dx << '\n';
   }

   /*
        'this pointer' will be address of dy and address of other will be equal to address of dx.
        Output:
        this: <address of this> &other: <address of other>
        dy: <address of dy> dx: <address of dx>
   */
 #+END_SRC

 In some cases the compiler can make certain optimizations so that the ~copy constructor~ is not called, but leaving these cases aside for now, typically the ~copy constructor~ is called in the following scenarios.
 
 When a ~class object~ is instantiated directly by another ~class object~:
#+BEGIN_SRC C++
  class C1
  {
      // The copy constructor is implicitly declared and defaulted.  
  };

  int main()
  {
      C1 c1a;
      // The copy constructor will be called for c1b. c1b will be instantiated by taking its value from c1a.
      // When the copy constructor is called for c1b, 'this pointer' will be address of c1b and const reference parameter will be c1a.
      C1 c1b{ c1a };
      // The copy constructor will be called for c1c. c1c will be instantiated by taking its value from c1b.
      C1 c1c = c1b;
  }
 #+END_SRC

 Calling a function with a value (not reference or pointer) causes the ~copy constructor~ to be called:
#+BEGIN_SRC C++
  class C1
  {
      // The copy constructor is implicitly declared and defaulted.  
  };

  void func(C1 param);

  int main()
  {
      C1 c1;
      // When func() is called with c1, C1 param will be instantiated by calling the copy constructor.
      func(c1);
  }
 #+END_SRC

 Returning a value from a function (not reference or pointer) causes the ~copy constructor~ to be called:
#+BEGIN_SRC C++
  class C1
  {
      // The copy constructor is implicitly declared and defaulted.  
  };

  C1 func()
  {
      C1 c1;
      // When func() is returned, the return object will be instantiated by calling the copy constructor and it will take its value from c1.
      return c1; // c1 will be copied to the return object and will be desctructed at the end of scope.
  }

  int main()
  {
      C1 c1 = func();
  }
 #+END_SRC

 ~copy constructor~ which is ~defaulted~ by the compiler must be:
 - ~non-static~
 - ~inline~ (because it will be defined in ~class definition~, meaning it is implicitly ~inline~)
 - ~public~
 function of a class.

 The compiler will generate code for a ~copy constructor~ that initializes all ~non-static data members~ by taking their value from the ~class object~ being copied:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // The compiler will generate something like this as a copy constructor. All non-static data members are initialized by taking their value from other class object. Initilization will be in declaration order as in default constructor.
       // C1(const C1& other) : ax(other.ax), bx(other.bx), cx(other.cx)
       // {
              // The compiler can also add extra code depending on its implementation.
       // }
   private:
       int ax;
       double bx;
       char* cx;
   };
 #+END_SRC

 Usually the ~copy constructor~ which is ~defaulted~ by the compiler will be sufficient for our needs, but there are some cases where the ~copy constructor~ needs to be ~explicitly defined~ to prevent logical errors that can cause memory/resource leaks. We can say that if the ~destructor~ is ~explicitly defined~ for a class, typically the ~copy constructor~ also needs to be ~explicitly defined~ because most of the time it means we have some memory/resource to manage.

 If pointer or reference ~non-static data members~ are stored inside of a class, we might need to use ~explicitly defined~ ~copy constructor~:
 #+BEGIN_SRC C++ :includes <cstdio> <stdexcept>
   class Logger
   {
   public:
       // The copy constructor is defaulted by compiler.
       
       Logger(const char* file_name) : m_f(std::fopen(file_name, "w"))
       {
           if (!m_f)
           {
               throw std::runtime_error{ "Cannot create the file!" };
           }
       }

       void log(const char* p)
       {
           std::fprintf(m_f, "%s\n", p);
       }

       ~Logger()
       {
           if (m_f)
           {
               std::fclose(m_f);
           }
       }

   private:
       FILE* m_f;
   };

   // When this function is called with a Logger object, values of that Logger object will be copied to object 'y' by the defaulted copy constructor. The problem is the Logger class has a pointer data member(m_f) and it will be also copied, meaning the same pointer will be used by 2 different objects ('caller object' and 'y'). This will cause a problem when the desctructor is called for those objects.
   void func(Logger y)
   {
       // This will also write to file 'log.txt' because file(m_f) is copied from the caller object.
       y.log("y");

       // The destructor will be called here for 'y', and the file(m_f) will be closed in the desctructor.
   }

   int main()
   {
       Logger x{ "log.txt" };

       // This will write to file 'log.txt'
       x.log("x");

       // Object 'x' will be copied to object 'y' (parameter of the func()).
       func(x);

       // From this point, the file pointer(m_f) inside object 'x' has become dangling pointer, and it will cause an undefined behaviour if we use it again.

       // The destructor will be called here for object 'x', but the file(m_f) is already closed/freed when the destructor of 'y' object was called, because the value of 'm_f' was copied to object 'y' when we called the func().
       // This will cause an undefined behaviour because we double free.
   }
 #+END_SRC

 ~explicitly defined copy constructor~ to make deep-copy of the pointer ~data member~ instead of shallow-copy:
#+BEGIN_SRC C++ :includes <iostream> <stdexcept> <cstdlib> <cstring>
  class String
  {
  public:
      String() = default;
      String(const char* str) : m_len{ std::strlen(str) }, m_str{ static_cast<char*>(malloc(m_len + 1)) }
      {
          if (!m_str)
          {
              throw std::runtime_error{ "Cannot allocate memory!" };
          }

          std::strcpy(m_str, str);
      }

      // Explicitly defined copy construtor to make deep-copy instead of shallow-copy to prevent copying pointers.
      String(const String& other) : m_len{ other.m_len }, m_str{ static_cast<char*>(malloc(m_len + 1)) }
      {
          if (!m_str)
          {
              throw std::runtime_error{ "Cannot allocate memory!" };
          }

          std::strcpy(m_str, other.m_str);
      }

      void print() const
      {
          std::cout << '[' << m_str << "]\n";
      }

      std::size_t length() const
      {
          return m_len;        
      }

      ~String()
      {
          std::free(m_str);
      }

  private:
      std::size_t m_len;
      char* m_str;
  };

  void func(String y)
  {
      std::cout << "func() is called\n";
      y.print();

      // The desctructor for object 'y' will be called here and the memory allocated for object 'y' will be freed.
  }

  int main()
  {
      String x{ "Hello world!" };

      x.print();

      func(x);

      x.print();
      std::cout << x.length();

      // The desctructor for object 'x' will be called here and the memory allocated for object 'x' will be freed.
      // In this case there is no double free because explicitly defined copy constructor didn't copy the pointer instead it allocated new memory space for the new String object. Both of the objects will print "Hello world!" but they store it in different memory spaces.
  }
 #+END_SRC

