notes.html
<li><a id="org4b609dd"></a>Copy constructor<br />
<div class="outline-text-5" id="text-org4b609dd">
<p>
The <code>copy constructor</code> is called when a <code>class object</code> instantiated by taking its value from another <code>class object</code> of the same type. The <code>copy constructor</code> has the same name as the class and takes a <code>const L-value reference</code> parameter of that class type.
</p>

<p>
<code>explicitly declared copy constructor</code> example:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Date</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">Date</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">d</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">m</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">)</span> : md<span style="color: #ffffff;">{</span> d <span style="color: #ffffff;">}</span>, mm<span style="color: #ffffff;">{</span> m <span style="color: #ffffff;">}</span>, my<span style="color: #ffffff;">{</span> y <span style="color: #ffffff;">}</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">}</span>
       <span style="color: #feacd0;">Date</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">Date</span>&amp; <span style="color: #ffffff;">other</span><span style="color: #ffffff;">)</span> : md<span style="color: #ffffff;">{</span> other.md <span style="color: #ffffff;">}</span>, mm<span style="color: #ffffff;">{</span> other.mm <span style="color: #ffffff;">}</span>, my<span style="color: #ffffff;">{</span> other.my <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">" &amp;other: "</span> &lt;&lt; &amp;other &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">md</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span> <span style="color: #ffffff;">}</span>, <span style="color: #ffffff;">mm</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span> <span style="color: #ffffff;">}</span>, <span style="color: #ffffff;">my</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1990</span> <span style="color: #ffffff;">}</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">Date</span> <span style="color: #ffffff;">dx</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">12</span>, <span style="color: #00bcff;">8</span>, <span style="color: #00bcff;">1999</span> <span style="color: #ffffff;">}</span>;
       <span style="color: #6ae4b9;">Date</span> <span style="color: #ffffff;">dy</span> = dx;

       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"&amp;dy: "</span> &lt;&lt; &amp;dy &lt;&lt; <span style="color: #79a8ff;">" &amp;dx: "</span> &lt;&lt; &amp;dx &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">        'this pointer' will be address of dy and address of other will be equal to address of dx.</span>
<span style="color: #989898; font-style: italic;">        Output:</span>
<span style="color: #989898; font-style: italic;">        this: &lt;address of this&gt; &amp;other: &lt;address of other&gt;</span>
<span style="color: #989898; font-style: italic;">        dy: &lt;address of dy&gt; dx: &lt;address of dx&gt;</span>
<span style="color: #989898; font-style: italic;">   */</span>
</pre>
</div>

<p>
In some cases the compiler can make certain optimizations so that the <code>copy constructor</code> is not called, but leaving these cases aside for now, typically the <code>copy constructor</code> is called in the following scenarios.
</p>

<p>
When a <code>class object</code> is instantiated directly by another <code>class object</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The copy constructor is implicitly declared and defaulted.  </span>
  <span style="color: #ffffff;">}</span>;

  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1a</span>;
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The copy constructor will be called for c1b. c1b will be instantiated by taking its value from c1a.</span>
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">When the copy constructor is called for c1b, 'this pointer' will be address of c1b and const reference parameter will be c1a.</span>
      <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1b</span><span style="color: #ffffff;">{</span> c1a <span style="color: #ffffff;">}</span>;
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The copy constructor will be called for c1c. c1c will be instantiated by taking its value from c1b.</span>
      <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1c</span> = c1b;
  <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
Calling a function with a value (not reference or pointer) causes the <code>copy constructor</code> to be called:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The copy constructor is implicitly declared and defaulted.  </span>
  <span style="color: #ffffff;">}</span>;

  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">param</span><span style="color: #ffffff;">)</span>;

  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">When func() is called with c1, C1 param will be instantiated by calling the copy constructor.</span>
      <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>c1<span style="color: #ffffff;">)</span>;
  <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
Returning a value from a function (not reference or pointer) causes the <code>copy constructor</code> to be called:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The copy constructor is implicitly declared and defaulted.  </span>
  <span style="color: #ffffff;">}</span>;

  <span style="color: #6ae4b9;">C1</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">When func() is returned, the return object will be instantiated by calling the copy constructor and it will take its value from c1.</span>
      <span style="color: #b6a0ff;">return</span> c1; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1 will be copied to the return object and will be desctructed at the end of scope.</span>
  <span style="color: #ffffff;">}</span>

  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span> = <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
  <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>copy constructor</code> which is <code>defaulted</code> by the compiler must be:
</p>
<ul class="org-ul">
<li><code>non-static</code></li>
<li><code>inline</code> (because it will be defined in <code>class definition</code>, meaning it is implicitly <code>inline</code>)</li>
<li><code>public</code></li>
</ul>
<p>
function of a class.
</p>

<p>
The compiler will generate code for a <code>copy constructor</code> that initializes all <code>non-static data members</code> by taking their value from the <code>class object</code> being copied:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The compiler will generate something like this as a copy constructor. All non-static data members are initialized by taking their value from other class object. Initilization will be in declaration order as in default constructor.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(const C1&amp; other) : ax(other.ax), bx(other.bx), cx(other.cx)</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">{</span>
              <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The compiler can also add extra code depending on its implementation.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">ax</span>;
       <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">bx</span>;
       <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">cx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
Usually the <code>copy constructor</code> which is <code>defaulted</code> by the compiler will be sufficient for our needs, but there are some cases where the <code>copy constructor</code> needs to be <code>explicitly defined</code> to prevent logical errors that can cause memory/resource leaks. We can say that if the <code>destructor</code> is <code>explicitly defined</code> for a class, typically the <code>copy constructor</code> also needs to be <code>explicitly defined</code> because most of the time it means we have some memory/resource to manage.
</p>

<p>
If pointer or reference <code>non-static data members</code> are stored inside of a class, we might need to use <code>explicitly defined</code> <code>copy constructor</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Logger</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The copy constructor is defaulted by compiler.</span>
       
       <span style="color: #feacd0;">Logger</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">file_name</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">m_f</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">fopen</span><span style="color: #ffffff;">(</span>file_name, <span style="color: #79a8ff;">"w"</span><span style="color: #ffffff;">))</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #ff5f59; font-weight: bold;">!</span>m_f<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #b6a0ff;">throw</span> <span style="color: #00bcff;">std</span>::runtime_error<span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Cannot create the file!"</span> <span style="color: #ffffff;">}</span>;
           <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">log</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">p</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">fprintf</span><span style="color: #ffffff;">(</span>m_f, <span style="color: #79a8ff;">"%s\n"</span>, p<span style="color: #ffffff;">)</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">Logger</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span>m_f<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">fclose</span><span style="color: #ffffff;">(</span>m_f<span style="color: #ffffff;">)</span>;
           <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">FILE</span>* <span style="color: #ffffff;">m_f</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">When this function is called with a Logger object, values of that Logger object will be copied to object 'y' by the defaulted copy constructor. The problem is the Logger class has a pointer data member(m_f) and it will be also copied, meaning the same pointer will be used by 2 different objects ('caller object' and 'y'). This will cause a problem when the desctructor is called for those objects.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">Logger</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This will also write to file 'log.txt' because file(m_f) is copied from the caller object.</span>
       y.<span style="color: #feacd0;">log</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"y"</span><span style="color: #ffffff;">)</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The destructor will be called here for 'y', and the file(m_f) will be closed in the desctructor.</span>
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">Logger</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"log.txt"</span> <span style="color: #ffffff;">}</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This will write to file 'log.txt'</span>
       x.<span style="color: #feacd0;">log</span><span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"x"</span><span style="color: #ffffff;">)</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Object 'x' will be copied to object 'y' (parameter of the func()).</span>
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">From this point, the file pointer(m_f) inside object 'x' has become dangling pointer, and it will cause an undefined behaviour if we use it again.</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The destructor will be called here for object 'x', but the file(m_f) is already closed/freed when the destructor of 'y' object was called, because the value of 'm_f' was copied to object 'y' when we called the func().</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This will cause an undefined behaviour because we double free.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>explicitly defined copy constructor</code> to make deep-copy of the pointer <code>data member</code> instead of shallow-copy:
</p>
<div class="org-src-container">
<pre class="src src-C++">  <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">String</span>
  <span style="color: #ffffff;">{</span>
  <span style="color: #b6a0ff;">public</span>:
      <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
      <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">str</span><span style="color: #ffffff;">)</span> : m_len<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strlen</span><span style="color: #ffffff;">(</span>str<span style="color: #ffffff;">)</span> <span style="color: #ffffff;">}</span>, m_str<span style="color: #ffffff;">{</span> <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span><span style="color: #feacd0;">malloc</span><span style="color: #ffffff;">(</span>m_len + <span style="color: #00bcff;">1</span><span style="color: #ffffff;">))</span> <span style="color: #ffffff;">}</span>
      <span style="color: #ffffff;">{</span>
          <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #ff5f59; font-weight: bold;">!</span>m_str<span style="color: #ffffff;">)</span>
          <span style="color: #ffffff;">{</span>
              <span style="color: #b6a0ff;">throw</span> <span style="color: #00bcff;">std</span>::runtime_error<span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Cannot allocate memory!"</span> <span style="color: #ffffff;">}</span>;
          <span style="color: #ffffff;">}</span>

          <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strcpy</span><span style="color: #ffffff;">(</span>m_str, str<span style="color: #ffffff;">)</span>;
      <span style="color: #ffffff;">}</span>

      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Explicitly defined copy construtor to make deep-copy instead of shallow-copy to prevent copying pointers.</span>
      <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">String</span>&amp; <span style="color: #ffffff;">other</span><span style="color: #ffffff;">)</span> : m_len<span style="color: #ffffff;">{</span> other.m_len <span style="color: #ffffff;">}</span>, m_str<span style="color: #ffffff;">{</span> <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span><span style="color: #feacd0;">malloc</span><span style="color: #ffffff;">(</span>m_len + <span style="color: #00bcff;">1</span><span style="color: #ffffff;">))</span> <span style="color: #ffffff;">}</span>
      <span style="color: #ffffff;">{</span>
          <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #ff5f59; font-weight: bold;">!</span>m_str<span style="color: #ffffff;">)</span>
          <span style="color: #ffffff;">{</span>
              <span style="color: #b6a0ff;">throw</span> <span style="color: #00bcff;">std</span>::runtime_error<span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Cannot allocate memory!"</span> <span style="color: #ffffff;">}</span>;
          <span style="color: #ffffff;">}</span>

          <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strcpy</span><span style="color: #ffffff;">(</span>m_str, other.m_str<span style="color: #ffffff;">)</span>;
      <span style="color: #ffffff;">}</span>

      <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
      <span style="color: #ffffff;">{</span>
          <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">'['</span> &lt;&lt; m_str &lt;&lt; <span style="color: #79a8ff;">"]\n"</span>;
      <span style="color: #ffffff;">}</span>

      <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #feacd0;">length</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
      <span style="color: #ffffff;">{</span>
          <span style="color: #b6a0ff;">return</span> m_len;        
      <span style="color: #ffffff;">}</span>

      ~<span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
      <span style="color: #ffffff;">{</span>
          <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">free</span><span style="color: #ffffff;">(</span>m_str<span style="color: #ffffff;">)</span>;
      <span style="color: #ffffff;">}</span>

  <span style="color: #b6a0ff;">private</span>:
      <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #ffffff;">m_len</span>;
      <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">m_str</span>;
  <span style="color: #ffffff;">}</span>;

  <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">String</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"func() is called\n"</span>;
      y.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The desctructor for object 'y' will be called here and the memory allocated for object 'y' will be freed.</span>
  <span style="color: #ffffff;">}</span>

  <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">{</span>
      <span style="color: #6ae4b9;">String</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Hello world!"</span> <span style="color: #ffffff;">}</span>;

      x.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

      <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>;

      x.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
      <span style="color: #00bcff;">std</span>::cout &lt;&lt; x.<span style="color: #feacd0;">length</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The desctructor for object 'x' will be called here and the memory allocated for object 'x' will be freed.</span>
      <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">In this case there is no double free because explicitly defined copy constructor didn't copy the pointer instead it allocated new memory space for the new String object. Both of the objects will print "Hello world!" but they store it in different memory spaces.</span>
  <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
