notes.org
**** Copy assignment operator/function
The ~copy assignment operator~ is called when a ~class object~ is assigned to another ~L-value class object~ of the same type. There is no instantiation when the ~copy assignment operator~ is called, because to assign one ~class object~ to another ~class object~, both ~class objects~ must already be instantiated. The ~copy assignment operator~ takes a ~const L-value reference~ parameter of that class type and ~returns~ ~L-value reference~ of the same class type.

~copy assignment operator~ which is ~defaulted~ by the compiler must be:
 - ~non-static~
 - ~inline~ (because it will be defined in ~class definition~, meaning it is implicitly ~inline~)
 - ~public~
 function of a class.

 #+BEGIN_SRC C++
   class C1
   {
   public:
        // The compiler will generate something like this as a copy assignment operator. All non-static data members are assigned by copying their values from other class object's non-static data members. Assignments will be in declaration order.
       //C1& operator=(const C1& other)
       //{
       //    ax = other.ax;
       //    bx = other.bx;
       //
       //    return *this;
       //}

   private:
       int ax;
       int bx;
   };
 #+END_SRC

 ~explicitly declared copy assignment operator~ example:
  #+BEGIN_SRC C++ :includes <iostream>
    class Date
    {
    public:
        Date(int d, int m, int y) : md{ d }, mm{ m }, my{ y } { }
        Date& operator=(const Date& other)
        {
            md = other.md;
            mm = other.mm;
            my = other.my;
            
            std::cout << "this: " << this << " &other: " << &other << '\n';

            return *this;
        }
    private:
        int md{ 1 }, mm{ 1 }, my{ 1990 };
    };

    int main()
    {
        Date dx{ 12, 8, 1999 };
        Date dy{ 9, 8, 1966 };

        dy = dx;
        
        std::cout << "&dy: " << &dy << " &dx: " << &dx << '\n';
    }

    /*
         'this pointer' will be address of dy and address of other will be equal to address of dx.
         Output:
         this: <address of this> &other: <address of other>
         dy: <address of dy> dx: <address of dx>
    ,*/
 #+END_SRC

 Similar to the ~copy constructor~, there are some cases where the ~copy assignment operator~ also needs to be ~explicitly defined~ to prevent logical errors which can cause memory/resource leaks. Similarly, we can say that if the ~destructor~ is ~explicitly defined~ for a class, typically the ~copy assignment operator~ also needs to be ~explicitly defined~ because most of the time it means we have some memory/resource to manage.

 ~explicitly defined copy assignment~ to make deep-copy of the pointer ~data member~ instead of shallow-copy:
 #+BEGIN_SRC C++ :includes <iostream> <stdexcept> <cstdlib> <cstring>
   class String
   {
   public:
       String() = default;
       String(const char* str) : m_len{ std::strlen(str) }, m_str{ static_cast<char*>(malloc(m_len + 1)) }
       {
           if (!m_str)
           {
               throw std::runtime_error{ "Cannot allocate memory!" };
           }

           std::strcpy(m_str, str);
       }

       // Explicitly defined copy assignment operator to make deep-copy instead of shallow-copy to prevent copying pointers.
       String& operator=(const String& other)
       {
           // Return directly if the object is assigned to itself.
           if (this == &other)
           {
               return *this;
           }

           // This is just for demonstration.
           // We free already existing resource and reallocate for new string.
           std::free(m_str);

           m_len = other.m_len;
           m_str = static_cast<char*>(malloc(m_len + 1));

           if (!m_str)
           {
               throw std::runtime_error{ "Cannot allocate memory!" };
           }

           std::strcpy(m_str, other.m_str);

           return *this;
       }

       void print() const
       {
           std::cout << '[' << m_str << "]\n";
       }

       std::size_t length() const
       {
           return m_len;        
       }

       ~String()
       {
           std::free(m_str);
       }

   private:
       std::size_t m_len;
       char* m_str;
   };

   int main()
   {
       String x{ "Hello world!" };
       String y{ "y" };

       // The copy assignment will be called for object 'x'.
       x = y;

       x.print();

       // The desctructor for object 'x' will be called here and the memory allocated for object 'x' will be freed.
   }
 #+END_SRC

