notes.html
<li><a id="org8d5bdcb"></a>Copy assignment operator/function<br />
<div class="outline-text-5" id="text-org8d5bdcb">
<p>
The <code>copy assignment operator</code> is called when a <code>class object</code> is assigned to another <code>L-value class object</code> of the same type. There is no instantiation when the <code>copy assignment operator</code> is called, because to assign one <code>class object</code> to another <code>class object</code>, both <code>class objects</code> must already be instantiated. The <code>copy assignment operator</code> takes a <code>const L-value reference</code> parameter of that class type and <code>returns</code> <code>L-value reference</code> of the same class type.
</p>

<p>
<code>copy assignment operator</code> which is <code>defaulted</code> by the compiler must be:
</p>
<ul class="org-ul">
<li><code>non-static</code></li>
<li><code>inline</code> (because it will be defined in <code>class definition</code>, meaning it is implicitly <code>inline</code>)</li>
<li><code>public</code></li>
</ul>
<p>
function of a class.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
        <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The compiler will generate something like this as a copy assignment operator. All non-static data members are assigned by copying their values from other class object's non-static data members. Assignments will be in declaration order.</span>
       <span style="color: #989898; font-style: italic;">//</span><span style="color: #989898; font-style: italic;">C1&amp; operator=(const C1&amp; other)</span>
       <span style="color: #989898; font-style: italic;">//</span><span style="color: #989898; font-style: italic;">{</span>
       <span style="color: #989898; font-style: italic;">//    </span><span style="color: #989898; font-style: italic;">ax = other.ax;</span>
       <span style="color: #989898; font-style: italic;">//    </span><span style="color: #989898; font-style: italic;">bx = other.bx;</span>
       <span style="color: #989898; font-style: italic;">//</span>
       <span style="color: #989898; font-style: italic;">//    </span><span style="color: #989898; font-style: italic;">return *this;</span>
       <span style="color: #989898; font-style: italic;">//</span><span style="color: #989898; font-style: italic;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">ax</span>;
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">bx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>explicitly declared copy assignment operator</code> example:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Date</span>
    <span style="color: #ffffff;">{</span>
    <span style="color: #b6a0ff;">public</span>:
        <span style="color: #feacd0;">Date</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">d</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">m</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">)</span> : md<span style="color: #ffffff;">{</span> d <span style="color: #ffffff;">}</span>, mm<span style="color: #ffffff;">{</span> m <span style="color: #ffffff;">}</span>, my<span style="color: #ffffff;">{</span> y <span style="color: #ffffff;">}</span> <span style="color: #ffffff;">{</span> <span style="color: #ffffff;">}</span>
        <span style="color: #6ae4b9;">Date</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">Date</span>&amp; <span style="color: #ffffff;">other</span><span style="color: #ffffff;">)</span>
        <span style="color: #ffffff;">{</span>
            md = other.md;
            mm = other.mm;
            my = other.my;
            
            <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">" &amp;other: "</span> &lt;&lt; &amp;other &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;

            <span style="color: #b6a0ff;">return</span> *<span style="color: #b6a0ff;">this</span>;
        <span style="color: #ffffff;">}</span>
    <span style="color: #b6a0ff;">private</span>:
        <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">md</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span> <span style="color: #ffffff;">}</span>, <span style="color: #ffffff;">mm</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span> <span style="color: #ffffff;">}</span>, <span style="color: #ffffff;">my</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1990</span> <span style="color: #ffffff;">}</span>;
    <span style="color: #ffffff;">}</span>;

    <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
    <span style="color: #ffffff;">{</span>
        <span style="color: #6ae4b9;">Date</span> <span style="color: #ffffff;">dx</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">12</span>, <span style="color: #00bcff;">8</span>, <span style="color: #00bcff;">1999</span> <span style="color: #ffffff;">}</span>;
        <span style="color: #6ae4b9;">Date</span> <span style="color: #ffffff;">dy</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">9</span>, <span style="color: #00bcff;">8</span>, <span style="color: #00bcff;">1966</span> <span style="color: #ffffff;">}</span>;

        dy = dx;
        
        <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"&amp;dy: "</span> &lt;&lt; &amp;dy &lt;&lt; <span style="color: #79a8ff;">" &amp;dx: "</span> &lt;&lt; &amp;dx &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
    <span style="color: #ffffff;">}</span>

    <span style="color: #989898; font-style: italic;">/*</span>
<span style="color: #989898; font-style: italic;">         'this pointer' will be address of dy and address of other will be equal to address of dx.</span>
<span style="color: #989898; font-style: italic;">         Output:</span>
<span style="color: #989898; font-style: italic;">         this: &lt;address of this&gt; &amp;other: &lt;address of other&gt;</span>
<span style="color: #989898; font-style: italic;">         dy: &lt;address of dy&gt; dx: &lt;address of dx&gt;</span>
<span style="color: #989898; font-style: italic;">    */</span>
</pre>
</div>

<p>
Similar to the <code>copy constructor</code>, there are some cases where the <code>copy assignment operator</code> also needs to be <code>explicitly defined</code> to prevent logical errors which can cause memory/resource leaks. Similarly, we can say that if the <code>destructor</code> is <code>explicitly defined</code> for a class, typically the <code>copy assignment operator</code> also needs to be <code>explicitly defined</code> because most of the time it means we have some memory/resource to manage.
</p>

<p>
<code>explicitly defined copy assignment</code> to make deep-copy of the pointer <code>data member</code> instead of shallow-copy:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">String</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
       <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">str</span><span style="color: #ffffff;">)</span> : m_len<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strlen</span><span style="color: #ffffff;">(</span>str<span style="color: #ffffff;">)</span> <span style="color: #ffffff;">}</span>, m_str<span style="color: #ffffff;">{</span> <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span><span style="color: #feacd0;">malloc</span><span style="color: #ffffff;">(</span>m_len + <span style="color: #00bcff;">1</span><span style="color: #ffffff;">))</span> <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #ff5f59; font-weight: bold;">!</span>m_str<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #b6a0ff;">throw</span> <span style="color: #00bcff;">std</span>::runtime_error<span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Cannot allocate memory!"</span> <span style="color: #ffffff;">}</span>;
           <span style="color: #ffffff;">}</span>

           <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strcpy</span><span style="color: #ffffff;">(</span>m_str, str<span style="color: #ffffff;">)</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Explicitly defined copy assignment operator to make deep-copy instead of shallow-copy to prevent copying pointers.</span>
       <span style="color: #6ae4b9;">String</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">String</span>&amp; <span style="color: #ffffff;">other</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Return directly if the object is assigned to itself.</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">this</span> == &amp;other<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #b6a0ff;">return</span> *<span style="color: #b6a0ff;">this</span>;
           <span style="color: #ffffff;">}</span>

           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is just for demonstration.</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We free already existing resource and reallocate for new string.</span>
           <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">free</span><span style="color: #ffffff;">(</span>m_str<span style="color: #ffffff;">)</span>;

           m_len = other.m_len;
           m_str = <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span><span style="color: #feacd0;">malloc</span><span style="color: #ffffff;">(</span>m_len + <span style="color: #00bcff;">1</span><span style="color: #ffffff;">))</span>;

           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #ff5f59; font-weight: bold;">!</span>m_str<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #b6a0ff;">throw</span> <span style="color: #00bcff;">std</span>::runtime_error<span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Cannot allocate memory!"</span> <span style="color: #ffffff;">}</span>;
           <span style="color: #ffffff;">}</span>

           <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strcpy</span><span style="color: #ffffff;">(</span>m_str, other.m_str<span style="color: #ffffff;">)</span>;

           <span style="color: #b6a0ff;">return</span> *<span style="color: #b6a0ff;">this</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">'['</span> &lt;&lt; m_str &lt;&lt; <span style="color: #79a8ff;">"]\n"</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #feacd0;">length</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #b6a0ff;">return</span> m_len;        
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">free</span><span style="color: #ffffff;">(</span>m_str<span style="color: #ffffff;">)</span>;
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #ffffff;">m_len</span>;
       <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">m_str</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">String</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Hello world!"</span> <span style="color: #ffffff;">}</span>;
       <span style="color: #6ae4b9;">String</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"y"</span> <span style="color: #ffffff;">}</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The copy assignment will be called for object 'x'.</span>
       x = y;

       x.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The desctructor for object 'x' will be called here and the memory allocated for object 'x' will be freed.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
