notes.org
**** Move constructor
 The ~move constructor~ is called when a ~class object~ instantiated by transfering/stealing its value from another ~class object~ of the same type. The ~move constructor~ has the same name as the class and takes a ~R-value reference~ parameter of that class type. Unlike the ~copy constructor~, the ~move constructor~ does not copy values but moves/transfers/steals them.

 ~move constructor~ which is ~defaulted~ by the compiler must be:
 - ~non-static~
 - ~inline~ (because it will be defined in ~class definition~, meaning it is implicitly ~inline~)
 - ~public~
 function of a class.

 The compiler will generate code for a ~move constructor~ that initializes all ~non-static data members~ by stealing their value from the ~class object~ being moved:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // The compiler will generate something like this as a move constructor. All non-static data members are initialized by stealing their value from other class object. Initilization will be in declaration order as in other constructors. After the object is instantiated the move constructor sets transfered/stealed values of the other object to valid but unspecified state. Additionaly, if a non-static data member is another class object its move constructor will also be called. In this example, the move constructor of std::string (cx) object will be called. To be able to call the move constructor for cx std::move is needed because other.cx is L-value expression and it must be converted to R-value reference by using std::move to call the move constructor. If we do not convert it to R-value reference by using std::move the copy constructor would be called instead of the move constructor.
       // C1(const C1& other) : ax(other.ax), bx(other.bx), cx(std::move(other.cx))
       // {
              // other.ax = 0;
              // other.bx = 0;
              // The compiler can also add extra code depending on its implementation.
       // }
   private:
       int ax;
       double bx;
       std::string cx;
   };
 #+END_SRC

~explicitly defined move constructor~ to move the object instead of copying:
 #+BEGIN_SRC C++ :includes <iostream> <stdexcept> <cstdlib> <cstring>
   class String
   {
   public:
       String() = default;
       String(const char* str) : m_len{ std::strlen(str) }, m_str{ static_cast<char*>(malloc(m_len + 1)) }
       {
           if (!m_str)
           {
               throw std::runtime_error{ "Cannot allocate memory!" };
           }

           std::strcpy(m_str, str);
       }

       // Explicitly defined move construtor to move the object instead of making deep copy. 
       String(String&& other) : m_len{ other.m_len }, m_str{ other.m_str }
       {
           // m_str and m_len values are stealed from other.m_str and other.m_len.
           // We also set other.m_str and other.m_len to valid but unspecified state (usually 0, nullptr)
           // so the destructor will not be called for the moved object and if it is possible it can be used
           // later by assigning another object etc.
           other.m_str = nullptr;
           other.m_len = 0;
       }
       
       void print() const
       {
           std::cout << '[' << m_str << "]\n";
       }

       std::size_t length() const
       {
           return m_len;        
       }

       ~String()
       {
           // This check is needed after we implement the move constructor because if the object is moved the destructor should not be called for the object.
           if (m_str)
           {
               std::free(m_str);
           }
       }

   private:
       std::size_t m_len;
       char* m_str;
   };

   String func()
   {
       String str{ "func" };
       return str;
   }

   int main()
   {
       // The move constructor will be called for object 'x', because the return value of func() is R-value.
       // First, the constructor will be called for str{ "func" } then its resources will be moved the
       // objext 'x' by calling x's move constructor.
       String x = func();

       x.print();

       // The desctructor for object 'x' will be called here and the memory allocated for object 'x' will be freed.
   }
 #+END_SRC

