notes.html
<li><a id="org5e658f7"></a>Move constructor<br />
<div class="outline-text-5" id="text-org5e658f7">
<p>
The <code>move constructor</code> is called when a <code>class object</code> instantiated by transfering/stealing its value from another <code>class object</code> of the same type. The <code>move constructor</code> has the same name as the class and takes a <code>R-value reference</code> parameter of that class type. Unlike the <code>copy constructor</code>, the <code>move constructor</code> does not copy values but moves/transfers/steals them.
</p>

<p>
<code>move constructor</code> which is <code>defaulted</code> by the compiler must be:
</p>
<ul class="org-ul">
<li><code>non-static</code></li>
<li><code>inline</code> (because it will be defined in <code>class definition</code>, meaning it is implicitly <code>inline</code>)</li>
<li><code>public</code></li>
</ul>
<p>
function of a class.
</p>

<p>
The compiler will generate code for a <code>move constructor</code> that initializes all <code>non-static data members</code> by stealing their value from the <code>class object</code> being moved:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The compiler will generate something like this as a move constructor. All non-static data members are initialized by stealing their value from other class object. Initilization will be in declaration order as in other constructors. After the object is instantiated the move constructor sets transfered/stealed values of the other object to valid but unspecified state. Additionaly, if a non-static data member is another class object its move constructor will also be called. In this example, the move constructor of std::string (cx) object will be called. To be able to call the move constructor for cx std::move is needed because other.cx is L-value expression and it must be converted to R-value reference by using std::move to call the move constructor. If we do not convert it to R-value reference by using std::move the copy constructor would be called instead of the move constructor.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(const C1&amp; other) : ax(other.ax), bx(other.bx), cx(std::move(other.cx))</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">{</span>
              <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">other.ax = 0;</span>
              <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">other.bx = 0;</span>
              <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The compiler can also add extra code depending on its implementation.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">ax</span>;
       <span style="color: #6ae4b9;">double</span> <span style="color: #ffffff;">bx</span>;
       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">string</span> <span style="color: #ffffff;">cx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>explicitly defined move constructor</code> to move the object instead of copying:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">String</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
       <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">str</span><span style="color: #ffffff;">)</span> : m_len<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strlen</span><span style="color: #ffffff;">(</span>str<span style="color: #ffffff;">)</span> <span style="color: #ffffff;">}</span>, m_str<span style="color: #ffffff;">{</span> <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span><span style="color: #feacd0;">malloc</span><span style="color: #ffffff;">(</span>m_len + <span style="color: #00bcff;">1</span><span style="color: #ffffff;">))</span> <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #ff5f59; font-weight: bold;">!</span>m_str<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #b6a0ff;">throw</span> <span style="color: #00bcff;">std</span>::runtime_error<span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Cannot allocate memory!"</span> <span style="color: #ffffff;">}</span>;
           <span style="color: #ffffff;">}</span>

           <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strcpy</span><span style="color: #ffffff;">(</span>m_str, str<span style="color: #ffffff;">)</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Explicitly defined move construtor to move the object instead of making deep copy. </span>
       <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">String</span>&amp;&amp; <span style="color: #ffffff;">other</span><span style="color: #ffffff;">)</span> : m_len<span style="color: #ffffff;">{</span> other.m_len <span style="color: #ffffff;">}</span>, m_str<span style="color: #ffffff;">{</span> other.m_str <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">m_str and m_len values are stealed from other.m_str and other.m_len.</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We also set other.m_str and other.m_len to valid but unspecified state (usually 0, nullptr)</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">so the destructor will not be called for the moved object and if it is possible it can be used</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">later by assigning another object etc.</span>
           other.m_str = <span style="color: #00bcff;">nullptr</span>;
           other.m_len = <span style="color: #00bcff;">0</span>;
       <span style="color: #ffffff;">}</span>
       
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">'['</span> &lt;&lt; m_str &lt;&lt; <span style="color: #79a8ff;">"]\n"</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #feacd0;">length</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #b6a0ff;">return</span> m_len;        
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This check is needed after we implement the move constructor because if the object is moved the destructor should not be called for the object.</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span>m_str<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">free</span><span style="color: #ffffff;">(</span>m_str<span style="color: #ffffff;">)</span>;
           <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #ffffff;">m_len</span>;
       <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">m_str</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">String</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">String</span> <span style="color: #ffffff;">str</span><span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"func"</span> <span style="color: #ffffff;">}</span>;
       <span style="color: #b6a0ff;">return</span> str;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The move constructor will be called for object 'x', because the return value of func() is R-value.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">First, the constructor will be called for str{ "func" } then its resources will be moved the</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">objext 'x' by calling x's move constructor.</span>
       <span style="color: #6ae4b9;">String</span> <span style="color: #ffffff;">x</span> = <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

       x.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The desctructor for object 'x' will be called here and the memory allocated for object 'x' will be freed.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
