notes.org
**** Move assignment operator/function
The ~move assignment operator~ is called when a ~class object~ is assigned to another ~R-value class object~ of the same type. There is no instantiation when the ~move assignment operator~ is called, because to assign one ~class object~ to another ~class object~, both ~class objects~ must already be instantiated. The ~move assignment operator~ takes a ~R-value reference~ parameter of that class type and ~returns~ ~L-value reference~ of the same class type.

~move assignment operator~ which is ~defaulted~ by the compiler must be:
 - ~non-static~
 - ~inline~ (because it will be defined in ~class definition~, meaning it is implicitly ~inline~)
 - ~public~
 function of a class.

 #+BEGIN_SRC C++
   class C1
   {
   public:
        // The compiler will generate something like this as a move assignment operator. All non-static data members are assigned by stealing their values from other class object's non-static data members. Assignments will be in declaration order.
       //C1& operator=(C1&& other)
       //{
       //    ax = other.ax;
       //    bx = other.bx;
       //
       //    other.ax = 0;
       //    other.bx = 0;
       //
       //    return *this;
       //}

   private:
       int ax;
       int bx;
   };
 #+END_SRC

 ~explicitly defined move assignment~ to move the object instead of copying:
 #+BEGIN_SRC C++
   class String
   {
   public:
       String() = default;
       String(const char* str) : m_len{ std::strlen(str) }, m_str{ static_cast<char*>(malloc(m_len + 1)) }
       {
           if (!m_str)
           {
               throw std::runtime_error{ "Cannot allocate memory!" };
           }

           std::strcpy(m_str, str);
       }

       // Explicitly defined move assignment to move the object instead of making deep copy. 
       String& operator=(String&& other)
       {
           // Return directly if the object is assigned to itself.
           if (this == &other)
           {
               return *this;
           }

           // Free the resource we already have first.
           std::free(m_str);

           // Steals the values of other
           m_str = other.m_str;
           m_len = other.m_len;
           other.m_str = nullptr;
           other.m_len = 0;

           return *this;
       }

       void print() const
       {
           std::cout << '[' << m_str << "]\n";
       }

       std::size_t length() const
       {
           return m_len;        
       }

       ~String()
       {
           // This check is needed after we implement the move constructor and move assignment because if the object is moved the destructor should not be called for the object.
           if (m_str)
           {
               std::free(m_str);
           }
       }

   private:
       std::size_t m_len;
       char* m_str;
   };

   int main()
   {
       String x{ "x" };

       // The move assignment operator of 'x' will be called and the resources of String{ "y" } object will be transfered to 'x'.
       x = String{ "y" };

       x.print();

       // The desctructor for object 'x' will be called here and the memory allocated for object 'x' will be freed.
   }
 #+END_SRC

