notes.html
<li><a id="org133e712"></a>Move assignment operator/function<br />
<div class="outline-text-5" id="text-org133e712">
<p>
The <code>move assignment operator</code> is called when a <code>class object</code> is assigned to another <code>R-value class object</code> of the same type. There is no instantiation when the <code>move assignment operator</code> is called, because to assign one <code>class object</code> to another <code>class object</code>, both <code>class objects</code> must already be instantiated. The <code>move assignment operator</code> takes a <code>R-value reference</code> parameter of that class type and <code>returns</code> <code>L-value reference</code> of the same class type.
</p>

<p>
<code>move assignment operator</code> which is <code>defaulted</code> by the compiler must be:
</p>
<ul class="org-ul">
<li><code>non-static</code></li>
<li><code>inline</code> (because it will be defined in <code>class definition</code>, meaning it is implicitly <code>inline</code>)</li>
<li><code>public</code></li>
</ul>
<p>
function of a class.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
        <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The compiler will generate something like this as a move assignment operator. All non-static data members are assigned by stealing their values from other class object's non-static data members. Assignments will be in declaration order.</span>
       <span style="color: #989898; font-style: italic;">//</span><span style="color: #989898; font-style: italic;">C1&amp; operator=(C1&amp;&amp; other)</span>
       <span style="color: #989898; font-style: italic;">//</span><span style="color: #989898; font-style: italic;">{</span>
       <span style="color: #989898; font-style: italic;">//    </span><span style="color: #989898; font-style: italic;">ax = other.ax;</span>
       <span style="color: #989898; font-style: italic;">//    </span><span style="color: #989898; font-style: italic;">bx = other.bx;</span>
       <span style="color: #989898; font-style: italic;">//</span>
       <span style="color: #989898; font-style: italic;">//    </span><span style="color: #989898; font-style: italic;">other.ax = 0;</span>
       <span style="color: #989898; font-style: italic;">//    </span><span style="color: #989898; font-style: italic;">other.bx = 0;</span>
       <span style="color: #989898; font-style: italic;">//</span>
       <span style="color: #989898; font-style: italic;">//    </span><span style="color: #989898; font-style: italic;">return *this;</span>
       <span style="color: #989898; font-style: italic;">//</span><span style="color: #989898; font-style: italic;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">ax</span>;
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">bx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>explicitly defined move assignment</code> to move the object instead of copying:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">String</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
       <span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">str</span><span style="color: #ffffff;">)</span> : m_len<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strlen</span><span style="color: #ffffff;">(</span>str<span style="color: #ffffff;">)</span> <span style="color: #ffffff;">}</span>, m_str<span style="color: #ffffff;">{</span> <span style="color: #b6a0ff;">static_cast</span>&lt;<span style="color: #6ae4b9;">char</span>*&gt;<span style="color: #ffffff;">(</span><span style="color: #feacd0;">malloc</span><span style="color: #ffffff;">(</span>m_len + <span style="color: #00bcff;">1</span><span style="color: #ffffff;">))</span> <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #ff5f59; font-weight: bold;">!</span>m_str<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #b6a0ff;">throw</span> <span style="color: #00bcff;">std</span>::runtime_error<span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"Cannot allocate memory!"</span> <span style="color: #ffffff;">}</span>;
           <span style="color: #ffffff;">}</span>

           <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">strcpy</span><span style="color: #ffffff;">(</span>m_str, str<span style="color: #ffffff;">)</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Explicitly defined move assignment to move the object instead of making deep copy. </span>
       <span style="color: #6ae4b9;">String</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">String</span>&amp;&amp; <span style="color: #ffffff;">other</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Return directly if the object is assigned to itself.</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">this</span> == &amp;other<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #b6a0ff;">return</span> *<span style="color: #b6a0ff;">this</span>;
           <span style="color: #ffffff;">}</span>

           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Free the resource we already have first.</span>
           <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">free</span><span style="color: #ffffff;">(</span>m_str<span style="color: #ffffff;">)</span>;

           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Steals the values of other</span>
           m_str = other.m_str;
           m_len = other.m_len;
           other.m_str = <span style="color: #00bcff;">nullptr</span>;
           other.m_len = <span style="color: #00bcff;">0</span>;

           <span style="color: #b6a0ff;">return</span> *<span style="color: #b6a0ff;">this</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">'['</span> &lt;&lt; m_str &lt;&lt; <span style="color: #79a8ff;">"]\n"</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #feacd0;">length</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #b6a0ff;">return</span> m_len;        
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">String</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This check is needed after we implement the move constructor and move assignment because if the object is moved the destructor should not be called for the object.</span>
           <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span>m_str<span style="color: #ffffff;">)</span>
           <span style="color: #ffffff;">{</span>
               <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">free</span><span style="color: #ffffff;">(</span>m_str<span style="color: #ffffff;">)</span>;
           <span style="color: #ffffff;">}</span>
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">size_t</span> <span style="color: #ffffff;">m_len</span>;
       <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">m_str</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">String</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"x"</span> <span style="color: #ffffff;">}</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The move assignment operator of 'x' will be called and the resources of String{ "y" } object will be transfered to 'x'.</span>
       x = String<span style="color: #ffffff;">{</span> <span style="color: #79a8ff;">"y"</span> <span style="color: #ffffff;">}</span>;

       x.<span style="color: #feacd0;">print</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The desctructor for object 'x' will be called here and the memory allocated for object 'x' will be freed.</span>
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
