notes.org
**** When special member functions are defaulted, deleted or not declared by the compiler?
| User declared / Implicitly declared by the compiler | Default constructor | Destructor    | Copy constructor | Copy assignment | Move constructor | Move assignment |
|-----------------------------------------------------+---------------------+---------------+------------------+-----------------+------------------+-----------------|
| /                                                   | <                   |               |                  |                 |                  | >               |
| Nothing                                             | defaulted           | defaulted     | defaulted        | defaulted       | defaulted        | defaulted       |
| Any constructor                                     | not declared        | defaulted     | defaulted        | defaulted       | defaulted        | defaulted       |
| Default constructor                                 | user declared       | defaulted     | defaulted        | defaulted       | defaulted        | defaulted       |
| Destructor                                          | defaulted           | user declared | defaulted        | defaulted       | not declared     | not declared    |
| Copy constructor                                    | not declared        | defaulted     | user declared    | defaulted       | not declared     | not declared    |
| Copy assignment                                     | defaulted           | defaulted     | defaulted        | user declared   | not declared     | not declared    |
| Move constructor                                    | not declared        | defaulted     | deleted          | deleted         | user declared    | not declared    |
| Move assignment                                     | defaulted           | defaulted     | deleted          | deleted         | not declared     | user declared   |

In summary:
- If ~destructor~ is not ~user declared~, it is always ~defaulted~.
- If any ~constructor~ (non-special or special) is ~user declared~, ~default constructor~ is ~not declared~ and otherwise it is ~defaulted~.
- If one of ~destructor~, ~copy constructor~ or ~copy assignment operator~ is ~user declared~, ~move members~ are ~not declared~.
- If one of ~move constructor~ or ~move assignment operator~ is ~user declared~, ~copy members~ are ~deleted~, and other ~move member~ is ~not declared~.

When nothing is ~user declared~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // C1() = default;
       // ~C1() = default;
       // C1(const C1&) = default;
       // C1& operator=(const C1&) = default;
       // C1(C1&&) = default;
       // C1& operator=(C1&&) = default;
   };
 #+END_SRC

When the ~default constructor~ is ~user declared~: 
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() = default;
       // ~C1() = default;
       // C1(const C1&) = default;
       // C1& operator=(const C1&) = default;
       // C1(C1&&) = default;
       // C1& operator=(C1&&) = default;
   };
 #+END_SRC

When the ~destructor~ is ~user declared~: 
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // C1() = default;
       ~C1() = default;
       // C1(const C1&) = default;
       // C1& operator=(const C1&) = default;
       // Move constructor is not declared.
       // Move assignment operator is not declared.
   };
 #+END_SRC

When the ~copy constructor~ is ~user declared~: 
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // Default constructor is not declared.
       // ~C1() = default;
       C1(const C1&) = default;
       // C1& operator=(const C1&) = default;
       // Move constructor is not declared.
       // Move assignment operator is not declared.
   };
 #+END_SRC

When the ~copy assignment operator~ is ~user declared~: 
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // C1() = default;
       // ~C1() = default;
       // C1(const C1&) = default;
       C1& operator=(const C1&) = default;
       // Move constructor is not declared.
       // Move assignment operator is not declared.
   };
 #+END_SRC

When the ~move constructor~ is ~user declared~: 
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // Default constructor is not declared.
       // ~C1() = default;
       // C1(const C1&) = delete;
       // C1& operator=(const C1&) = delete;
       C1(C1&&) = default;
       // Move assignment operator is not declared.
   };
 #+END_SRC

When the ~move assignment operator~ is ~user declared~: 
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // C1() = default;
       // ~C1() = default;
       // C1(const C1&) = delete;
       // C1& operator=(const C1&) = delete;
       // Move constructor is not declared.
       C1& operator=(C1&&) = default;
   };
 #+END_SRC
 
It is possible to define a ~class~ which cannot be copied or moved:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1();
       C1(int);
       C1(const C1&) = delete;
       C1& operator=(const C1&) = delete;
       // Move constructor and move assignment operator is not declared because copy members are user declared.
       // ~C1() = default;

       // This class cannot be copied or moved. Copy members are deleted by user and move members are not declared.
   };

   int main()
   {
       C1 c1a;
       C1 c1b = c1a; // This is a syntax error. A deleted function(the copy constructor) cannot be referenced.

       return 0;
   }
 #+END_SRC

It is also possible to define a ~class~ which cannot be copied but can be moved:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1();
       C1(int);
       C1(const C1&) = delete;
       C1& operator=(const C1&) = delete;
       C1(C1&&);
       C1& operator=(C1&&);
       // ~C1() = default;

       // This class cannot be copied but can be moved.
   };

   int main()
   {
       C1 c1a;
       C1 c1b = c1a; // This is a syntax error. A deleted function(the copy constructor) cannot be referenced.
       C1 c1c = std::move(c1a); // This is valid. The object can be moved.

       return 0;
   }
 #+END_SRC
 
