notes.html
<li><a id="org1fe40b4"></a>When special member functions are defaulted, deleted or not declared by the compiler?<br />
<div class="outline-text-5" id="text-org1fe40b4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">User declared / Implicitly declared by the compiler</th>
<th scope="col" class="org-left">Default constructor</th>
<th scope="col" class="org-left">Destructor</th>
<th scope="col" class="org-left">Copy constructor</th>
<th scope="col" class="org-left">Copy assignment</th>
<th scope="col" class="org-left">Move constructor</th>
<th scope="col" class="org-left">Move assignment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Nothing</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
</tr>

<tr>
<td class="org-left">Any constructor</td>
<td class="org-left">not declared</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
</tr>

<tr>
<td class="org-left">Default constructor</td>
<td class="org-left">user declared</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
</tr>

<tr>
<td class="org-left">Destructor</td>
<td class="org-left">defaulted</td>
<td class="org-left">user declared</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">not declared</td>
<td class="org-left">not declared</td>
</tr>

<tr>
<td class="org-left">Copy constructor</td>
<td class="org-left">not declared</td>
<td class="org-left">defaulted</td>
<td class="org-left">user declared</td>
<td class="org-left">defaulted</td>
<td class="org-left">not declared</td>
<td class="org-left">not declared</td>
</tr>

<tr>
<td class="org-left">Copy assignment</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">user declared</td>
<td class="org-left">not declared</td>
<td class="org-left">not declared</td>
</tr>

<tr>
<td class="org-left">Move constructor</td>
<td class="org-left">not declared</td>
<td class="org-left">defaulted</td>
<td class="org-left">deleted</td>
<td class="org-left">deleted</td>
<td class="org-left">user declared</td>
<td class="org-left">not declared</td>
</tr>

<tr>
<td class="org-left">Move assignment</td>
<td class="org-left">defaulted</td>
<td class="org-left">defaulted</td>
<td class="org-left">deleted</td>
<td class="org-left">deleted</td>
<td class="org-left">not declared</td>
<td class="org-left">user declared</td>
</tr>
</tbody>
</table>

<p>
In summary:
</p>
<ul class="org-ul">
<li>If <code>destructor</code> is not <code>user declared</code>, it is always <code>defaulted</code>.</li>
<li>If any <code>constructor</code> (non-special or special) is <code>user declared</code>, <code>default constructor</code> is <code>not declared</code> and otherwise it is <code>defaulted</code>.</li>
<li>If one of <code>destructor</code>, <code>copy constructor</code> or <code>copy assignment operator</code> is <code>user declared</code>, <code>move members</code> are <code>not declared</code>.</li>
<li>If one of <code>move constructor</code> or <code>move assignment operator</code> is <code>user declared</code>, <code>copy members</code> are <code>deleted</code>, and other <code>move member</code> is <code>not declared</code>.</li>
</ul>

<p>
When nothing is <code>user declared</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1() = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">~C1() = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(const C1&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(const C1&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(C1&amp;&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(C1&amp;&amp;) = default;</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
When the <code>default constructor</code> is <code>user declared</code>: 
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">~C1() = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(const C1&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(const C1&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(C1&amp;&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(C1&amp;&amp;) = default;</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
When the <code>destructor</code> is <code>user declared</code>: 
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1() = default;</span>
       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(const C1&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(const C1&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move constructor is not declared.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move assignment operator is not declared.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
When the <code>copy constructor</code> is <code>user declared</code>: 
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Default constructor is not declared.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">~C1() = default;</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(const C1&amp;) = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move constructor is not declared.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move assignment operator is not declared.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
When the <code>copy assignment operator</code> is <code>user declared</code>: 
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1() = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">~C1() = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(const C1&amp;) = default;</span>
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move constructor is not declared.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move assignment operator is not declared.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
When the <code>move constructor</code> is <code>user declared</code>: 
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Default constructor is not declared.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">~C1() = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(const C1&amp;) = delete;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(const C1&amp;) = delete;</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move assignment operator is not declared.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
When the <code>move assignment operator</code> is <code>user declared</code>: 
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1() = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">~C1() = default;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1(const C1&amp;) = delete;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(const C1&amp;) = delete;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move constructor is not declared.</span>
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
It is possible to define a <code>class</code> which cannot be copied or moved:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">delete</span>;
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">delete</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move constructor and move assignment operator is not declared because copy members are user declared.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">~C1() = default;</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This class cannot be copied or moved. Copy members are deleted by user and move members are not declared.</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1a</span>;
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1b</span> = c1a; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is a syntax error. A deleted function(the copy constructor) cannot be referenced.</span>

       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
It is also possible to define a <code>class</code> which cannot be copied but can be moved:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">delete</span>;
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">delete</span>;
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span>;
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">~C1() = default;</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This class cannot be copied but can be moved.</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1a</span>;
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1b</span> = c1a; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is a syntax error. A deleted function(the copy constructor) cannot be referenced.</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1c</span> = <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">move</span><span style="color: #ffffff;">(</span>c1a<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid. The object can be moved.</span>

       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
