notes.org
*** Move Semantics
 ~move semantics~ allows efficient transfer of resources (memory, file handles etc.) from one object to another. It is particularly useful when dealing with expensive-to-copy objects, such as containers or objects that manage dynamic resources. ~R-value references~ enable ~move semantics~ by binding to ~temporary objects~ (~R-value expressions~) that are about to go out of scope. ~move constructor~ and ~move assignment operator~ are used for transfering ownership of resources from one object to another.

Resource to check: [[https://accu.org/conf-docs/PDFs_2014/Howard_Hinnant_Accu_2014.pdf][Everything You Ever Wanted To Know About Move Semantics]]

 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1();

       C1(const C1&); // Copy constructor
       C1(C1&&); // Move constructor

       C1& operator=(const C1&); // Copy assignment
       C1& operator=(C1&&); // Move assignment
   };

   C1 func();

   int main()
   {
       C1 c1a;
       C1 c1b = c1a; // c1a is L-value, copy constructor will be called and resources will be copied from c1a to c1b.
       c1b = c1a; // c1a is L-value, copy assignment will be called and resources will be copied from c1a to c1b.

       C1 c1c = func(); // Return value of func() is R-value, move constructor will be called and resources will be transfered from returned object to c1c.
       c1c = func(); // Return value of func() is R-value, move assignment will be called and resources will be transfered from returned object to c1c.

       return 0;
   }
 #+END_SRC

 It is also possible to transfer the resources of ~L-value expressions~ by converting them to ~R-value references~. ~std::move~ can be used for this:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() = default;

       C1(const C1&)
       {
           std::cout << "Copy constructor\n";
       }
       
       C1(C1&&)
       {
           std::cout << "Move constructor\n";
       }
   };

   C1 func();

   int main()
   {
       C1 c1a;
       C1 c1b = c1a; // Copy constrcutor will be called.
       C1 c1c = std::move(c1b); // c1b is L-value but we convert it to R-value reference, move constructor will be called and resources will be transfered from c1b to c1.

       return 0;
   }
 #+END_SRC

 ~move semantics~ and ~function overloading~:
 #+BEGIN_SRC C++
   // This overload will be called for L-value expressions.
   void func(const std::string& s)
   {
       std::string str(s); // The copy constructor will be called for str.
   }

   // This overload will be called for R-value expressions.
   void func(std::string&& s)
   {
       // We still need std::move to call the move constructor because even the data type of
       // 's' is R-value reference, the value category of expression 's' is L-value expression.
       std::string str(std::move(s)); // The move constructor will be called.
   }

   int main()
   {
       std::string s(100, '+');

       func(s); // void func(const std::string& s) will be called.
       func(std::string(100, '-')); // void func(std::string&& s) will be called.

       return 0;
   }
 #+END_SRC

 It is not possible to transfer/steal resources of a ~const class object~. ~const object~ means the object will never change in its lifetime, so it cannot be moved:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() = default;

       C1(const C1&)
       {
           std::cout << "Copy constructor\n";
       }

       C1(C1&&)
       {
           std::cout << "Move constructor\n";
       }
   };

   int main()
   {
       const C1 x;
       // std::move will return const R-value reference type because object 'x' is const. Copy constructor will be choosen in function overload resolution  because according to rules const overload has the priority. So, object 'x' is copied to 'y' instead of being moved
       C1 y = std::move(x);

       return 0;
   }
 #+END_SRC

 It is more about the ~function overload resolution~ rules rather than ~move semantics~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() = default;
   };

   void func(const C1&)
   {
       std::cout << "void func(const C1&)\n";
   }

   void func(C1&&)
   {
       
       std::cout << "void func(C1&&)\n";
   }

   int main()
   {
       C1 x;
       const C1 cx;

       func(x); // void func(const C1&) will be called.
       func(std::move(x)); // void func(C1&&) will be called.
       func(cx); // void func(const C1&) will be called.
       func(std::move(cx)); // void func(const C1&) will be called.
       
       return 0;
   }
 #+END_SRC

