notes.html
<div id="outline-container-org156f984" class="outline-4">
<h4 id="org156f984">Move Semantics</h4>
<div class="outline-text-4" id="text-org156f984">
<p>
<code>move semantics</code> allows efficient transfer of resources (memory, file handles etc.) from one object to another. It is particularly useful when dealing with expensive-to-copy objects, such as containers or objects that manage dynamic resources. <code>R-value references</code> enable <code>move semantics</code> by binding to <code>temporary objects</code> (<code>R-value expressions</code>) that are about to go out of scope. <code>move constructor</code> and <code>move assignment operator</code> are used for transfering ownership of resources from one object to another.
</p>

<p>
Resource to check: <a href="https://accu.org/conf-docs/PDFs_2014/Howard_Hinnant_Accu_2014.pdf">Everything You Ever Wanted To Know About Move Semantics</a>
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Copy constructor</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move constructor</span>

       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Copy assignment</span>
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Move assignment</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">C1</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1a</span>;
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1b</span> = c1a; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1a is L-value, copy constructor will be called and resources will be copied from c1a to c1b.</span>
       c1b = c1a; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1a is L-value, copy assignment will be called and resources will be copied from c1a to c1b.</span>

       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1c</span> = <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Return value of func() is R-value, move constructor will be called and resources will be transfered from returned object to c1c.</span>
       c1c = <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Return value of func() is R-value, move assignment will be called and resources will be transfered from returned object to c1c.</span>

       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
It is also possible to transfer the resources of <code>L-value expressions</code> by converting them to <code>R-value references</code>. <code>std::move</code> can be used for this:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;

       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Copy constructor\n"</span>;
       <span style="color: #ffffff;">}</span>
       
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Move constructor\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">C1</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1a</span>;
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1b</span> = c1a; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Copy constrcutor will be called.</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1c</span> = <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">move</span><span style="color: #ffffff;">(</span>c1b<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1b is L-value but we convert it to R-value reference, move constructor will be called and resources will be transfered from c1b to c1.</span>

       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>move semantics</code> and <code>function overloading</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This overload will be called for L-value expressions.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">string</span>&amp; <span style="color: #ffffff;">s</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">string</span> <span style="color: #feacd0;">str</span><span style="color: #ffffff;">(</span>s<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The copy constructor will be called for str.</span>
   <span style="color: #ffffff;">}</span>

   <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This overload will be called for R-value expressions.</span>
   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">string</span>&amp;&amp; <span style="color: #ffffff;">s</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We still need std::move to call the move constructor because even the data type of</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">'s' is R-value reference, the value category of expression 's' is L-value expression.</span>
       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">string</span> <span style="color: #feacd0;">str</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">move</span><span style="color: #ffffff;">(</span>s<span style="color: #ffffff;">))</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The move constructor will be called.</span>
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">string</span> <span style="color: #feacd0;">s</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">100</span>, <span style="color: #79a8ff;">'+'</span><span style="color: #ffffff;">)</span>;

       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>s<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">void func(const std::string&amp; s) will be called.</span>
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">string</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">100</span>, <span style="color: #79a8ff;">'-'</span><span style="color: #ffffff;">))</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">void func(std::string&amp;&amp; s) will be called.</span>

       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
It is not possible to transfer/steal resources of a <code>const class object</code>. <code>const object</code> means the object will never change in its lifetime, so it cannot be moved:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;

       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Copy constructor\n"</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Move constructor\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">x</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">std::move will return const R-value reference type because object 'x' is const. Copy constructor will be choosen in function overload resolution  because according to rules const overload has the priority. So, object 'x' is copied to 'y' instead of being moved</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">y</span> = <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">move</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>;

       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
It is more about the <code>function overload resolution</code> rules rather than <code>move semantics</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> = <span style="color: #b6a0ff;">default</span>;
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func(const C1&amp;)\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func(C1&amp;&amp;)\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">x</span>;
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">cx</span>;

       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">void func(const C1&amp;) will be called.</span>
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">move</span><span style="color: #ffffff;">(</span>x<span style="color: #ffffff;">))</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">void func(C1&amp;&amp;) will be called.</span>
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>cx<span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">void func(const C1&amp;) will be called.</span>
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">move</span><span style="color: #ffffff;">(</span>cx<span style="color: #ffffff;">))</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">void func(const C1&amp;) will be called.</span>
       
       <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">0</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</div>
