notes.org
*** Default member initializer / In-class initializer
~default member initializer~ is a way to declare how ~default initialization~ should be done for ~data members~ of classes.

~default member initializer~ will be used for ~data members~ which are not initialized explicitly:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // We do not initialize mx here but compiler will add mx{ 20 } here as default
       // because we declare default member initializer for mx. 
       C1() : my{ 10 } {}
   private:
       int mx{ 20 }; // Default member initializer / In-class initializer
       int my; // No default member initializer. If we don't initialize my explicity it will be default initialized to garbage value.
   };
 #+END_SRC

If a ~data member~ is initialized explicitly ~default member initializer~ will not be used:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // mx will be initialized to 30 and default member initializer will not be used, because mx is not default initialized.
       C1() : mx { 30 } {}
   private:
       int mx{ 20 }; // Default member initializer / In-class initializer
   };
 #+END_SRC

 ~direct-initilization~ syntax cannot be used for ~default member initializer~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       C1() : my { 30 } {}
   private:
       // int mx(20); // Invalid. Syntax error.
       int my{ 20 }; // Valid.
       int mz = 20 ; // Valid.
   };
 #+END_SRC

*** Delegating Constructor
 Classes can have multiple ~constructors~ with a common code. In such cases, a ~delegating constructor~ can be used to gather the common code into a single ~constructor~.

 #+BEGIN_SRC C++
   class C1
   {
   public:
       // Delegating constructors
       C1(int x) : C1(x, 0, 0) {}
       C1(const char* p) : C1(std::atoi(p), 0, 0) {}

       // This constructor will get called when other 2 constructor is called. It can also be called directly.
       C1(int, int, int)
       {
           
       }
   };
 #+END_SRC
 
 If a ~delegating constructor~ is used for a ~constructor~, the ~non-static data members~ cannot be initialized using ~constructor initializer list~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // Delegating constructor
       C1(int x) : C1(x, 0, 0), mx{ 10 } {} // This is syntax error. If a constructor is a delegating constructor, constructor initializer list cannot be used for initializing non-static data members.
       C1(const char* p) : C1(std::atoi(p), 0, 0) {}

       // This constructor will get called when other 2 constructors are called. It can also be called directly.
       C1(int, int, int)
       {
           
       }

   private:
       int mx;
   };
 #+END_SRC

 There can also be multiple ~delegating constructors~:
 #+BEGIN_SRC C++
   class C1
   {
   public:
       // This delegating constructor is calling another delegating constructor
       C1(int x) : C1(x, 0) {}
       // This is also delegating constructor
       C1(int x, int y) : C1(x, y, 0) {}

       C1(int x, int y, int z)
       {
           
       }
   };
 #+END_SRC

