notes.html
<div id="outline-container-org48dd706" class="outline-4">
<h4 id="org48dd706">Default member initializer / In-class initializer</h4>
<div class="outline-text-4" id="text-org48dd706">
<p>
<code>default member initializer</code> is a way to declare how <code>default initialization</code> should be done for <code>data members</code> of classes.
</p>

<p>
<code>default member initializer</code> will be used for <code>data members</code> which are not initialized explicitly:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We do not initialize mx here but compiler will add mx{ 20 } here as default</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">because we declare default member initializer for mx. </span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : my<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">10</span> <span style="color: #ffffff;">}</span> <span style="color: #ffffff;">{}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">20</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Default member initializer / In-class initializer</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">my</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">No default member initializer. If we don't initialize my explicity it will be default initialized to garbage value.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
If a <code>data member</code> is initialized explicitly <code>default member initializer</code> will not be used:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">mx will be initialized to 30 and default member initializer will not be used, because mx is not default initialized.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : mx <span style="color: #ffffff;">{</span> <span style="color: #00bcff;">30</span> <span style="color: #ffffff;">}</span> <span style="color: #ffffff;">{}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">20</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Default member initializer / In-class initializer</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
<code>direct-initilization</code> syntax cannot be used for <code>default member initializer</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> : my <span style="color: #ffffff;">{</span> <span style="color: #00bcff;">30</span> <span style="color: #ffffff;">}</span> <span style="color: #ffffff;">{}</span>
   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">int mx(20); // Invalid. Syntax error.</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">my</span><span style="color: #ffffff;">{</span> <span style="color: #00bcff;">20</span> <span style="color: #ffffff;">}</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mz</span> = <span style="color: #00bcff;">20</span> ; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Valid.</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org43710c7" class="outline-4">
<h4 id="org43710c7">Delegating Constructor</h4>
<div class="outline-text-4" id="text-org43710c7">
<p>
Classes can have multiple <code>constructors</code> with a common code. In such cases, a <code>delegating constructor</code> can be used to gather the common code into a single <code>constructor</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Delegating constructors</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span>x, <span style="color: #00bcff;">0</span>, <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{}</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">p</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">atoi</span><span style="color: #ffffff;">(</span>p<span style="color: #ffffff;">)</span>, <span style="color: #00bcff;">0</span>, <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{}</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This constructor will get called when other 2 constructor is called. It can also be called directly.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
If a <code>delegating constructor</code> is used for a <code>constructor</code>, the <code>non-static data members</code> cannot be initialized using <code>constructor initializer list</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Delegating constructor</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span>x, <span style="color: #00bcff;">0</span>, <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span>, mx<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">10</span> <span style="color: #ffffff;">}</span> <span style="color: #ffffff;">{}</span> <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is syntax error. If a constructor is a delegating constructor, constructor initializer list cannot be used for initializing non-static data members.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">char</span>* <span style="color: #ffffff;">p</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">atoi</span><span style="color: #ffffff;">(</span>p<span style="color: #ffffff;">)</span>, <span style="color: #00bcff;">0</span>, <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{}</span>

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This constructor will get called when other 2 constructors are called. It can also be called directly.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span>, <span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           
       <span style="color: #ffffff;">}</span>

   <span style="color: #b6a0ff;">private</span>:
       <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">mx</span>;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>

<p>
There can also be multiple <code>delegating constructors</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This delegating constructor is calling another delegating constructor</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span>x, <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{}</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is also delegating constructor</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span><span style="color: #ffffff;">)</span> : <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span>x, y, <span style="color: #00bcff;">0</span><span style="color: #ffffff;">)</span> <span style="color: #ffffff;">{}</span>

       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">x</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">y</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">z</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;
</pre>
</div>
</div>
</div>
