notes.org
*** Temporary Objects
 In some cases, even if there is no visible variable in the code, the compiler can create an object according to the rules. Such objects are called ~temporary objects~ and have different lifetimes. Expressions created by ~temporary objects~ are ~PR-value expressions~.

 #+BEGIN_SRC C++ :includes iostream
   class C1
   {
   public:
       C1()
       {
           std::cout << "Default constructor\n";
       }

       C1(int a, int b)
       {
           std::cout << "C1(int a, int b), a = " << a << " b = " << b << '\n';
       }
       
       ~C1()
       {
           std::cout << "Destructor\n";
       }
   };

   void func(const C1&)
   {
       std::cout << "void func(const C1&)\n";
   }

   void func(C1&&)
   {
       std::cout << "void func(C1&&)\n";
   }

   int main()
   {
       C1& r = C1(); // This is a syntax error. C1() is a temporary object and a PR-value expression. PR-value expressions cannot be bound to L-value references.
       // These are valid.
       const C1& cr = C1();
       C1&& rr = C1{ 1, 3 };

       func(C1{}); // If func() is called with a temporary object, the C1&& overload will be called because temporary objects are PR-value expressions.
       
   }
 #+END_SRC

 The life of a ~temporary object~ ends after the ~evaluation of the expression~ in which that ~temporary object expression~ is contained:
 #+BEGIN_SRC C++ :includes iostream
   class C1
   {
   public:
       C1()
       {
           std::cout << "Default constructor, this: " << this << '\n';
       }

       ~C1()
       {
           std::cout << "Destructor, this: " << this << '\n';
       }

       void func()
       {
           std::cout << "void func(), this: " << this << '\n';
       }
   };

   int main()
   {
       std::cout << "main() begins\n";
       C1{}.func();
       // The life of the C1{} (temporary object) has to end immediately in this point of the code. The destructor for C1{} will be called here (after the evaluation of the expression that contains temporary object, C1{}.func()).
       std::cout << "main() ends\n";
   }
 #+END_SRC

 If we want to call a function with an object and never use that object again, we can use ~temporary object~:
 #+BEGIN_SRC C++ :includes iostream vector
   void func(const std::vector<int>& vec)
   {
       
   }

   int main()
   {
       // We don't need ivec after calling func() but it will live until the end of scope.
       std::vector<int> ivec(10, 5);
       func(ivec);

       // We used a temporary object for calling func() and it will be destructed after this expression is evaluated. This prevents scope leakage.
       func(std::vector<int>(10, 5));
   }
 #+END_SRC

