notes.html
<div id="outline-container-orgde3dbb3" class="outline-4">
<h4 id="orgde3dbb3">Temporary Objects</h4>
<div class="outline-text-4" id="text-orgde3dbb3">
<p>
In some cases, even if there is no visible variable in the code, the compiler can create an object according to the rules. Such objects are called <code>temporary objects</code> and have different lifetimes. Expressions created by <code>temporary objects</code> are <code>PR-value expressions</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Default constructor\n"</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">a</span>, <span style="color: #6ae4b9;">int</span> <span style="color: #ffffff;">b</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1(int a, int b), a = "</span> &lt;&lt; a &lt;&lt; <span style="color: #79a8ff;">" b = "</span> &lt;&lt; b &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
       
       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Destructor\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func(const C1&amp;)\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">C1</span>&amp;&amp;<span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func(C1&amp;&amp;)\n"</span>;
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #ffffff;">r</span> = <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is a syntax error. C1() is a temporary object and a PR-value expression. PR-value expressions cannot be bound to L-value references.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These are valid.</span>
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #ffffff;">cr</span> = <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #6ae4b9;">C1</span>&amp;&amp; <span style="color: #ffffff;">rr</span> = C1<span style="color: #ffffff;">{</span> <span style="color: #00bcff;">1</span>, <span style="color: #00bcff;">3</span> <span style="color: #ffffff;">}</span>;

       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>C1<span style="color: #ffffff;">{})</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">If func() is called with a temporary object, the C1&amp;&amp; overload will be called because temporary objects are PR-value expressions.</span>
       
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
The life of a <code>temporary object</code> ends after the <code>evaluation of the expression</code> in which that <code>temporary object expression</code> is contained:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Default constructor, this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Destructor, this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func(), this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main() begins\n"</span>;
       C1<span style="color: #ffffff;">{}</span>.<span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The life of the C1{} (temporary object) has to end immediately in this point of the code. The destructor for C1{} will be called here (after the evaluation of the expression that contains temporary object, C1{}.func()).</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main() ends\n"</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
If we want to call a function with an object and never use that object again, we can use <code>temporary object</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">vector</span>&lt;<span style="color: #6ae4b9;">int</span>&gt;&amp; <span style="color: #ffffff;">vec</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       
   <span style="color: #ffffff;">}</span>

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We don't need ivec after calling func() but it will live until the end of scope.</span>
       <span style="color: #00bcff;">std</span>::<span style="color: #6ae4b9;">vector</span>&lt;<span style="color: #6ae4b9;">int</span>&gt; <span style="color: #feacd0;">ivec</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span>, <span style="color: #00bcff;">5</span><span style="color: #ffffff;">)</span>;
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span>ivec<span style="color: #ffffff;">)</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">We used a temporary object for calling func() and it will be destructed after this expression is evaluated. This prevents scope leakage.</span>
       <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">std</span>::vector&lt;<span style="color: #6ae4b9;">int</span>&gt;<span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span>, <span style="color: #00bcff;">5</span><span style="color: #ffffff;">))</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
<ul class="org-ul">
