notes.org
**** Life extension
 If a ~temporary object~ is bound to a ~reference~, its lifetime gets extended to the end of the scope of that ~reference~. This is called ~life extension~.

 #+BEGIN_SRC C++ :includes iostream
   class C1
   {
   public:
       C1()
       {
           std::cout << "Default constructor, this: " << this << '\n';
       }

       ~C1()
       {
           std::cout << "Destructor, this: " << this << '\n';
       }

       void func()
       {
           std::cout << "void func(), this: " << this << '\n';
       }
   };

   int main()
   {
       std::cout << "main() begins\n";

       if (1)
       {
           C1&& r = C1{};
           std::cout << "main() continues\n";
           r.func(); // The temporary object C1{} is still alive here because it is bound to a reference 'r'.
           // The destructor for the temporary object will be called here.
       }

       std::cout << "main() ends\n";
   }
 #+END_SRC

