notes.html
<li><a id="org3c0c471"></a>Life extension<br />
<div class="outline-text-5" id="text-org3c0c471">
<p>
If a <code>temporary object</code> is bound to a <code>reference</code>, its lifetime gets extended to the end of the scope of that <code>reference</code>. This is called <code>life extension</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Default constructor, this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"Destructor, this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func(), this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main() begins\n"</span>;

       <span style="color: #feacd0;">if </span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">1</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #6ae4b9;">C1</span>&amp;&amp; <span style="color: #ffffff;">r</span> = C1<span style="color: #ffffff;">{}</span>;
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main() continues\n"</span>;
           r.<span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The temporary object C1{} is still alive here because it is bound to a reference 'r'.</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">The destructor for the temporary object will be called here.</span>
       <span style="color: #ffffff;">}</span>

       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main() ends\n"</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
