notes.org
*** Reference qualifiers
 Normally the ~non-static member functions~ of a ~class~ can be called both with ~class objects~ whose value category is ~L-value expression~ and with class objects whose value category is ~R-value expression~. However, in some cases, we may want to prevent the function from being called for ~class objects~ with the ~R-value expression~ category, or to create separate implementations for ~class objects~ with the ~L-value expression~ category and class objects with the ~R-value expression~ category. ~Reference qualifiers~ can be used the implement this behaviour.

#+BEGIN_SRC C++ :includes iostream
   class C1
   {
   public:
       // This function can only be called with L-value expressions.
       void f1()&; // & -> L-value reference qualifier
       // This function can only be called with R-value expressions.
       void f2()&&; // & -> R-value reference qualifier
   };

   int main()
   {
       C1 c1;

       // This is valid. c1 is a L-value expression. f1() is L-value reference qualified.
       c1.f1();
       // This is valid. C1{} is a R-value expression. f2() is R-value reference qualified.
       C1{}.f2();
       // This is valid. std::move(c1) is a X-value expression (R-value expression). f2() is R-value reference qualified.
       std::move(c1).f2();

        // This is a syntax error. std::move(c1) is X-value expression (R-value expression). f1() is L-value reference qualified.
       std::move(c1).f1();
       // This is syntax error. C1{} is a R-value expression. f1() is L-value reference qualified.
       C1{}.f1();
       // This is syntax error. c1 is a L-value expression. f2() is R-value reference qualified.
       c1.f2();
   }
 #+END_SRC

 Functions with ~reference qualifiers~ can also be overloeaded:
#+NAME: REFERENCE_QUALIFIER_01 
#+BEGIN_SRC C++ :includes iostream :results output :exports both :wrap example
   class C1
   {
   public:
       // These are valid overloads.
       void func() &
       {
           std::cout << "void func() &\n";
       }

       void func() const &
       {
           std::cout << "void func() const &\n";
       }

       void func() &&
       {
           std::cout << "void func() &&\n";
       }
   };

   int main()
   {
       C1 c1; 
       const C1 cc1;

       // func() with L-value reference qualified will be called.
       c1.func();
       // func() with const L-value reference qualified will be called.
       cc1.func();
       // func() with R-value reference qualified will be called.
       C1{}.func();
   }
 #+END_SRC

 Output:
 #+RESULTS: REFERENCE_QUALIFIER_01
 #+begin_example
 void func() &
 void func() const &
 void func() &&
 #+end_example

 ~Temporary objects~ are assignable even it is not useful:
#+BEGIN_SRC C++
   class C1
   {

   };

   int main()
   {
       C1 c1; 

       // This is valid and can be prevented by making the class's operator= function L-value reference qualified.
       C1{} = c1;
   }
 #+END_SRC

 Making ~temporary objects~ of a class unassignable:
#+BEGIN_SRC C++
   class C1
   {
   public:
       // This is valid after C++20. Before C++20, reference qualified special member functions cannot be defaulted by the compiler.
       C1& operator=(const C1&) & = default;

       // Before C++20, reference qualified special functions must be defined explicitly.
       // C1& operator=(const C1& other) &
       // {
       //     // ...

       //     return *this;
       // }
   };

   int main()
   {
       C1 c1; 

       // This is invalid now because operator= is L-value reference qualified.
       C1{} = c1;
   }
 #+END_SRC

 If one of the oveloads of a function has a ~reference qualifier~ all overloads must have a ~reference qualifier~:
#+BEGIN_SRC C++
   class C1
   {
   public:
       // This is invalid. If an overload has a reference qualifier all of the other overloads also have to have a reference qualifier.
       void func();
       void func() &;
   };
 #+END_SRC
 
