notes.html
<div id="outline-container-org8a6c8eb" class="outline-4">
<h4 id="org8a6c8eb">Reference qualifiers</h4>
<div class="outline-text-4" id="text-org8a6c8eb">
<p>
Normally the <code>non-static member functions</code> of a <code>class</code> can be called both with <code>class objects</code> whose value category is <code>L-value expression</code> and with class objects whose value category is <code>R-value expression</code>. However, in some cases, we may want to prevent the function from being called for <code>class objects</code> with the <code>R-value expression</code> category, or to create separate implementations for <code>class objects</code> with the <code>L-value expression</code> category and class objects with the <code>R-value expression</code> category. <code>Reference qualifiers</code> can be used the implement this behaviour.
</p>

<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This function can only be called with L-value expressions.</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>&amp;; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">&amp; -&gt; L-value reference qualifier</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This function can only be called with R-value expressions.</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>&amp;&amp;; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">&amp; -&gt; R-value reference qualifier</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid. c1 is a L-value expression. f1() is L-value reference qualified.</span>
       c1.<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid. C1{} is a R-value expression. f2() is R-value reference qualified.</span>
       C1<span style="color: #ffffff;">{}</span>.<span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid. std::move(c1) is a X-value expression (R-value expression). f2() is R-value reference qualified.</span>
       <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">move</span><span style="color: #ffffff;">(</span>c1<span style="color: #ffffff;">)</span>.<span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;

        <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is a syntax error. std::move(c1) is X-value expression (R-value expression). f1() is L-value reference qualified.</span>
       <span style="color: #00bcff;">std</span>::<span style="color: #feacd0;">move</span><span style="color: #ffffff;">(</span>c1<span style="color: #ffffff;">)</span>.<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is syntax error. C1{} is a R-value expression. f1() is L-value reference qualified.</span>
       C1<span style="color: #ffffff;">{}</span>.<span style="color: #feacd0;">f1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is syntax error. c1 is a L-value expression. f2() is R-value reference qualified.</span>
       c1.<span style="color: #feacd0;">f2</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
Functions with <code>reference qualifiers</code> can also be overloeaded:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">These are valid overloads.</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> &amp;
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func() &amp;\n"</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">const</span> &amp;
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func() const &amp;\n"</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> &amp;&amp;
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"void func() &amp;&amp;\n"</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; 
       <span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">cc1</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func() with L-value reference qualified will be called.</span>
       c1.<span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func() with const L-value reference qualified will be called.</span>
       cc1.<span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">func() with R-value reference qualified will be called.</span>
       C1<span style="color: #ffffff;">{}</span>.<span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
<code>Temporary objects</code> are assignable even it is not useful:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>

   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; 

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid and can be prevented by making the class's operator= function L-value reference qualified.</span>
       C1<span style="color: #ffffff;">{}</span> = c1;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
Making <code>temporary objects</code> of a class unassignable:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is valid after C++20. Before C++20, reference qualified special member functions cannot be defaulted by the compiler.</span>
       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp;<span style="color: #ffffff;">)</span> &amp; = <span style="color: #b6a0ff;">default</span>;

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Before C++20, reference qualified special functions must be defined explicitly.</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">C1&amp; operator=(const C1&amp; other) &amp;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">{</span>
       <span style="color: #989898; font-style: italic;">//     </span><span style="color: #989898; font-style: italic;">// ...</span>

       <span style="color: #989898; font-style: italic;">//     </span><span style="color: #989898; font-style: italic;">return *this;</span>
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>; 

       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid now because operator= is L-value reference qualified.</span>
       C1<span style="color: #ffffff;">{}</span> = c1;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
If one of the oveloads of a function has a <code>reference qualifier</code> all overloads must have a <code>reference qualifier</code>:
</p>
<div class="org-src-container">
<pre class="src src-C++">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is invalid. If an overload has a reference qualifier all of the other overloads also have to have a reference qualifier.</span>
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>;
       <span style="color: #6ae4b9;">void</span> <span style="color: #feacd0;">func</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span> &amp;;
   <span style="color: #ffffff;">}</span>;
</pre>
</div>
</div>
</div>
