notes.html
<div id="outline-container-org7de554d" class="outline-4">
<h4 id="org7de554d">Conversion constructor</h4>
<div class="outline-text-4" id="text-org7de554d">
<p>
<code>Conversion constructors</code> can be used for implicit or explicit <code>type conversion</code>. <code>Non-class type expressions</code> can be converted to a <code>class type</code> using <code>conversion constructors</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++" id="org46ea885">   <span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">C1</span>
   <span style="color: #ffffff;">{</span>
   <span style="color: #b6a0ff;">public</span>:
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 default constructor, this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       ~<span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 destructor, this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>
       
       <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">This is a conversion constructor.</span>
       <span style="color: #feacd0;">C1</span><span style="color: #ffffff;">(</span><span style="color: #6ae4b9;">int</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1(int) constructor, this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
       <span style="color: #ffffff;">}</span>

       <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #b6a0ff;">operator</span><span style="color: #feacd0;">=</span><span style="color: #ffffff;">(</span><span style="color: #b6a0ff;">const</span> <span style="color: #6ae4b9;">C1</span>&amp; <span style="color: #ffffff;">other</span><span style="color: #ffffff;">)</span>
       <span style="color: #ffffff;">{</span>
           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"C1 copy assignment, this: "</span> &lt;&lt; <span style="color: #b6a0ff;">this</span> &lt;&lt; <span style="color: #79a8ff;">" other: "</span> &lt;&lt; &amp;other &lt;&lt; <span style="color: #79a8ff;">'\n'</span>;
           
           <span style="color: #b6a0ff;">return</span> *<span style="color: #b6a0ff;">this</span>;
       <span style="color: #ffffff;">}</span>
   <span style="color: #ffffff;">}</span>;

   <span style="color: #6ae4b9;">int</span> <span style="color: #feacd0;">main</span><span style="color: #ffffff;">(</span><span style="color: #ffffff;">)</span>
   <span style="color: #ffffff;">{</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main() begins\n"</span>;
       <span style="color: #ffffff;">{</span>
           <span style="color: #6ae4b9;">C1</span> <span style="color: #ffffff;">c1</span>;

           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">Normally this is invalid but the conversion constructor makes it possible.</span>
           c1 = <span style="color: #00bcff;">2</span>; <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">First, C1(12) is called and a temporary object is created then the copy assignment operator of c1 is called with this temporary object. c1.operator=(C1(12));</span>
           <span style="color: #989898; font-style: italic;">// </span><span style="color: #989898; font-style: italic;">c1 = C1(12); // Similar to this.</span>

           <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main() continues\n"</span>;
       <span style="color: #ffffff;">}</span>
       <span style="color: #00bcff;">std</span>::cout &lt;&lt; <span style="color: #79a8ff;">"main() ends"</span>;
   <span style="color: #ffffff;">}</span>
</pre>
</div>

<p>
Output:
</p>
<pre class="example" id="org8bfddca">
 main() begins
 C1 default constructor, this: 0x7ffdbc9c294e
 C1(int) constructor, this: 0x7ffdbc9c294f
 C1 copy assignment, this: 0x7ffdbc9c294e other: 0x7ffdbc9c294f
 C1 destructor, this: 0x7ffdbc9c294f
 main() continues
 C1 destructor, this: 0x7ffdbc9c294e
 main() ends
</pre>

<p>
cpp013 - 02:29:00
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nukoseer</p>
<p class="date">Created: 2024-12-02 Mon 15:44</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
